GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: RXFCON1
#define RXFCON1 RXFCON1
RXFCON1                                  equ 03707h
// bitfield definitions
RXFCON1_RXF8EN_POSN                      equ 0000h
RXFCON1_RXF8EN_POSITION                  equ 0000h
RXFCON1_RXF8EN_SIZE                      equ 0001h
RXFCON1_RXF8EN_LENGTH                    equ 0001h
RXFCON1_RXF8EN_MASK                      equ 0001h
RXFCON1_RXF9EN_POSN                      equ 0001h
RXFCON1_RXF9EN_POSITION                  equ 0001h
RXFCON1_RXF9EN_SIZE                      equ 0001h
RXFCON1_RXF9EN_LENGTH                    equ 0001h
RXFCON1_RXF9EN_MASK                      equ 0002h
RXFCON1_RXF10EN_POSN                     equ 0002h
RXFCON1_RXF10EN_POSITION                 equ 0002h
RXFCON1_RXF10EN_SIZE                     equ 0001h
RXFCON1_RXF10EN_LENGTH                   equ 0001h
RXFCON1_RXF10EN_MASK                     equ 0004h
RXFCON1_RXF11EN_POSN                     equ 0003h
RXFCON1_RXF11EN_POSITION                 equ 0003h
RXFCON1_RXF11EN_SIZE                     equ 0001h
RXFCON1_RXF11EN_LENGTH                   equ 0001h
RXFCON1_RXF11EN_MASK                     equ 0008h
RXFCON1_RXF12EN_POSN                     equ 0004h
RXFCON1_RXF12EN_POSITION                 equ 0004h
RXFCON1_RXF12EN_SIZE                     equ 0001h
RXFCON1_RXF12EN_LENGTH                   equ 0001h
RXFCON1_RXF12EN_MASK                     equ 0010h
RXFCON1_RXF13EN_POSN                     equ 0005h
RXFCON1_RXF13EN_POSITION                 equ 0005h
RXFCON1_RXF13EN_SIZE                     equ 0001h
RXFCON1_RXF13EN_LENGTH                   equ 0001h
RXFCON1_RXF13EN_MASK                     equ 0020h
RXFCON1_RXF14EN_POSN                     equ 0006h
RXFCON1_RXF14EN_POSITION                 equ 0006h
RXFCON1_RXF14EN_SIZE                     equ 0001h
RXFCON1_RXF14EN_LENGTH                   equ 0001h
RXFCON1_RXF14EN_MASK                     equ 0040h
RXFCON1_RXF15EN_POSN                     equ 0007h
RXFCON1_RXF15EN_POSITION                 equ 0007h
RXFCON1_RXF15EN_SIZE                     equ 0001h
RXFCON1_RXF15EN_LENGTH                   equ 0001h
RXFCON1_RXF15EN_MASK                     equ 0080h

// Register: RXF6SIDH
#define RXF6SIDH RXF6SIDH
RXF6SIDH                                 equ 03708h
// bitfield definitions
RXF6SIDH_SID3_POSN                       equ 0000h
RXF6SIDH_SID3_POSITION                   equ 0000h
RXF6SIDH_SID3_SIZE                       equ 0001h
RXF6SIDH_SID3_LENGTH                     equ 0001h
RXF6SIDH_SID3_MASK                       equ 0001h
RXF6SIDH_SID4_POSN                       equ 0001h
RXF6SIDH_SID4_POSITION                   equ 0001h
RXF6SIDH_SID4_SIZE                       equ 0001h
RXF6SIDH_SID4_LENGTH                     equ 0001h
RXF6SIDH_SID4_MASK                       equ 0002h
RXF6SIDH_SID5_POSN                       equ 0002h
RXF6SIDH_SID5_POSITION                   equ 0002h
RXF6SIDH_SID5_SIZE                       equ 0001h
RXF6SIDH_SID5_LENGTH                     equ 0001h
RXF6SIDH_SID5_MASK                       equ 0004h
RXF6SIDH_SID6_POSN                       equ 0003h
RXF6SIDH_SID6_POSITION                   equ 0003h
RXF6SIDH_SID6_SIZE                       equ 0001h
RXF6SIDH_SID6_LENGTH                     equ 0001h
RXF6SIDH_SID6_MASK                       equ 0008h
RXF6SIDH_SID7_POSN                       equ 0004h
RXF6SIDH_SID7_POSITION                   equ 0004h
RXF6SIDH_SID7_SIZE                       equ 0001h
RXF6SIDH_SID7_LENGTH                     equ 0001h
RXF6SIDH_SID7_MASK                       equ 0010h
RXF6SIDH_SID8_POSN                       equ 0005h
RXF6SIDH_SID8_POSITION                   equ 0005h
RXF6SIDH_SID8_SIZE                       equ 0001h
RXF6SIDH_SID8_LENGTH                     equ 0001h
RXF6SIDH_SID8_MASK                       equ 0020h
RXF6SIDH_SID9_POSN                       equ 0006h
RXF6SIDH_SID9_POSITION                   equ 0006h
RXF6SIDH_SID9_SIZE                       equ 0001h
RXF6SIDH_SID9_LENGTH                     equ 0001h
RXF6SIDH_SID9_MASK                       equ 0040h
RXF6SIDH_SID10_POSN                      equ 0007h
RXF6SIDH_SID10_POSITION                  equ 0007h
RXF6SIDH_SID10_SIZE                      equ 0001h
RXF6SIDH_SID10_LENGTH                    equ 0001h
RXF6SIDH_SID10_MASK                      equ 0080h
RXF6SIDH_EID21_POSN                      equ 0000h
RXF6SIDH_EID21_POSITION                  equ 0000h
RXF6SIDH_EID21_SIZE                      equ 0001h
RXF6SIDH_EID21_LENGTH                    equ 0001h
RXF6SIDH_EID21_MASK                      equ 0001h
RXF6SIDH_EID22_POSN                      equ 0001h
RXF6SIDH_EID22_POSITION                  equ 0001h
RXF6SIDH_EID22_SIZE                      equ 0001h
RXF6SIDH_EID22_LENGTH                    equ 0001h
RXF6SIDH_EID22_MASK                      equ 0002h
RXF6SIDH_EID23_POSN                      equ 0002h
RXF6SIDH_EID23_POSITION                  equ 0002h
RXF6SIDH_EID23_SIZE                      equ 0001h
RXF6SIDH_EID23_LENGTH                    equ 0001h
RXF6SIDH_EID23_MASK                      equ 0004h
RXF6SIDH_EID24_POSN                      equ 0003h
RXF6SIDH_EID24_POSITION                  equ 0003h
RXF6SIDH_EID24_SIZE                      equ 0001h
RXF6SIDH_EID24_LENGTH                    equ 0001h
RXF6SIDH_EID24_MASK                      equ 0008h
RXF6SIDH_EID25_POSN                      equ 0004h
RXF6SIDH_EID25_POSITION                  equ 0004h
RXF6SIDH_EID25_SIZE                      equ 0001h
RXF6SIDH_EID25_LENGTH                    equ 0001h
RXF6SIDH_EID25_MASK                      equ 0010h
RXF6SIDH_EID26_POSN                      equ 0005h
RXF6SIDH_EID26_POSITION                  equ 0005h
RXF6SIDH_EID26_SIZE                      equ 0001h
RXF6SIDH_EID26_LENGTH                    equ 0001h
RXF6SIDH_EID26_MASK                      equ 0020h
RXF6SIDH_EID27_POSN                      equ 0006h
RXF6SIDH_EID27_POSITION                  equ 0006h
RXF6SIDH_EID27_SIZE                      equ 0001h
RXF6SIDH_EID27_LENGTH                    equ 0001h
RXF6SIDH_EID27_MASK                      equ 0040h
RXF6SIDH_EID28_POSN                      equ 0007h
RXF6SIDH_EID28_POSITION                  equ 0007h
RXF6SIDH_EID28_SIZE                      equ 0001h
RXF6SIDH_EID28_LENGTH                    equ 0001h
RXF6SIDH_EID28_MASK                      equ 0080h
RXF6SIDH_SID_POSN                        equ 0000h
RXF6SIDH_SID_POSITION                    equ 0000h
RXF6SIDH_SID_SIZE                        equ 0008h
RXF6SIDH_SID_LENGTH                      equ 0008h
RXF6SIDH_SID_MASK                        equ 00FFh

// Register: RXF6SIDL
#define RXF6SIDL RXF6SIDL
RXF6SIDL                                 equ 03709h
// bitfield definitions
RXF6SIDL_EID16_POSN                      equ 0000h
RXF6SIDL_EID16_POSITION                  equ 0000h
RXF6SIDL_EID16_SIZE                      equ 0001h
RXF6SIDL_EID16_LENGTH                    equ 0001h
RXF6SIDL_EID16_MASK                      equ 0001h
RXF6SIDL_EID17_POSN                      equ 0001h
RXF6SIDL_EID17_POSITION                  equ 0001h
RXF6SIDL_EID17_SIZE                      equ 0001h
RXF6SIDL_EID17_LENGTH                    equ 0001h
RXF6SIDL_EID17_MASK                      equ 0002h
RXF6SIDL_EXIDF_POSN                      equ 0003h
RXF6SIDL_EXIDF_POSITION                  equ 0003h
RXF6SIDL_EXIDF_SIZE                      equ 0001h
RXF6SIDL_EXIDF_LENGTH                    equ 0001h
RXF6SIDL_EXIDF_MASK                      equ 0008h
RXF6SIDL_SID0_POSN                       equ 0005h
RXF6SIDL_SID0_POSITION                   equ 0005h
RXF6SIDL_SID0_SIZE                       equ 0001h
RXF6SIDL_SID0_LENGTH                     equ 0001h
RXF6SIDL_SID0_MASK                       equ 0020h
RXF6SIDL_SID1_POSN                       equ 0006h
RXF6SIDL_SID1_POSITION                   equ 0006h
RXF6SIDL_SID1_SIZE                       equ 0001h
RXF6SIDL_SID1_LENGTH                     equ 0001h
RXF6SIDL_SID1_MASK                       equ 0040h
RXF6SIDL_SID2_POSN                       equ 0007h
RXF6SIDL_SID2_POSITION                   equ 0007h
RXF6SIDL_SID2_SIZE                       equ 0001h
RXF6SIDL_SID2_LENGTH                     equ 0001h
RXF6SIDL_SID2_MASK                       equ 0080h
RXF6SIDL_EID18_POSN                      equ 0005h
RXF6SIDL_EID18_POSITION                  equ 0005h
RXF6SIDL_EID18_SIZE                      equ 0001h
RXF6SIDL_EID18_LENGTH                    equ 0001h
RXF6SIDL_EID18_MASK                      equ 0020h
RXF6SIDL_EID19_POSN                      equ 0006h
RXF6SIDL_EID19_POSITION                  equ 0006h
RXF6SIDL_EID19_SIZE                      equ 0001h
RXF6SIDL_EID19_LENGTH                    equ 0001h
RXF6SIDL_EID19_MASK                      equ 0040h
RXF6SIDL_EID20_POSN                      equ 0007h
RXF6SIDL_EID20_POSITION                  equ 0007h
RXF6SIDL_EID20_SIZE                      equ 0001h
RXF6SIDL_EID20_LENGTH                    equ 0001h
RXF6SIDL_EID20_MASK                      equ 0080h
RXF6SIDL_EID_POSN                        equ 0000h
RXF6SIDL_EID_POSITION                    equ 0000h
RXF6SIDL_EID_SIZE                        equ 0002h
RXF6SIDL_EID_LENGTH                      equ 0002h
RXF6SIDL_EID_MASK                        equ 0003h
RXF6SIDL_SID_POSN                        equ 0005h
RXF6SIDL_SID_POSITION                    equ 0005h
RXF6SIDL_SID_SIZE                        equ 0003h
RXF6SIDL_SID_LENGTH                      equ 0003h
RXF6SIDL_SID_MASK                        equ 00E0h

// Register: RXF6EIDH
#define RXF6EIDH RXF6EIDH
RXF6EIDH                                 equ 0370Ah
// bitfield definitions
RXF6EIDH_EID8_POSN                       equ 0000h
RXF6EIDH_EID8_POSITION                   equ 0000h
RXF6EIDH_EID8_SIZE                       equ 0001h
RXF6EIDH_EID8_LENGTH                     equ 0001h
RXF6EIDH_EID8_MASK                       equ 0001h
RXF6EIDH_EID9_POSN                       equ 0001h
RXF6EIDH_EID9_POSITION                   equ 0001h
RXF6EIDH_EID9_SIZE                       equ 0001h
RXF6EIDH_EID9_LENGTH                     equ 0001h
RXF6EIDH_EID9_MASK                       equ 0002h
RXF6EIDH_EID10_POSN                      equ 0002h
RXF6EIDH_EID10_POSITION                  equ 0002h
RXF6EIDH_EID10_SIZE                      equ 0001h
RXF6EIDH_EID10_LENGTH                    equ 0001h
RXF6EIDH_EID10_MASK                      equ 0004h
RXF6EIDH_EID11_POSN                      equ 0003h
RXF6EIDH_EID11_POSITION                  equ 0003h
RXF6EIDH_EID11_SIZE                      equ 0001h
RXF6EIDH_EID11_LENGTH                    equ 0001h
RXF6EIDH_EID11_MASK                      equ 0008h
RXF6EIDH_EID12_POSN                      equ 0004h
RXF6EIDH_EID12_POSITION                  equ 0004h
RXF6EIDH_EID12_SIZE                      equ 0001h
RXF6EIDH_EID12_LENGTH                    equ 0001h
RXF6EIDH_EID12_MASK                      equ 0010h
RXF6EIDH_EID13_POSN                      equ 0005h
RXF6EIDH_EID13_POSITION                  equ 0005h
RXF6EIDH_EID13_SIZE                      equ 0001h
RXF6EIDH_EID13_LENGTH                    equ 0001h
RXF6EIDH_EID13_MASK                      equ 0020h
RXF6EIDH_EID14_POSN                      equ 0006h
RXF6EIDH_EID14_POSITION                  equ 0006h
RXF6EIDH_EID14_SIZE                      equ 0001h
RXF6EIDH_EID14_LENGTH                    equ 0001h
RXF6EIDH_EID14_MASK                      equ 0040h
RXF6EIDH_EID15_POSN                      equ 0007h
RXF6EIDH_EID15_POSITION                  equ 0007h
RXF6EIDH_EID15_SIZE                      equ 0001h
RXF6EIDH_EID15_LENGTH                    equ 0001h
RXF6EIDH_EID15_MASK                      equ 0080h
RXF6EIDH_EID_POSN                        equ 0000h
RXF6EIDH_EID_POSITION                    equ 0000h
RXF6EIDH_EID_SIZE                        equ 0008h
RXF6EIDH_EID_LENGTH                      equ 0008h
RXF6EIDH_EID_MASK                        equ 00FFh

// Register: RXF6EIDL
#define RXF6EIDL RXF6EIDL
RXF6EIDL                                 equ 0370Bh
// bitfield definitions
RXF6EIDL_EID0_POSN                       equ 0000h
RXF6EIDL_EID0_POSITION                   equ 0000h
RXF6EIDL_EID0_SIZE                       equ 0001h
RXF6EIDL_EID0_LENGTH                     equ 0001h
RXF6EIDL_EID0_MASK                       equ 0001h
RXF6EIDL_EID1_POSN                       equ 0001h
RXF6EIDL_EID1_POSITION                   equ 0001h
RXF6EIDL_EID1_SIZE                       equ 0001h
RXF6EIDL_EID1_LENGTH                     equ 0001h
RXF6EIDL_EID1_MASK                       equ 0002h
RXF6EIDL_EID2_POSN                       equ 0002h
RXF6EIDL_EID2_POSITION                   equ 0002h
RXF6EIDL_EID2_SIZE                       equ 0001h
RXF6EIDL_EID2_LENGTH                     equ 0001h
RXF6EIDL_EID2_MASK                       equ 0004h
RXF6EIDL_EID3_POSN                       equ 0003h
RXF6EIDL_EID3_POSITION                   equ 0003h
RXF6EIDL_EID3_SIZE                       equ 0001h
RXF6EIDL_EID3_LENGTH                     equ 0001h
RXF6EIDL_EID3_MASK                       equ 0008h
RXF6EIDL_EID4_POSN                       equ 0004h
RXF6EIDL_EID4_POSITION                   equ 0004h
RXF6EIDL_EID4_SIZE                       equ 0001h
RXF6EIDL_EID4_LENGTH                     equ 0001h
RXF6EIDL_EID4_MASK                       equ 0010h
RXF6EIDL_EID5_POSN                       equ 0005h
RXF6EIDL_EID5_POSITION                   equ 0005h
RXF6EIDL_EID5_SIZE                       equ 0001h
RXF6EIDL_EID5_LENGTH                     equ 0001h
RXF6EIDL_EID5_MASK                       equ 0020h
RXF6EIDL_EID6_POSN                       equ 0006h
RXF6EIDL_EID6_POSITION                   equ 0006h
RXF6EIDL_EID6_SIZE                       equ 0001h
RXF6EIDL_EID6_LENGTH                     equ 0001h
RXF6EIDL_EID6_MASK                       equ 0040h
RXF6EIDL_EID7_POSN                       equ 0007h
RXF6EIDL_EID7_POSITION                   equ 0007h
RXF6EIDL_EID7_SIZE                       equ 0001h
RXF6EIDL_EID7_LENGTH                     equ 0001h
RXF6EIDL_EID7_MASK                       equ 0080h
RXF6EIDL_EID_POSN                        equ 0000h
RXF6EIDL_EID_POSITION                    equ 0000h
RXF6EIDL_EID_SIZE                        equ 0008h
RXF6EIDL_EID_LENGTH                      equ 0008h
RXF6EIDL_EID_MASK                        equ 00FFh

