GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: RXF7SIDH
#define RXF7SIDH RXF7SIDH
RXF7SIDH                                 equ 0370Ch
// bitfield definitions
RXF7SIDH_SID3_POSN                       equ 0000h
RXF7SIDH_SID3_POSITION                   equ 0000h
RXF7SIDH_SID3_SIZE                       equ 0001h
RXF7SIDH_SID3_LENGTH                     equ 0001h
RXF7SIDH_SID3_MASK                       equ 0001h
RXF7SIDH_SID4_POSN                       equ 0001h
RXF7SIDH_SID4_POSITION                   equ 0001h
RXF7SIDH_SID4_SIZE                       equ 0001h
RXF7SIDH_SID4_LENGTH                     equ 0001h
RXF7SIDH_SID4_MASK                       equ 0002h
RXF7SIDH_SID5_POSN                       equ 0002h
RXF7SIDH_SID5_POSITION                   equ 0002h
RXF7SIDH_SID5_SIZE                       equ 0001h
RXF7SIDH_SID5_LENGTH                     equ 0001h
RXF7SIDH_SID5_MASK                       equ 0004h
RXF7SIDH_SID6_POSN                       equ 0003h
RXF7SIDH_SID6_POSITION                   equ 0003h
RXF7SIDH_SID6_SIZE                       equ 0001h
RXF7SIDH_SID6_LENGTH                     equ 0001h
RXF7SIDH_SID6_MASK                       equ 0008h
RXF7SIDH_SID7_POSN                       equ 0004h
RXF7SIDH_SID7_POSITION                   equ 0004h
RXF7SIDH_SID7_SIZE                       equ 0001h
RXF7SIDH_SID7_LENGTH                     equ 0001h
RXF7SIDH_SID7_MASK                       equ 0010h
RXF7SIDH_SID8_POSN                       equ 0005h
RXF7SIDH_SID8_POSITION                   equ 0005h
RXF7SIDH_SID8_SIZE                       equ 0001h
RXF7SIDH_SID8_LENGTH                     equ 0001h
RXF7SIDH_SID8_MASK                       equ 0020h
RXF7SIDH_SID9_POSN                       equ 0006h
RXF7SIDH_SID9_POSITION                   equ 0006h
RXF7SIDH_SID9_SIZE                       equ 0001h
RXF7SIDH_SID9_LENGTH                     equ 0001h
RXF7SIDH_SID9_MASK                       equ 0040h
RXF7SIDH_SID10_POSN                      equ 0007h
RXF7SIDH_SID10_POSITION                  equ 0007h
RXF7SIDH_SID10_SIZE                      equ 0001h
RXF7SIDH_SID10_LENGTH                    equ 0001h
RXF7SIDH_SID10_MASK                      equ 0080h
RXF7SIDH_EID21_POSN                      equ 0000h
RXF7SIDH_EID21_POSITION                  equ 0000h
RXF7SIDH_EID21_SIZE                      equ 0001h
RXF7SIDH_EID21_LENGTH                    equ 0001h
RXF7SIDH_EID21_MASK                      equ 0001h
RXF7SIDH_EID22_POSN                      equ 0001h
RXF7SIDH_EID22_POSITION                  equ 0001h
RXF7SIDH_EID22_SIZE                      equ 0001h
RXF7SIDH_EID22_LENGTH                    equ 0001h
RXF7SIDH_EID22_MASK                      equ 0002h
RXF7SIDH_EID23_POSN                      equ 0002h
RXF7SIDH_EID23_POSITION                  equ 0002h
RXF7SIDH_EID23_SIZE                      equ 0001h
RXF7SIDH_EID23_LENGTH                    equ 0001h
RXF7SIDH_EID23_MASK                      equ 0004h
RXF7SIDH_EID24_POSN                      equ 0003h
RXF7SIDH_EID24_POSITION                  equ 0003h
RXF7SIDH_EID24_SIZE                      equ 0001h
RXF7SIDH_EID24_LENGTH                    equ 0001h
RXF7SIDH_EID24_MASK                      equ 0008h
RXF7SIDH_EID25_POSN                      equ 0004h
RXF7SIDH_EID25_POSITION                  equ 0004h
RXF7SIDH_EID25_SIZE                      equ 0001h
RXF7SIDH_EID25_LENGTH                    equ 0001h
RXF7SIDH_EID25_MASK                      equ 0010h
RXF7SIDH_EID26_POSN                      equ 0005h
RXF7SIDH_EID26_POSITION                  equ 0005h
RXF7SIDH_EID26_SIZE                      equ 0001h
RXF7SIDH_EID26_LENGTH                    equ 0001h
RXF7SIDH_EID26_MASK                      equ 0020h
RXF7SIDH_EID27_POSN                      equ 0006h
RXF7SIDH_EID27_POSITION                  equ 0006h
RXF7SIDH_EID27_SIZE                      equ 0001h
RXF7SIDH_EID27_LENGTH                    equ 0001h
RXF7SIDH_EID27_MASK                      equ 0040h
RXF7SIDH_EID28_POSN                      equ 0007h
RXF7SIDH_EID28_POSITION                  equ 0007h
RXF7SIDH_EID28_SIZE                      equ 0001h
RXF7SIDH_EID28_LENGTH                    equ 0001h
RXF7SIDH_EID28_MASK                      equ 0080h
RXF7SIDH_SID_POSN                        equ 0000h
RXF7SIDH_SID_POSITION                    equ 0000h
RXF7SIDH_SID_SIZE                        equ 0008h
RXF7SIDH_SID_LENGTH                      equ 0008h
RXF7SIDH_SID_MASK                        equ 00FFh

// Register: RXF7SIDL
#define RXF7SIDL RXF7SIDL
RXF7SIDL                                 equ 0370Dh
// bitfield definitions
RXF7SIDL_EID16_POSN                      equ 0000h
RXF7SIDL_EID16_POSITION                  equ 0000h
RXF7SIDL_EID16_SIZE                      equ 0001h
RXF7SIDL_EID16_LENGTH                    equ 0001h
RXF7SIDL_EID16_MASK                      equ 0001h
RXF7SIDL_EID17_POSN                      equ 0001h
RXF7SIDL_EID17_POSITION                  equ 0001h
RXF7SIDL_EID17_SIZE                      equ 0001h
RXF7SIDL_EID17_LENGTH                    equ 0001h
RXF7SIDL_EID17_MASK                      equ 0002h
RXF7SIDL_EXIDEN_POSN                     equ 0003h
RXF7SIDL_EXIDEN_POSITION                 equ 0003h
RXF7SIDL_EXIDEN_SIZE                     equ 0001h
RXF7SIDL_EXIDEN_LENGTH                   equ 0001h
RXF7SIDL_EXIDEN_MASK                     equ 0008h
RXF7SIDL_SID0_POSN                       equ 0005h
RXF7SIDL_SID0_POSITION                   equ 0005h
RXF7SIDL_SID0_SIZE                       equ 0001h
RXF7SIDL_SID0_LENGTH                     equ 0001h
RXF7SIDL_SID0_MASK                       equ 0020h
RXF7SIDL_SID1_POSN                       equ 0006h
RXF7SIDL_SID1_POSITION                   equ 0006h
RXF7SIDL_SID1_SIZE                       equ 0001h
RXF7SIDL_SID1_LENGTH                     equ 0001h
RXF7SIDL_SID1_MASK                       equ 0040h
RXF7SIDL_SID2_POSN                       equ 0007h
RXF7SIDL_SID2_POSITION                   equ 0007h
RXF7SIDL_SID2_SIZE                       equ 0001h
RXF7SIDL_SID2_LENGTH                     equ 0001h
RXF7SIDL_SID2_MASK                       equ 0080h
RXF7SIDL_EID18_POSN                      equ 0005h
RXF7SIDL_EID18_POSITION                  equ 0005h
RXF7SIDL_EID18_SIZE                      equ 0001h
RXF7SIDL_EID18_LENGTH                    equ 0001h
RXF7SIDL_EID18_MASK                      equ 0020h
RXF7SIDL_EID19_POSN                      equ 0006h
RXF7SIDL_EID19_POSITION                  equ 0006h
RXF7SIDL_EID19_SIZE                      equ 0001h
RXF7SIDL_EID19_LENGTH                    equ 0001h
RXF7SIDL_EID19_MASK                      equ 0040h
RXF7SIDL_EID20_POSN                      equ 0007h
RXF7SIDL_EID20_POSITION                  equ 0007h
RXF7SIDL_EID20_SIZE                      equ 0001h
RXF7SIDL_EID20_LENGTH                    equ 0001h
RXF7SIDL_EID20_MASK                      equ 0080h
RXF7SIDL_EID_POSN                        equ 0000h
RXF7SIDL_EID_POSITION                    equ 0000h
RXF7SIDL_EID_SIZE                        equ 0002h
RXF7SIDL_EID_LENGTH                      equ 0002h
RXF7SIDL_EID_MASK                        equ 0003h
RXF7SIDL_SID_POSN                        equ 0005h
RXF7SIDL_SID_POSITION                    equ 0005h
RXF7SIDL_SID_SIZE                        equ 0003h
RXF7SIDL_SID_LENGTH                      equ 0003h
RXF7SIDL_SID_MASK                        equ 00E0h

// Register: RXF7EIDH
#define RXF7EIDH RXF7EIDH
RXF7EIDH                                 equ 0370Eh
// bitfield definitions
RXF7EIDH_EID8_POSN                       equ 0000h
RXF7EIDH_EID8_POSITION                   equ 0000h
RXF7EIDH_EID8_SIZE                       equ 0001h
RXF7EIDH_EID8_LENGTH                     equ 0001h
RXF7EIDH_EID8_MASK                       equ 0001h
RXF7EIDH_EID9_POSN                       equ 0001h
RXF7EIDH_EID9_POSITION                   equ 0001h
RXF7EIDH_EID9_SIZE                       equ 0001h
RXF7EIDH_EID9_LENGTH                     equ 0001h
RXF7EIDH_EID9_MASK                       equ 0002h
RXF7EIDH_EID10_POSN                      equ 0002h
RXF7EIDH_EID10_POSITION                  equ 0002h
RXF7EIDH_EID10_SIZE                      equ 0001h
RXF7EIDH_EID10_LENGTH                    equ 0001h
RXF7EIDH_EID10_MASK                      equ 0004h
RXF7EIDH_EID11_POSN                      equ 0003h
RXF7EIDH_EID11_POSITION                  equ 0003h
RXF7EIDH_EID11_SIZE                      equ 0001h
RXF7EIDH_EID11_LENGTH                    equ 0001h
RXF7EIDH_EID11_MASK                      equ 0008h
RXF7EIDH_EID12_POSN                      equ 0004h
RXF7EIDH_EID12_POSITION                  equ 0004h
RXF7EIDH_EID12_SIZE                      equ 0001h
RXF7EIDH_EID12_LENGTH                    equ 0001h
RXF7EIDH_EID12_MASK                      equ 0010h
RXF7EIDH_EID13_POSN                      equ 0005h
RXF7EIDH_EID13_POSITION                  equ 0005h
RXF7EIDH_EID13_SIZE                      equ 0001h
RXF7EIDH_EID13_LENGTH                    equ 0001h
RXF7EIDH_EID13_MASK                      equ 0020h
RXF7EIDH_EID14_POSN                      equ 0006h
RXF7EIDH_EID14_POSITION                  equ 0006h
RXF7EIDH_EID14_SIZE                      equ 0001h
RXF7EIDH_EID14_LENGTH                    equ 0001h
RXF7EIDH_EID14_MASK                      equ 0040h
RXF7EIDH_EID15_POSN                      equ 0007h
RXF7EIDH_EID15_POSITION                  equ 0007h
RXF7EIDH_EID15_SIZE                      equ 0001h
RXF7EIDH_EID15_LENGTH                    equ 0001h
RXF7EIDH_EID15_MASK                      equ 0080h
RXF7EIDH_EID_POSN                        equ 0000h
RXF7EIDH_EID_POSITION                    equ 0000h
RXF7EIDH_EID_SIZE                        equ 0008h
RXF7EIDH_EID_LENGTH                      equ 0008h
RXF7EIDH_EID_MASK                        equ 00FFh

// Register: RXF7EIDL
#define RXF7EIDL RXF7EIDL
RXF7EIDL                                 equ 0370Fh
// bitfield definitions
RXF7EIDL_EID0_POSN                       equ 0000h
RXF7EIDL_EID0_POSITION                   equ 0000h
RXF7EIDL_EID0_SIZE                       equ 0001h
RXF7EIDL_EID0_LENGTH                     equ 0001h
RXF7EIDL_EID0_MASK                       equ 0001h
RXF7EIDL_EID1_POSN                       equ 0001h
RXF7EIDL_EID1_POSITION                   equ 0001h
RXF7EIDL_EID1_SIZE                       equ 0001h
RXF7EIDL_EID1_LENGTH                     equ 0001h
RXF7EIDL_EID1_MASK                       equ 0002h
RXF7EIDL_EID2_POSN                       equ 0002h
RXF7EIDL_EID2_POSITION                   equ 0002h
RXF7EIDL_EID2_SIZE                       equ 0001h
RXF7EIDL_EID2_LENGTH                     equ 0001h
RXF7EIDL_EID2_MASK                       equ 0004h
RXF7EIDL_EID3_POSN                       equ 0003h
RXF7EIDL_EID3_POSITION                   equ 0003h
RXF7EIDL_EID3_SIZE                       equ 0001h
RXF7EIDL_EID3_LENGTH                     equ 0001h
RXF7EIDL_EID3_MASK                       equ 0008h
RXF7EIDL_EID4_POSN                       equ 0004h
RXF7EIDL_EID4_POSITION                   equ 0004h
RXF7EIDL_EID4_SIZE                       equ 0001h
RXF7EIDL_EID4_LENGTH                     equ 0001h
RXF7EIDL_EID4_MASK                       equ 0010h
RXF7EIDL_EID5_POSN                       equ 0005h
RXF7EIDL_EID5_POSITION                   equ 0005h
RXF7EIDL_EID5_SIZE                       equ 0001h
RXF7EIDL_EID5_LENGTH                     equ 0001h
RXF7EIDL_EID5_MASK                       equ 0020h
RXF7EIDL_EID6_POSN                       equ 0006h
RXF7EIDL_EID6_POSITION                   equ 0006h
RXF7EIDL_EID6_SIZE                       equ 0001h
RXF7EIDL_EID6_LENGTH                     equ 0001h
RXF7EIDL_EID6_MASK                       equ 0040h
RXF7EIDL_EID7_POSN                       equ 0007h
RXF7EIDL_EID7_POSITION                   equ 0007h
RXF7EIDL_EID7_SIZE                       equ 0001h
RXF7EIDL_EID7_LENGTH                     equ 0001h
RXF7EIDL_EID7_MASK                       equ 0080h
RXF7EIDL_EID_POSN                        equ 0000h
RXF7EIDL_EID_POSITION                    equ 0000h
RXF7EIDL_EID_SIZE                        equ 0008h
RXF7EIDL_EID_LENGTH                      equ 0008h
RXF7EIDL_EID_MASK                        equ 00FFh

// Register: RXF8SIDH
#define RXF8SIDH RXF8SIDH
RXF8SIDH                                 equ 03710h
// bitfield definitions
RXF8SIDH_SID3_POSN                       equ 0000h
RXF8SIDH_SID3_POSITION                   equ 0000h
RXF8SIDH_SID3_SIZE                       equ 0001h
RXF8SIDH_SID3_LENGTH                     equ 0001h
RXF8SIDH_SID3_MASK                       equ 0001h
RXF8SIDH_SID4_POSN                       equ 0001h
RXF8SIDH_SID4_POSITION                   equ 0001h
RXF8SIDH_SID4_SIZE                       equ 0001h
RXF8SIDH_SID4_LENGTH                     equ 0001h
RXF8SIDH_SID4_MASK                       equ 0002h
RXF8SIDH_SID5_POSN                       equ 0002h
RXF8SIDH_SID5_POSITION                   equ 0002h
RXF8SIDH_SID5_SIZE                       equ 0001h
RXF8SIDH_SID5_LENGTH                     equ 0001h
RXF8SIDH_SID5_MASK                       equ 0004h
RXF8SIDH_SID6_POSN                       equ 0003h
RXF8SIDH_SID6_POSITION                   equ 0003h
RXF8SIDH_SID6_SIZE                       equ 0001h
RXF8SIDH_SID6_LENGTH                     equ 0001h
RXF8SIDH_SID6_MASK                       equ 0008h
RXF8SIDH_SID7_POSN                       equ 0004h
RXF8SIDH_SID7_POSITION                   equ 0004h
RXF8SIDH_SID7_SIZE                       equ 0001h
RXF8SIDH_SID7_LENGTH                     equ 0001h
RXF8SIDH_SID7_MASK                       equ 0010h
RXF8SIDH_SID8_POSN                       equ 0005h
RXF8SIDH_SID8_POSITION                   equ 0005h
RXF8SIDH_SID8_SIZE                       equ 0001h
RXF8SIDH_SID8_LENGTH                     equ 0001h
RXF8SIDH_SID8_MASK                       equ 0020h
RXF8SIDH_SID9_POSN                       equ 0006h
RXF8SIDH_SID9_POSITION                   equ 0006h
RXF8SIDH_SID9_SIZE                       equ 0001h
RXF8SIDH_SID9_LENGTH                     equ 0001h
RXF8SIDH_SID9_MASK                       equ 0040h
RXF8SIDH_SID10_POSN                      equ 0007h
RXF8SIDH_SID10_POSITION                  equ 0007h
RXF8SIDH_SID10_SIZE                      equ 0001h
RXF8SIDH_SID10_LENGTH                    equ 0001h
RXF8SIDH_SID10_MASK                      equ 0080h
RXF8SIDH_EID21_POSN                      equ 0000h
RXF8SIDH_EID21_POSITION                  equ 0000h
RXF8SIDH_EID21_SIZE                      equ 0001h
RXF8SIDH_EID21_LENGTH                    equ 0001h
RXF8SIDH_EID21_MASK                      equ 0001h
RXF8SIDH_EID22_POSN                      equ 0001h
RXF8SIDH_EID22_POSITION                  equ 0001h
RXF8SIDH_EID22_SIZE                      equ 0001h
RXF8SIDH_EID22_LENGTH                    equ 0001h
RXF8SIDH_EID22_MASK                      equ 0002h
RXF8SIDH_EID23_POSN                      equ 0002h
RXF8SIDH_EID23_POSITION                  equ 0002h
RXF8SIDH_EID23_SIZE                      equ 0001h
RXF8SIDH_EID23_LENGTH                    equ 0001h
RXF8SIDH_EID23_MASK                      equ 0004h
RXF8SIDH_EID24_POSN                      equ 0003h
RXF8SIDH_EID24_POSITION                  equ 0003h
RXF8SIDH_EID24_SIZE                      equ 0001h
RXF8SIDH_EID24_LENGTH                    equ 0001h
RXF8SIDH_EID24_MASK                      equ 0008h
RXF8SIDH_EID25_POSN                      equ 0004h
RXF8SIDH_EID25_POSITION                  equ 0004h
RXF8SIDH_EID25_SIZE                      equ 0001h
RXF8SIDH_EID25_LENGTH                    equ 0001h
RXF8SIDH_EID25_MASK                      equ 0010h
RXF8SIDH_EID26_POSN                      equ 0005h
RXF8SIDH_EID26_POSITION                  equ 0005h
RXF8SIDH_EID26_SIZE                      equ 0001h
RXF8SIDH_EID26_LENGTH                    equ 0001h
RXF8SIDH_EID26_MASK                      equ 0020h
RXF8SIDH_EID27_POSN                      equ 0006h
RXF8SIDH_EID27_POSITION                  equ 0006h
RXF8SIDH_EID27_SIZE                      equ 0001h
RXF8SIDH_EID27_LENGTH                    equ 0001h
RXF8SIDH_EID27_MASK                      equ 0040h
RXF8SIDH_EID28_POSN                      equ 0007h
RXF8SIDH_EID28_POSITION                  equ 0007h
RXF8SIDH_EID28_SIZE                      equ 0001h
RXF8SIDH_EID28_LENGTH                    equ 0001h
RXF8SIDH_EID28_MASK                      equ 0080h
RXF8SIDH_SID_POSN                        equ 0000h
RXF8SIDH_SID_POSITION                    equ 0000h
RXF8SIDH_SID_SIZE                        equ 0008h
RXF8SIDH_SID_LENGTH                      equ 0008h
RXF8SIDH_SID_MASK                        equ 00FFh

