GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: RXF10SIDL
#define RXF10SIDL RXF10SIDL
RXF10SIDL                                equ 03719h
// bitfield definitions
RXF10SIDL_EID16_POSN                     equ 0000h
RXF10SIDL_EID16_POSITION                 equ 0000h
RXF10SIDL_EID16_SIZE                     equ 0001h
RXF10SIDL_EID16_LENGTH                   equ 0001h
RXF10SIDL_EID16_MASK                     equ 0001h
RXF10SIDL_EID17_POSN                     equ 0001h
RXF10SIDL_EID17_POSITION                 equ 0001h
RXF10SIDL_EID17_SIZE                     equ 0001h
RXF10SIDL_EID17_LENGTH                   equ 0001h
RXF10SIDL_EID17_MASK                     equ 0002h
RXF10SIDL_EXIDEN_POSN                    equ 0003h
RXF10SIDL_EXIDEN_POSITION                equ 0003h
RXF10SIDL_EXIDEN_SIZE                    equ 0001h
RXF10SIDL_EXIDEN_LENGTH                  equ 0001h
RXF10SIDL_EXIDEN_MASK                    equ 0008h
RXF10SIDL_SID0_POSN                      equ 0005h
RXF10SIDL_SID0_POSITION                  equ 0005h
RXF10SIDL_SID0_SIZE                      equ 0001h
RXF10SIDL_SID0_LENGTH                    equ 0001h
RXF10SIDL_SID0_MASK                      equ 0020h
RXF10SIDL_SID1_POSN                      equ 0006h
RXF10SIDL_SID1_POSITION                  equ 0006h
RXF10SIDL_SID1_SIZE                      equ 0001h
RXF10SIDL_SID1_LENGTH                    equ 0001h
RXF10SIDL_SID1_MASK                      equ 0040h
RXF10SIDL_SID2_POSN                      equ 0007h
RXF10SIDL_SID2_POSITION                  equ 0007h
RXF10SIDL_SID2_SIZE                      equ 0001h
RXF10SIDL_SID2_LENGTH                    equ 0001h
RXF10SIDL_SID2_MASK                      equ 0080h
RXF10SIDL_EID18_POSN                     equ 0005h
RXF10SIDL_EID18_POSITION                 equ 0005h
RXF10SIDL_EID18_SIZE                     equ 0001h
RXF10SIDL_EID18_LENGTH                   equ 0001h
RXF10SIDL_EID18_MASK                     equ 0020h
RXF10SIDL_EID19_POSN                     equ 0006h
RXF10SIDL_EID19_POSITION                 equ 0006h
RXF10SIDL_EID19_SIZE                     equ 0001h
RXF10SIDL_EID19_LENGTH                   equ 0001h
RXF10SIDL_EID19_MASK                     equ 0040h
RXF10SIDL_EID20_POSN                     equ 0007h
RXF10SIDL_EID20_POSITION                 equ 0007h
RXF10SIDL_EID20_SIZE                     equ 0001h
RXF10SIDL_EID20_LENGTH                   equ 0001h
RXF10SIDL_EID20_MASK                     equ 0080h
RXF10SIDL_EID_POSN                       equ 0000h
RXF10SIDL_EID_POSITION                   equ 0000h
RXF10SIDL_EID_SIZE                       equ 0002h
RXF10SIDL_EID_LENGTH                     equ 0002h
RXF10SIDL_EID_MASK                       equ 0003h
RXF10SIDL_SID_POSN                       equ 0005h
RXF10SIDL_SID_POSITION                   equ 0005h
RXF10SIDL_SID_SIZE                       equ 0003h
RXF10SIDL_SID_LENGTH                     equ 0003h
RXF10SIDL_SID_MASK                       equ 00E0h

// Register: RXF10EIDH
#define RXF10EIDH RXF10EIDH
RXF10EIDH                                equ 0371Ah
// bitfield definitions
RXF10EIDH_EID8_POSN                      equ 0000h
RXF10EIDH_EID8_POSITION                  equ 0000h
RXF10EIDH_EID8_SIZE                      equ 0001h
RXF10EIDH_EID8_LENGTH                    equ 0001h
RXF10EIDH_EID8_MASK                      equ 0001h
RXF10EIDH_EID9_POSN                      equ 0001h
RXF10EIDH_EID9_POSITION                  equ 0001h
RXF10EIDH_EID9_SIZE                      equ 0001h
RXF10EIDH_EID9_LENGTH                    equ 0001h
RXF10EIDH_EID9_MASK                      equ 0002h
RXF10EIDH_EID10_POSN                     equ 0002h
RXF10EIDH_EID10_POSITION                 equ 0002h
RXF10EIDH_EID10_SIZE                     equ 0001h
RXF10EIDH_EID10_LENGTH                   equ 0001h
RXF10EIDH_EID10_MASK                     equ 0004h
RXF10EIDH_EID11_POSN                     equ 0003h
RXF10EIDH_EID11_POSITION                 equ 0003h
RXF10EIDH_EID11_SIZE                     equ 0001h
RXF10EIDH_EID11_LENGTH                   equ 0001h
RXF10EIDH_EID11_MASK                     equ 0008h
RXF10EIDH_EID12_POSN                     equ 0004h
RXF10EIDH_EID12_POSITION                 equ 0004h
RXF10EIDH_EID12_SIZE                     equ 0001h
RXF10EIDH_EID12_LENGTH                   equ 0001h
RXF10EIDH_EID12_MASK                     equ 0010h
RXF10EIDH_EID13_POSN                     equ 0005h
RXF10EIDH_EID13_POSITION                 equ 0005h
RXF10EIDH_EID13_SIZE                     equ 0001h
RXF10EIDH_EID13_LENGTH                   equ 0001h
RXF10EIDH_EID13_MASK                     equ 0020h
RXF10EIDH_EID14_POSN                     equ 0006h
RXF10EIDH_EID14_POSITION                 equ 0006h
RXF10EIDH_EID14_SIZE                     equ 0001h
RXF10EIDH_EID14_LENGTH                   equ 0001h
RXF10EIDH_EID14_MASK                     equ 0040h
RXF10EIDH_EID15_POSN                     equ 0007h
RXF10EIDH_EID15_POSITION                 equ 0007h
RXF10EIDH_EID15_SIZE                     equ 0001h
RXF10EIDH_EID15_LENGTH                   equ 0001h
RXF10EIDH_EID15_MASK                     equ 0080h
RXF10EIDH_EID_POSN                       equ 0000h
RXF10EIDH_EID_POSITION                   equ 0000h
RXF10EIDH_EID_SIZE                       equ 0008h
RXF10EIDH_EID_LENGTH                     equ 0008h
RXF10EIDH_EID_MASK                       equ 00FFh

// Register: RXF10EIDL
#define RXF10EIDL RXF10EIDL
RXF10EIDL                                equ 0371Bh
// bitfield definitions
RXF10EIDL_EID0_POSN                      equ 0000h
RXF10EIDL_EID0_POSITION                  equ 0000h
RXF10EIDL_EID0_SIZE                      equ 0001h
RXF10EIDL_EID0_LENGTH                    equ 0001h
RXF10EIDL_EID0_MASK                      equ 0001h
RXF10EIDL_EID1_POSN                      equ 0001h
RXF10EIDL_EID1_POSITION                  equ 0001h
RXF10EIDL_EID1_SIZE                      equ 0001h
RXF10EIDL_EID1_LENGTH                    equ 0001h
RXF10EIDL_EID1_MASK                      equ 0002h
RXF10EIDL_EID2_POSN                      equ 0002h
RXF10EIDL_EID2_POSITION                  equ 0002h
RXF10EIDL_EID2_SIZE                      equ 0001h
RXF10EIDL_EID2_LENGTH                    equ 0001h
RXF10EIDL_EID2_MASK                      equ 0004h
RXF10EIDL_EID3_POSN                      equ 0003h
RXF10EIDL_EID3_POSITION                  equ 0003h
RXF10EIDL_EID3_SIZE                      equ 0001h
RXF10EIDL_EID3_LENGTH                    equ 0001h
RXF10EIDL_EID3_MASK                      equ 0008h
RXF10EIDL_EID4_POSN                      equ 0004h
RXF10EIDL_EID4_POSITION                  equ 0004h
RXF10EIDL_EID4_SIZE                      equ 0001h
RXF10EIDL_EID4_LENGTH                    equ 0001h
RXF10EIDL_EID4_MASK                      equ 0010h
RXF10EIDL_EID5_POSN                      equ 0005h
RXF10EIDL_EID5_POSITION                  equ 0005h
RXF10EIDL_EID5_SIZE                      equ 0001h
RXF10EIDL_EID5_LENGTH                    equ 0001h
RXF10EIDL_EID5_MASK                      equ 0020h
RXF10EIDL_EID6_POSN                      equ 0006h
RXF10EIDL_EID6_POSITION                  equ 0006h
RXF10EIDL_EID6_SIZE                      equ 0001h
RXF10EIDL_EID6_LENGTH                    equ 0001h
RXF10EIDL_EID6_MASK                      equ 0040h
RXF10EIDL_EID7_POSN                      equ 0007h
RXF10EIDL_EID7_POSITION                  equ 0007h
RXF10EIDL_EID7_SIZE                      equ 0001h
RXF10EIDL_EID7_LENGTH                    equ 0001h
RXF10EIDL_EID7_MASK                      equ 0080h
RXF10EIDL_EID_POSN                       equ 0000h
RXF10EIDL_EID_POSITION                   equ 0000h
RXF10EIDL_EID_SIZE                       equ 0008h
RXF10EIDL_EID_LENGTH                     equ 0008h
RXF10EIDL_EID_MASK                       equ 00FFh

// Register: RXF11SIDH
#define RXF11SIDH RXF11SIDH
RXF11SIDH                                equ 0371Ch
// bitfield definitions
RXF11SIDH_SID3_POSN                      equ 0000h
RXF11SIDH_SID3_POSITION                  equ 0000h
RXF11SIDH_SID3_SIZE                      equ 0001h
RXF11SIDH_SID3_LENGTH                    equ 0001h
RXF11SIDH_SID3_MASK                      equ 0001h
RXF11SIDH_SID4_POSN                      equ 0001h
RXF11SIDH_SID4_POSITION                  equ 0001h
RXF11SIDH_SID4_SIZE                      equ 0001h
RXF11SIDH_SID4_LENGTH                    equ 0001h
RXF11SIDH_SID4_MASK                      equ 0002h
RXF11SIDH_SID5_POSN                      equ 0002h
RXF11SIDH_SID5_POSITION                  equ 0002h
RXF11SIDH_SID5_SIZE                      equ 0001h
RXF11SIDH_SID5_LENGTH                    equ 0001h
RXF11SIDH_SID5_MASK                      equ 0004h
RXF11SIDH_SID6_POSN                      equ 0003h
RXF11SIDH_SID6_POSITION                  equ 0003h
RXF11SIDH_SID6_SIZE                      equ 0001h
RXF11SIDH_SID6_LENGTH                    equ 0001h
RXF11SIDH_SID6_MASK                      equ 0008h
RXF11SIDH_SID7_POSN                      equ 0004h
RXF11SIDH_SID7_POSITION                  equ 0004h
RXF11SIDH_SID7_SIZE                      equ 0001h
RXF11SIDH_SID7_LENGTH                    equ 0001h
RXF11SIDH_SID7_MASK                      equ 0010h
RXF11SIDH_SID8_POSN                      equ 0005h
RXF11SIDH_SID8_POSITION                  equ 0005h
RXF11SIDH_SID8_SIZE                      equ 0001h
RXF11SIDH_SID8_LENGTH                    equ 0001h
RXF11SIDH_SID8_MASK                      equ 0020h
RXF11SIDH_SID9_POSN                      equ 0006h
RXF11SIDH_SID9_POSITION                  equ 0006h
RXF11SIDH_SID9_SIZE                      equ 0001h
RXF11SIDH_SID9_LENGTH                    equ 0001h
RXF11SIDH_SID9_MASK                      equ 0040h
RXF11SIDH_SID10_POSN                     equ 0007h
RXF11SIDH_SID10_POSITION                 equ 0007h
RXF11SIDH_SID10_SIZE                     equ 0001h
RXF11SIDH_SID10_LENGTH                   equ 0001h
RXF11SIDH_SID10_MASK                     equ 0080h
RXF11SIDH_EID21_POSN                     equ 0000h
RXF11SIDH_EID21_POSITION                 equ 0000h
RXF11SIDH_EID21_SIZE                     equ 0001h
RXF11SIDH_EID21_LENGTH                   equ 0001h
RXF11SIDH_EID21_MASK                     equ 0001h
RXF11SIDH_EID22_POSN                     equ 0001h
RXF11SIDH_EID22_POSITION                 equ 0001h
RXF11SIDH_EID22_SIZE                     equ 0001h
RXF11SIDH_EID22_LENGTH                   equ 0001h
RXF11SIDH_EID22_MASK                     equ 0002h
RXF11SIDH_EID23_POSN                     equ 0002h
RXF11SIDH_EID23_POSITION                 equ 0002h
RXF11SIDH_EID23_SIZE                     equ 0001h
RXF11SIDH_EID23_LENGTH                   equ 0001h
RXF11SIDH_EID23_MASK                     equ 0004h
RXF11SIDH_EID24_POSN                     equ 0003h
RXF11SIDH_EID24_POSITION                 equ 0003h
RXF11SIDH_EID24_SIZE                     equ 0001h
RXF11SIDH_EID24_LENGTH                   equ 0001h
RXF11SIDH_EID24_MASK                     equ 0008h
RXF11SIDH_EID25_POSN                     equ 0004h
RXF11SIDH_EID25_POSITION                 equ 0004h
RXF11SIDH_EID25_SIZE                     equ 0001h
RXF11SIDH_EID25_LENGTH                   equ 0001h
RXF11SIDH_EID25_MASK                     equ 0010h
RXF11SIDH_EID26_POSN                     equ 0005h
RXF11SIDH_EID26_POSITION                 equ 0005h
RXF11SIDH_EID26_SIZE                     equ 0001h
RXF11SIDH_EID26_LENGTH                   equ 0001h
RXF11SIDH_EID26_MASK                     equ 0020h
RXF11SIDH_EID27_POSN                     equ 0006h
RXF11SIDH_EID27_POSITION                 equ 0006h
RXF11SIDH_EID27_SIZE                     equ 0001h
RXF11SIDH_EID27_LENGTH                   equ 0001h
RXF11SIDH_EID27_MASK                     equ 0040h
RXF11SIDH_EID28_POSN                     equ 0007h
RXF11SIDH_EID28_POSITION                 equ 0007h
RXF11SIDH_EID28_SIZE                     equ 0001h
RXF11SIDH_EID28_LENGTH                   equ 0001h
RXF11SIDH_EID28_MASK                     equ 0080h
RXF11SIDH_SID_POSN                       equ 0000h
RXF11SIDH_SID_POSITION                   equ 0000h
RXF11SIDH_SID_SIZE                       equ 0008h
RXF11SIDH_SID_LENGTH                     equ 0008h
RXF11SIDH_SID_MASK                       equ 00FFh

