GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: B1SIDH
#define B1SIDH B1SIDH
B1SIDH                                   equ 03751h
// bitfield definitions
B1SIDH_SID3_POSN                         equ 0000h
B1SIDH_SID3_POSITION                     equ 0000h
B1SIDH_SID3_SIZE                         equ 0001h
B1SIDH_SID3_LENGTH                       equ 0001h
B1SIDH_SID3_MASK                         equ 0001h
B1SIDH_SID4_POSN                         equ 0001h
B1SIDH_SID4_POSITION                     equ 0001h
B1SIDH_SID4_SIZE                         equ 0001h
B1SIDH_SID4_LENGTH                       equ 0001h
B1SIDH_SID4_MASK                         equ 0002h
B1SIDH_SID5_POSN                         equ 0002h
B1SIDH_SID5_POSITION                     equ 0002h
B1SIDH_SID5_SIZE                         equ 0001h
B1SIDH_SID5_LENGTH                       equ 0001h
B1SIDH_SID5_MASK                         equ 0004h
B1SIDH_SID6_POSN                         equ 0003h
B1SIDH_SID6_POSITION                     equ 0003h
B1SIDH_SID6_SIZE                         equ 0001h
B1SIDH_SID6_LENGTH                       equ 0001h
B1SIDH_SID6_MASK                         equ 0008h
B1SIDH_SID7_POSN                         equ 0004h
B1SIDH_SID7_POSITION                     equ 0004h
B1SIDH_SID7_SIZE                         equ 0001h
B1SIDH_SID7_LENGTH                       equ 0001h
B1SIDH_SID7_MASK                         equ 0010h
B1SIDH_SID8_POSN                         equ 0005h
B1SIDH_SID8_POSITION                     equ 0005h
B1SIDH_SID8_SIZE                         equ 0001h
B1SIDH_SID8_LENGTH                       equ 0001h
B1SIDH_SID8_MASK                         equ 0020h
B1SIDH_SID9_POSN                         equ 0006h
B1SIDH_SID9_POSITION                     equ 0006h
B1SIDH_SID9_SIZE                         equ 0001h
B1SIDH_SID9_LENGTH                       equ 0001h
B1SIDH_SID9_MASK                         equ 0040h
B1SIDH_SID10_POSN                        equ 0007h
B1SIDH_SID10_POSITION                    equ 0007h
B1SIDH_SID10_SIZE                        equ 0001h
B1SIDH_SID10_LENGTH                      equ 0001h
B1SIDH_SID10_MASK                        equ 0080h
B1SIDH_EID21_POSN                        equ 0000h
B1SIDH_EID21_POSITION                    equ 0000h
B1SIDH_EID21_SIZE                        equ 0001h
B1SIDH_EID21_LENGTH                      equ 0001h
B1SIDH_EID21_MASK                        equ 0001h
B1SIDH_EID22_POSN                        equ 0001h
B1SIDH_EID22_POSITION                    equ 0001h
B1SIDH_EID22_SIZE                        equ 0001h
B1SIDH_EID22_LENGTH                      equ 0001h
B1SIDH_EID22_MASK                        equ 0002h
B1SIDH_EID23_POSN                        equ 0002h
B1SIDH_EID23_POSITION                    equ 0002h
B1SIDH_EID23_SIZE                        equ 0001h
B1SIDH_EID23_LENGTH                      equ 0001h
B1SIDH_EID23_MASK                        equ 0004h
B1SIDH_EID24_POSN                        equ 0003h
B1SIDH_EID24_POSITION                    equ 0003h
B1SIDH_EID24_SIZE                        equ 0001h
B1SIDH_EID24_LENGTH                      equ 0001h
B1SIDH_EID24_MASK                        equ 0008h
B1SIDH_EID25_POSN                        equ 0004h
B1SIDH_EID25_POSITION                    equ 0004h
B1SIDH_EID25_SIZE                        equ 0001h
B1SIDH_EID25_LENGTH                      equ 0001h
B1SIDH_EID25_MASK                        equ 0010h
B1SIDH_EID26_POSN                        equ 0005h
B1SIDH_EID26_POSITION                    equ 0005h
B1SIDH_EID26_SIZE                        equ 0001h
B1SIDH_EID26_LENGTH                      equ 0001h
B1SIDH_EID26_MASK                        equ 0020h
B1SIDH_EID27_POSN                        equ 0006h
B1SIDH_EID27_POSITION                    equ 0006h
B1SIDH_EID27_SIZE                        equ 0001h
B1SIDH_EID27_LENGTH                      equ 0001h
B1SIDH_EID27_MASK                        equ 0040h
B1SIDH_EID28_POSN                        equ 0007h
B1SIDH_EID28_POSITION                    equ 0007h
B1SIDH_EID28_SIZE                        equ 0001h
B1SIDH_EID28_LENGTH                      equ 0001h
B1SIDH_EID28_MASK                        equ 0080h
B1SIDH_SID_POSN                          equ 0000h
B1SIDH_SID_POSITION                      equ 0000h
B1SIDH_SID_SIZE                          equ 0008h
B1SIDH_SID_LENGTH                        equ 0008h
B1SIDH_SID_MASK                          equ 00FFh

// Register: B1SIDL
#define B1SIDL B1SIDL
B1SIDL                                   equ 03752h
// bitfield definitions
B1SIDL_EID16_POSN                        equ 0000h
B1SIDL_EID16_POSITION                    equ 0000h
B1SIDL_EID16_SIZE                        equ 0001h
B1SIDL_EID16_LENGTH                      equ 0001h
B1SIDL_EID16_MASK                        equ 0001h
B1SIDL_EID17_POSN                        equ 0001h
B1SIDL_EID17_POSITION                    equ 0001h
B1SIDL_EID17_SIZE                        equ 0001h
B1SIDL_EID17_LENGTH                      equ 0001h
B1SIDL_EID17_MASK                        equ 0002h
B1SIDL_EXIDE_POSN                        equ 0003h
B1SIDL_EXIDE_POSITION                    equ 0003h
B1SIDL_EXIDE_SIZE                        equ 0001h
B1SIDL_EXIDE_LENGTH                      equ 0001h
B1SIDL_EXIDE_MASK                        equ 0008h
B1SIDL_SRR_POSN                          equ 0004h
B1SIDL_SRR_POSITION                      equ 0004h
B1SIDL_SRR_SIZE                          equ 0001h
B1SIDL_SRR_LENGTH                        equ 0001h
B1SIDL_SRR_MASK                          equ 0010h
B1SIDL_SID0_POSN                         equ 0005h
B1SIDL_SID0_POSITION                     equ 0005h
B1SIDL_SID0_SIZE                         equ 0001h
B1SIDL_SID0_LENGTH                       equ 0001h
B1SIDL_SID0_MASK                         equ 0020h
B1SIDL_SID1_POSN                         equ 0006h
B1SIDL_SID1_POSITION                     equ 0006h
B1SIDL_SID1_SIZE                         equ 0001h
B1SIDL_SID1_LENGTH                       equ 0001h
B1SIDL_SID1_MASK                         equ 0040h
B1SIDL_SID2_POSN                         equ 0007h
B1SIDL_SID2_POSITION                     equ 0007h
B1SIDL_SID2_SIZE                         equ 0001h
B1SIDL_SID2_LENGTH                       equ 0001h
B1SIDL_SID2_MASK                         equ 0080h
B1SIDL_EID18_POSN                        equ 0005h
B1SIDL_EID18_POSITION                    equ 0005h
B1SIDL_EID18_SIZE                        equ 0001h
B1SIDL_EID18_LENGTH                      equ 0001h
B1SIDL_EID18_MASK                        equ 0020h
B1SIDL_EID19_POSN                        equ 0006h
B1SIDL_EID19_POSITION                    equ 0006h
B1SIDL_EID19_SIZE                        equ 0001h
B1SIDL_EID19_LENGTH                      equ 0001h
B1SIDL_EID19_MASK                        equ 0040h
B1SIDL_EID20_POSN                        equ 0007h
B1SIDL_EID20_POSITION                    equ 0007h
B1SIDL_EID20_SIZE                        equ 0001h
B1SIDL_EID20_LENGTH                      equ 0001h
B1SIDL_EID20_MASK                        equ 0080h
B1SIDL_EID_POSN                          equ 0000h
B1SIDL_EID_POSITION                      equ 0000h
B1SIDL_EID_SIZE                          equ 0002h
B1SIDL_EID_LENGTH                        equ 0002h
B1SIDL_EID_MASK                          equ 0003h
B1SIDL_SID_POSN                          equ 0005h
B1SIDL_SID_POSITION                      equ 0005h
B1SIDL_SID_SIZE                          equ 0003h
B1SIDL_SID_LENGTH                        equ 0003h
B1SIDL_SID_MASK                          equ 00E0h

// Register: B1EIDH
#define B1EIDH B1EIDH
B1EIDH                                   equ 03753h
// bitfield definitions
B1EIDH_EID8_POSN                         equ 0000h
B1EIDH_EID8_POSITION                     equ 0000h
B1EIDH_EID8_SIZE                         equ 0001h
B1EIDH_EID8_LENGTH                       equ 0001h
B1EIDH_EID8_MASK                         equ 0001h
B1EIDH_EID9_POSN                         equ 0001h
B1EIDH_EID9_POSITION                     equ 0001h
B1EIDH_EID9_SIZE                         equ 0001h
B1EIDH_EID9_LENGTH                       equ 0001h
B1EIDH_EID9_MASK                         equ 0002h
B1EIDH_EID10_POSN                        equ 0002h
B1EIDH_EID10_POSITION                    equ 0002h
B1EIDH_EID10_SIZE                        equ 0001h
B1EIDH_EID10_LENGTH                      equ 0001h
B1EIDH_EID10_MASK                        equ 0004h
B1EIDH_EID11_POSN                        equ 0003h
B1EIDH_EID11_POSITION                    equ 0003h
B1EIDH_EID11_SIZE                        equ 0001h
B1EIDH_EID11_LENGTH                      equ 0001h
B1EIDH_EID11_MASK                        equ 0008h
B1EIDH_EID12_POSN                        equ 0004h
B1EIDH_EID12_POSITION                    equ 0004h
B1EIDH_EID12_SIZE                        equ 0001h
B1EIDH_EID12_LENGTH                      equ 0001h
B1EIDH_EID12_MASK                        equ 0010h
B1EIDH_EID13_POSN                        equ 0005h
B1EIDH_EID13_POSITION                    equ 0005h
B1EIDH_EID13_SIZE                        equ 0001h
B1EIDH_EID13_LENGTH                      equ 0001h
B1EIDH_EID13_MASK                        equ 0020h
B1EIDH_EID14_POSN                        equ 0006h
B1EIDH_EID14_POSITION                    equ 0006h
B1EIDH_EID14_SIZE                        equ 0001h
B1EIDH_EID14_LENGTH                      equ 0001h
B1EIDH_EID14_MASK                        equ 0040h
B1EIDH_EID15_POSN                        equ 0007h
B1EIDH_EID15_POSITION                    equ 0007h
B1EIDH_EID15_SIZE                        equ 0001h
B1EIDH_EID15_LENGTH                      equ 0001h
B1EIDH_EID15_MASK                        equ 0080h
B1EIDH_EID_POSN                          equ 0000h
B1EIDH_EID_POSITION                      equ 0000h
B1EIDH_EID_SIZE                          equ 0008h
B1EIDH_EID_LENGTH                        equ 0008h
B1EIDH_EID_MASK                          equ 00FFh

// Register: B1EIDL
#define B1EIDL B1EIDL
B1EIDL                                   equ 03754h
// bitfield definitions
B1EIDL_EID0_POSN                         equ 0000h
B1EIDL_EID0_POSITION                     equ 0000h
B1EIDL_EID0_SIZE                         equ 0001h
B1EIDL_EID0_LENGTH                       equ 0001h
B1EIDL_EID0_MASK                         equ 0001h
B1EIDL_EID1_POSN                         equ 0001h
B1EIDL_EID1_POSITION                     equ 0001h
B1EIDL_EID1_SIZE                         equ 0001h
B1EIDL_EID1_LENGTH                       equ 0001h
B1EIDL_EID1_MASK                         equ 0002h
B1EIDL_EID2_POSN                         equ 0002h
B1EIDL_EID2_POSITION                     equ 0002h
B1EIDL_EID2_SIZE                         equ 0001h
B1EIDL_EID2_LENGTH                       equ 0001h
B1EIDL_EID2_MASK                         equ 0004h
B1EIDL_EID3_POSN                         equ 0003h
B1EIDL_EID3_POSITION                     equ 0003h
B1EIDL_EID3_SIZE                         equ 0001h
B1EIDL_EID3_LENGTH                       equ 0001h
B1EIDL_EID3_MASK                         equ 0008h
B1EIDL_EID4_POSN                         equ 0004h
B1EIDL_EID4_POSITION                     equ 0004h
B1EIDL_EID4_SIZE                         equ 0001h
B1EIDL_EID4_LENGTH                       equ 0001h
B1EIDL_EID4_MASK                         equ 0010h
B1EIDL_EID5_POSN                         equ 0005h
B1EIDL_EID5_POSITION                     equ 0005h
B1EIDL_EID5_SIZE                         equ 0001h
B1EIDL_EID5_LENGTH                       equ 0001h
B1EIDL_EID5_MASK                         equ 0020h
B1EIDL_EID6_POSN                         equ 0006h
B1EIDL_EID6_POSITION                     equ 0006h
B1EIDL_EID6_SIZE                         equ 0001h
B1EIDL_EID6_LENGTH                       equ 0001h
B1EIDL_EID6_MASK                         equ 0040h
B1EIDL_EID7_POSN                         equ 0007h
B1EIDL_EID7_POSITION                     equ 0007h
B1EIDL_EID7_SIZE                         equ 0001h
B1EIDL_EID7_LENGTH                       equ 0001h
B1EIDL_EID7_MASK                         equ 0080h
B1EIDL_EID_POSN                          equ 0000h
B1EIDL_EID_POSITION                      equ 0000h
B1EIDL_EID_SIZE                          equ 0008h
B1EIDL_EID_LENGTH                        equ 0008h
B1EIDL_EID_MASK                          equ 00FFh

// Register: B1DLC
#define B1DLC B1DLC
B1DLC                                    equ 03755h
// bitfield definitions
B1DLC_DLC0_POSN                          equ 0000h
B1DLC_DLC0_POSITION                      equ 0000h
B1DLC_DLC0_SIZE                          equ 0001h
B1DLC_DLC0_LENGTH                        equ 0001h
B1DLC_DLC0_MASK                          equ 0001h
B1DLC_DLC1_POSN                          equ 0001h
B1DLC_DLC1_POSITION                      equ 0001h
B1DLC_DLC1_SIZE                          equ 0001h
B1DLC_DLC1_LENGTH                        equ 0001h
B1DLC_DLC1_MASK                          equ 0002h
B1DLC_DLC2_POSN                          equ 0002h
B1DLC_DLC2_POSITION                      equ 0002h
B1DLC_DLC2_SIZE                          equ 0001h
B1DLC_DLC2_LENGTH                        equ 0001h
B1DLC_DLC2_MASK                          equ 0004h
B1DLC_DLC3_POSN                          equ 0003h
B1DLC_DLC3_POSITION                      equ 0003h
B1DLC_DLC3_SIZE                          equ 0001h
B1DLC_DLC3_LENGTH                        equ 0001h
B1DLC_DLC3_MASK                          equ 0008h
B1DLC_RB0_POSN                           equ 0004h
B1DLC_RB0_POSITION                       equ 0004h
B1DLC_RB0_SIZE                           equ 0001h
B1DLC_RB0_LENGTH                         equ 0001h
B1DLC_RB0_MASK                           equ 0010h
B1DLC_RB1_POSN                           equ 0005h
B1DLC_RB1_POSITION                       equ 0005h
B1DLC_RB1_SIZE                           equ 0001h
B1DLC_RB1_LENGTH                         equ 0001h
B1DLC_RB1_MASK                           equ 0020h
B1DLC_RXRTR_TXRTR_POSN                   equ 0006h
B1DLC_RXRTR_TXRTR_POSITION               equ 0006h
B1DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B1DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B1DLC_RXRTR_TXRTR_MASK                   equ 0040h
B1DLC_DLC_POSN                           equ 0000h
B1DLC_DLC_POSITION                       equ 0000h
B1DLC_DLC_SIZE                           equ 0004h
B1DLC_DLC_LENGTH                         equ 0004h
B1DLC_DLC_MASK                           equ 000Fh
B1DLC_RB_POSN                            equ 0004h
B1DLC_RB_POSITION                        equ 0004h
B1DLC_RB_SIZE                            equ 0002h
B1DLC_RB_LENGTH                          equ 0002h
B1DLC_RB_MASK                            equ 0030h
B1DLC_RXRTR_POSN                         equ 0006h
B1DLC_RXRTR_POSITION                     equ 0006h
B1DLC_RXRTR_SIZE                         equ 0001h
B1DLC_RXRTR_LENGTH                       equ 0001h
B1DLC_RXRTR_MASK                         equ 0040h
B1DLC_TXRTR_POSN                         equ 0006h
B1DLC_TXRTR_POSITION                     equ 0006h
B1DLC_TXRTR_SIZE                         equ 0001h
B1DLC_TXRTR_LENGTH                       equ 0001h
B1DLC_TXRTR_MASK                         equ 0040h

