GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: CANSTAT_RO1
#define CANSTAT_RO1 CANSTAT_RO1
CANSTAT_RO1                              equ 037EEh
// bitfield definitions
CANSTAT_RO1_EICODE0_POSN                 equ 0000h
CANSTAT_RO1_EICODE0_POSITION             equ 0000h
CANSTAT_RO1_EICODE0_SIZE                 equ 0001h
CANSTAT_RO1_EICODE0_LENGTH               equ 0001h
CANSTAT_RO1_EICODE0_MASK                 equ 0001h
CANSTAT_RO1_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO1_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO1_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO1_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO1_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO1_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO1_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO1_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO1_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO1_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO1_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO1_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO1_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO1_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO1_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO1_EICODE4_POSN                 equ 0004h
CANSTAT_RO1_EICODE4_POSITION             equ 0004h
CANSTAT_RO1_EICODE4_SIZE                 equ 0001h
CANSTAT_RO1_EICODE4_LENGTH               equ 0001h
CANSTAT_RO1_EICODE4_MASK                 equ 0010h
CANSTAT_RO1_OPMODE_POSN                  equ 0005h
CANSTAT_RO1_OPMODE_POSITION              equ 0005h
CANSTAT_RO1_OPMODE_SIZE                  equ 0003h
CANSTAT_RO1_OPMODE_LENGTH                equ 0003h
CANSTAT_RO1_OPMODE_MASK                  equ 00E0h
CANSTAT_RO1_EICODE1_POSN                 equ 0001h
CANSTAT_RO1_EICODE1_POSITION             equ 0001h
CANSTAT_RO1_EICODE1_SIZE                 equ 0001h
CANSTAT_RO1_EICODE1_LENGTH               equ 0001h
CANSTAT_RO1_EICODE1_MASK                 equ 0002h
CANSTAT_RO1_EICODE2_POSN                 equ 0002h
CANSTAT_RO1_EICODE2_POSITION             equ 0002h
CANSTAT_RO1_EICODE2_SIZE                 equ 0001h
CANSTAT_RO1_EICODE2_LENGTH               equ 0001h
CANSTAT_RO1_EICODE2_MASK                 equ 0004h
CANSTAT_RO1_EICODE3_POSN                 equ 0003h
CANSTAT_RO1_EICODE3_POSITION             equ 0003h
CANSTAT_RO1_EICODE3_SIZE                 equ 0001h
CANSTAT_RO1_EICODE3_LENGTH               equ 0001h
CANSTAT_RO1_EICODE3_MASK                 equ 0008h
CANSTAT_RO1_OPMODE0_POSN                 equ 0005h
CANSTAT_RO1_OPMODE0_POSITION             equ 0005h
CANSTAT_RO1_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO1_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO1_OPMODE0_MASK                 equ 0020h
CANSTAT_RO1_OPMODE1_POSN                 equ 0006h
CANSTAT_RO1_OPMODE1_POSITION             equ 0006h
CANSTAT_RO1_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO1_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO1_OPMODE1_MASK                 equ 0040h
CANSTAT_RO1_OPMODE2_POSN                 equ 0007h
CANSTAT_RO1_OPMODE2_POSITION             equ 0007h
CANSTAT_RO1_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO1_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO1_OPMODE2_MASK                 equ 0080h
CANSTAT_RO1_ICODE0_POSN                  equ 0001h
CANSTAT_RO1_ICODE0_POSITION              equ 0001h
CANSTAT_RO1_ICODE0_SIZE                  equ 0001h
CANSTAT_RO1_ICODE0_LENGTH                equ 0001h
CANSTAT_RO1_ICODE0_MASK                  equ 0002h
CANSTAT_RO1_ICODE1_POSN                  equ 0002h
CANSTAT_RO1_ICODE1_POSITION              equ 0002h
CANSTAT_RO1_ICODE1_SIZE                  equ 0001h
CANSTAT_RO1_ICODE1_LENGTH                equ 0001h
CANSTAT_RO1_ICODE1_MASK                  equ 0004h
CANSTAT_RO1_ICODE2_POSN                  equ 0003h
CANSTAT_RO1_ICODE2_POSITION              equ 0003h
CANSTAT_RO1_ICODE2_SIZE                  equ 0001h
CANSTAT_RO1_ICODE2_LENGTH                equ 0001h
CANSTAT_RO1_ICODE2_MASK                  equ 0008h
CANSTAT_RO1_EICODE_POSN                  equ 0000h
CANSTAT_RO1_EICODE_POSITION              equ 0000h
CANSTAT_RO1_EICODE_SIZE                  equ 0005h
CANSTAT_RO1_EICODE_LENGTH                equ 0005h
CANSTAT_RO1_EICODE_MASK                  equ 001Fh
CANSTAT_RO1_ICODE_POSN                   equ 0001h
CANSTAT_RO1_ICODE_POSITION               equ 0001h
CANSTAT_RO1_ICODE_SIZE                   equ 0003h
CANSTAT_RO1_ICODE_LENGTH                 equ 0003h
CANSTAT_RO1_ICODE_MASK                   equ 000Eh

// Register: CANCON_RO1
#define CANCON_RO1 CANCON_RO1
CANCON_RO1                               equ 037EFh
// bitfield definitions
CANCON_RO1_FP0_POSN                      equ 0000h
CANCON_RO1_FP0_POSITION                  equ 0000h
CANCON_RO1_FP0_SIZE                      equ 0001h
CANCON_RO1_FP0_LENGTH                    equ 0001h
CANCON_RO1_FP0_MASK                      equ 0001h
CANCON_RO1_WIN0_FP1_POSN                 equ 0001h
CANCON_RO1_WIN0_FP1_POSITION             equ 0001h
CANCON_RO1_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO1_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO1_WIN0_FP1_MASK                 equ 0002h
CANCON_RO1_WIN1_FP2_POSN                 equ 0002h
CANCON_RO1_WIN1_FP2_POSITION             equ 0002h
CANCON_RO1_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO1_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO1_WIN1_FP2_MASK                 equ 0004h
CANCON_RO1_WIN2_FP3_POSN                 equ 0003h
CANCON_RO1_WIN2_FP3_POSITION             equ 0003h
CANCON_RO1_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO1_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO1_WIN2_FP3_MASK                 equ 0008h
CANCON_RO1_ABAT_POSN                     equ 0004h
CANCON_RO1_ABAT_POSITION                 equ 0004h
CANCON_RO1_ABAT_SIZE                     equ 0001h
CANCON_RO1_ABAT_LENGTH                   equ 0001h
CANCON_RO1_ABAT_MASK                     equ 0010h
CANCON_RO1_REQOP_POSN                    equ 0005h
CANCON_RO1_REQOP_POSITION                equ 0005h
CANCON_RO1_REQOP_SIZE                    equ 0003h
CANCON_RO1_REQOP_LENGTH                  equ 0003h
CANCON_RO1_REQOP_MASK                    equ 00E0h
CANCON_RO1_WIN0_POSN                     equ 0001h
CANCON_RO1_WIN0_POSITION                 equ 0001h
CANCON_RO1_WIN0_SIZE                     equ 0001h
CANCON_RO1_WIN0_LENGTH                   equ 0001h
CANCON_RO1_WIN0_MASK                     equ 0002h
CANCON_RO1_WIN1_POSN                     equ 0002h
CANCON_RO1_WIN1_POSITION                 equ 0002h
CANCON_RO1_WIN1_SIZE                     equ 0001h
CANCON_RO1_WIN1_LENGTH                   equ 0001h
CANCON_RO1_WIN1_MASK                     equ 0004h
CANCON_RO1_WIN2_POSN                     equ 0003h
CANCON_RO1_WIN2_POSITION                 equ 0003h
CANCON_RO1_WIN2_SIZE                     equ 0001h
CANCON_RO1_WIN2_LENGTH                   equ 0001h
CANCON_RO1_WIN2_MASK                     equ 0008h
CANCON_RO1_REQOP0_POSN                   equ 0005h
CANCON_RO1_REQOP0_POSITION               equ 0005h
CANCON_RO1_REQOP0_SIZE                   equ 0001h
CANCON_RO1_REQOP0_LENGTH                 equ 0001h
CANCON_RO1_REQOP0_MASK                   equ 0020h
CANCON_RO1_REQOP1_POSN                   equ 0006h
CANCON_RO1_REQOP1_POSITION               equ 0006h
CANCON_RO1_REQOP1_SIZE                   equ 0001h
CANCON_RO1_REQOP1_LENGTH                 equ 0001h
CANCON_RO1_REQOP1_MASK                   equ 0040h
CANCON_RO1_REQOP2_POSN                   equ 0007h
CANCON_RO1_REQOP2_POSITION               equ 0007h
CANCON_RO1_REQOP2_SIZE                   equ 0001h
CANCON_RO1_REQOP2_LENGTH                 equ 0001h
CANCON_RO1_REQOP2_MASK                   equ 0080h
CANCON_RO1_FP1_POSN                      equ 0001h
CANCON_RO1_FP1_POSITION                  equ 0001h
CANCON_RO1_FP1_SIZE                      equ 0001h
CANCON_RO1_FP1_LENGTH                    equ 0001h
CANCON_RO1_FP1_MASK                      equ 0002h
CANCON_RO1_FP2_POSN                      equ 0002h
CANCON_RO1_FP2_POSITION                  equ 0002h
CANCON_RO1_FP2_SIZE                      equ 0001h
CANCON_RO1_FP2_LENGTH                    equ 0001h
CANCON_RO1_FP2_MASK                      equ 0004h
CANCON_RO1_FP3_POSN                      equ 0003h
CANCON_RO1_FP3_POSITION                  equ 0003h
CANCON_RO1_FP3_SIZE                      equ 0001h
CANCON_RO1_FP3_LENGTH                    equ 0001h
CANCON_RO1_FP3_MASK                      equ 0008h
CANCON_RO1_WIN_POSN                      equ 0001h
CANCON_RO1_WIN_POSITION                  equ 0001h
CANCON_RO1_WIN_SIZE                      equ 0003h
CANCON_RO1_WIN_LENGTH                    equ 0003h
CANCON_RO1_WIN_MASK                      equ 000Eh
CANCON_RO1_FP_POSN                       equ 0000h
CANCON_RO1_FP_POSITION                   equ 0000h
CANCON_RO1_FP_SIZE                       equ 0004h
CANCON_RO1_FP_LENGTH                     equ 0004h
CANCON_RO1_FP_MASK                       equ 000Fh

// Register: RXB1CON
#define RXB1CON RXB1CON
RXB1CON                                  equ 037F0h
// bitfield definitions
RXB1CON_FILHIT0_POSN                     equ 0000h
RXB1CON_FILHIT0_POSITION                 equ 0000h
RXB1CON_FILHIT0_SIZE                     equ 0001h
RXB1CON_FILHIT0_LENGTH                   equ 0001h
RXB1CON_FILHIT0_MASK                     equ 0001h
RXB1CON_FILHIT1_POSN                     equ 0001h
RXB1CON_FILHIT1_POSITION                 equ 0001h
RXB1CON_FILHIT1_SIZE                     equ 0001h
RXB1CON_FILHIT1_LENGTH                   equ 0001h
RXB1CON_FILHIT1_MASK                     equ 0002h
RXB1CON_FILHIT2_POSN                     equ 0002h
RXB1CON_FILHIT2_POSITION                 equ 0002h
RXB1CON_FILHIT2_SIZE                     equ 0001h
RXB1CON_FILHIT2_LENGTH                   equ 0001h
RXB1CON_FILHIT2_MASK                     equ 0004h
RXB1CON_RXRTRRO_FILHIT3_POSN             equ 0003h
RXB1CON_RXRTRRO_FILHIT3_POSITION         equ 0003h
RXB1CON_RXRTRRO_FILHIT3_SIZE             equ 0001h
RXB1CON_RXRTRRO_FILHIT3_LENGTH           equ 0001h
RXB1CON_RXRTRRO_FILHIT3_MASK             equ 0008h
RXB1CON_FILHIT4_POSN                     equ 0004h
RXB1CON_FILHIT4_POSITION                 equ 0004h
RXB1CON_FILHIT4_SIZE                     equ 0001h
RXB1CON_FILHIT4_LENGTH                   equ 0001h
RXB1CON_FILHIT4_MASK                     equ 0010h
RXB1CON_RXM0_RTRRO_POSN                  equ 0005h
RXB1CON_RXM0_RTRRO_POSITION              equ 0005h
RXB1CON_RXM0_RTRRO_SIZE                  equ 0001h
RXB1CON_RXM0_RTRRO_LENGTH                equ 0001h
RXB1CON_RXM0_RTRRO_MASK                  equ 0020h
RXB1CON_RXM1_POSN                        equ 0006h
RXB1CON_RXM1_POSITION                    equ 0006h
RXB1CON_RXM1_SIZE                        equ 0001h
RXB1CON_RXM1_LENGTH                      equ 0001h
RXB1CON_RXM1_MASK                        equ 0040h
RXB1CON_RXFUL_POSN                       equ 0007h
RXB1CON_RXFUL_POSITION                   equ 0007h
RXB1CON_RXFUL_SIZE                       equ 0001h
RXB1CON_RXFUL_LENGTH                     equ 0001h
RXB1CON_RXFUL_MASK                       equ 0080h
RXB1CON_RXRTRRO_POSN                     equ 0003h
RXB1CON_RXRTRRO_POSITION                 equ 0003h
RXB1CON_RXRTRRO_SIZE                     equ 0001h
RXB1CON_RXRTRRO_LENGTH                   equ 0001h
RXB1CON_RXRTRRO_MASK                     equ 0008h
RXB1CON_RXM0_POSN                        equ 0005h
RXB1CON_RXM0_POSITION                    equ 0005h
RXB1CON_RXM0_SIZE                        equ 0001h
RXB1CON_RXM0_LENGTH                      equ 0001h
RXB1CON_RXM0_MASK                        equ 0020h
RXB1CON_FILHIT3_POSN                     equ 0003h
RXB1CON_FILHIT3_POSITION                 equ 0003h
RXB1CON_FILHIT3_SIZE                     equ 0001h
RXB1CON_FILHIT3_LENGTH                   equ 0001h
RXB1CON_FILHIT3_MASK                     equ 0008h
RXB1CON_RTRRO_POSN                       equ 0005h
RXB1CON_RTRRO_POSITION                   equ 0005h
RXB1CON_RTRRO_SIZE                       equ 0001h
RXB1CON_RTRRO_LENGTH                     equ 0001h
RXB1CON_RTRRO_MASK                       equ 0020h

// Register: RXB1SIDH
#define RXB1SIDH RXB1SIDH
RXB1SIDH                                 equ 037F1h
// bitfield definitions
RXB1SIDH_SID3_POSN                       equ 0000h
RXB1SIDH_SID3_POSITION                   equ 0000h
RXB1SIDH_SID3_SIZE                       equ 0001h
RXB1SIDH_SID3_LENGTH                     equ 0001h
RXB1SIDH_SID3_MASK                       equ 0001h
RXB1SIDH_SID4_POSN                       equ 0001h
RXB1SIDH_SID4_POSITION                   equ 0001h
RXB1SIDH_SID4_SIZE                       equ 0001h
RXB1SIDH_SID4_LENGTH                     equ 0001h
RXB1SIDH_SID4_MASK                       equ 0002h
RXB1SIDH_SID5_POSN                       equ 0002h
RXB1SIDH_SID5_POSITION                   equ 0002h
RXB1SIDH_SID5_SIZE                       equ 0001h
RXB1SIDH_SID5_LENGTH                     equ 0001h
RXB1SIDH_SID5_MASK                       equ 0004h
RXB1SIDH_SID6_POSN                       equ 0003h
RXB1SIDH_SID6_POSITION                   equ 0003h
RXB1SIDH_SID6_SIZE                       equ 0001h
RXB1SIDH_SID6_LENGTH                     equ 0001h
RXB1SIDH_SID6_MASK                       equ 0008h
RXB1SIDH_SID7_POSN                       equ 0004h
RXB1SIDH_SID7_POSITION                   equ 0004h
RXB1SIDH_SID7_SIZE                       equ 0001h
RXB1SIDH_SID7_LENGTH                     equ 0001h
RXB1SIDH_SID7_MASK                       equ 0010h
RXB1SIDH_SID8_POSN                       equ 0005h
RXB1SIDH_SID8_POSITION                   equ 0005h
RXB1SIDH_SID8_SIZE                       equ 0001h
RXB1SIDH_SID8_LENGTH                     equ 0001h
RXB1SIDH_SID8_MASK                       equ 0020h
RXB1SIDH_SID9_POSN                       equ 0006h
RXB1SIDH_SID9_POSITION                   equ 0006h
RXB1SIDH_SID9_SIZE                       equ 0001h
RXB1SIDH_SID9_LENGTH                     equ 0001h
RXB1SIDH_SID9_MASK                       equ 0040h
RXB1SIDH_SID10_POSN                      equ 0007h
RXB1SIDH_SID10_POSITION                  equ 0007h
RXB1SIDH_SID10_SIZE                      equ 0001h
RXB1SIDH_SID10_LENGTH                    equ 0001h
RXB1SIDH_SID10_MASK                      equ 0080h
RXB1SIDH_EID21_POSN                      equ 0000h
RXB1SIDH_EID21_POSITION                  equ 0000h
RXB1SIDH_EID21_SIZE                      equ 0001h
RXB1SIDH_EID21_LENGTH                    equ 0001h
RXB1SIDH_EID21_MASK                      equ 0001h
RXB1SIDH_EID22_POSN                      equ 0001h
RXB1SIDH_EID22_POSITION                  equ 0001h
RXB1SIDH_EID22_SIZE                      equ 0001h
RXB1SIDH_EID22_LENGTH                    equ 0001h
RXB1SIDH_EID22_MASK                      equ 0002h
RXB1SIDH_EID23_POSN                      equ 0002h
RXB1SIDH_EID23_POSITION                  equ 0002h
RXB1SIDH_EID23_SIZE                      equ 0001h
RXB1SIDH_EID23_LENGTH                    equ 0001h
RXB1SIDH_EID23_MASK                      equ 0004h
RXB1SIDH_EID24_POSN                      equ 0003h
RXB1SIDH_EID24_POSITION                  equ 0003h
RXB1SIDH_EID24_SIZE                      equ 0001h
RXB1SIDH_EID24_LENGTH                    equ 0001h
RXB1SIDH_EID24_MASK                      equ 0008h
RXB1SIDH_EID25_POSN                      equ 0004h
RXB1SIDH_EID25_POSITION                  equ 0004h
RXB1SIDH_EID25_SIZE                      equ 0001h
RXB1SIDH_EID25_LENGTH                    equ 0001h
RXB1SIDH_EID25_MASK                      equ 0010h
RXB1SIDH_EID26_POSN                      equ 0005h
RXB1SIDH_EID26_POSITION                  equ 0005h
RXB1SIDH_EID26_SIZE                      equ 0001h
RXB1SIDH_EID26_LENGTH                    equ 0001h
RXB1SIDH_EID26_MASK                      equ 0020h
RXB1SIDH_EID27_POSN                      equ 0006h
RXB1SIDH_EID27_POSITION                  equ 0006h
RXB1SIDH_EID27_SIZE                      equ 0001h
RXB1SIDH_EID27_LENGTH                    equ 0001h
RXB1SIDH_EID27_MASK                      equ 0040h
RXB1SIDH_EID28_POSN                      equ 0007h
RXB1SIDH_EID28_POSITION                  equ 0007h
RXB1SIDH_EID28_SIZE                      equ 0001h
RXB1SIDH_EID28_LENGTH                    equ 0001h
RXB1SIDH_EID28_MASK                      equ 0080h
RXB1SIDH_SID_POSN                        equ 0000h
RXB1SIDH_SID_POSITION                    equ 0000h
RXB1SIDH_SID_SIZE                        equ 0008h
RXB1SIDH_SID_LENGTH                      equ 0008h
RXB1SIDH_SID_MASK                        equ 00FFh

// Register: RXB1SIDL
#define RXB1SIDL RXB1SIDL
RXB1SIDL                                 equ 037F2h
// bitfield definitions
RXB1SIDL_EID16_POSN                      equ 0000h
RXB1SIDL_EID16_POSITION                  equ 0000h
RXB1SIDL_EID16_SIZE                      equ 0001h
RXB1SIDL_EID16_LENGTH                    equ 0001h
RXB1SIDL_EID16_MASK                      equ 0001h
RXB1SIDL_EID17_POSN                      equ 0001h
RXB1SIDL_EID17_POSITION                  equ 0001h
RXB1SIDL_EID17_SIZE                      equ 0001h
RXB1SIDL_EID17_LENGTH                    equ 0001h
RXB1SIDL_EID17_MASK                      equ 0002h
RXB1SIDL_EXID_POSN                       equ 0003h
RXB1SIDL_EXID_POSITION                   equ 0003h
RXB1SIDL_EXID_SIZE                       equ 0001h
RXB1SIDL_EXID_LENGTH                     equ 0001h
RXB1SIDL_EXID_MASK                       equ 0008h
RXB1SIDL_SRR_POSN                        equ 0004h
RXB1SIDL_SRR_POSITION                    equ 0004h
RXB1SIDL_SRR_SIZE                        equ 0001h
RXB1SIDL_SRR_LENGTH                      equ 0001h
RXB1SIDL_SRR_MASK                        equ 0010h
RXB1SIDL_SID0_POSN                       equ 0005h
RXB1SIDL_SID0_POSITION                   equ 0005h
RXB1SIDL_SID0_SIZE                       equ 0001h
RXB1SIDL_SID0_LENGTH                     equ 0001h
RXB1SIDL_SID0_MASK                       equ 0020h
RXB1SIDL_SID1_POSN                       equ 0006h
RXB1SIDL_SID1_POSITION                   equ 0006h
RXB1SIDL_SID1_SIZE                       equ 0001h
RXB1SIDL_SID1_LENGTH                     equ 0001h
RXB1SIDL_SID1_MASK                       equ 0040h
RXB1SIDL_SID2_POSN                       equ 0007h
RXB1SIDL_SID2_POSITION                   equ 0007h
RXB1SIDL_SID2_SIZE                       equ 0001h
RXB1SIDL_SID2_LENGTH                     equ 0001h
RXB1SIDL_SID2_MASK                       equ 0080h
RXB1SIDL_EID18_POSN                      equ 0005h
RXB1SIDL_EID18_POSITION                  equ 0005h
RXB1SIDL_EID18_SIZE                      equ 0001h
RXB1SIDL_EID18_LENGTH                    equ 0001h
RXB1SIDL_EID18_MASK                      equ 0020h
RXB1SIDL_EID19_POSN                      equ 0006h
RXB1SIDL_EID19_POSITION                  equ 0006h
RXB1SIDL_EID19_SIZE                      equ 0001h
RXB1SIDL_EID19_LENGTH                    equ 0001h
RXB1SIDL_EID19_MASK                      equ 0040h
RXB1SIDL_EID20_POSN                      equ 0007h
RXB1SIDL_EID20_POSITION                  equ 0007h
RXB1SIDL_EID20_SIZE                      equ 0001h
RXB1SIDL_EID20_LENGTH                    equ 0001h
RXB1SIDL_EID20_MASK                      equ 0080h
RXB1SIDL_EID_POSN                        equ 0000h
RXB1SIDL_EID_POSITION                    equ 0000h
RXB1SIDL_EID_SIZE                        equ 0002h
RXB1SIDL_EID_LENGTH                      equ 0002h
RXB1SIDL_EID_MASK                        equ 0003h
RXB1SIDL_SID_POSN                        equ 0005h
RXB1SIDL_SID_POSITION                    equ 0005h
RXB1SIDL_SID_SIZE                        equ 0003h
RXB1SIDL_SID_LENGTH                      equ 0003h
RXB1SIDL_SID_MASK                        equ 00E0h

// Register: RXB1EIDH
#define RXB1EIDH RXB1EIDH
RXB1EIDH                                 equ 037F3h
// bitfield definitions
RXB1EIDH_EID8_POSN                       equ 0000h
RXB1EIDH_EID8_POSITION                   equ 0000h
RXB1EIDH_EID8_SIZE                       equ 0001h
RXB1EIDH_EID8_LENGTH                     equ 0001h
RXB1EIDH_EID8_MASK                       equ 0001h
RXB1EIDH_EID9_POSN                       equ 0001h
RXB1EIDH_EID9_POSITION                   equ 0001h
RXB1EIDH_EID9_SIZE                       equ 0001h
RXB1EIDH_EID9_LENGTH                     equ 0001h
RXB1EIDH_EID9_MASK                       equ 0002h
RXB1EIDH_EID10_POSN                      equ 0002h
RXB1EIDH_EID10_POSITION                  equ 0002h
RXB1EIDH_EID10_SIZE                      equ 0001h
RXB1EIDH_EID10_LENGTH                    equ 0001h
RXB1EIDH_EID10_MASK                      equ 0004h
RXB1EIDH_EID11_POSN                      equ 0003h
RXB1EIDH_EID11_POSITION                  equ 0003h
RXB1EIDH_EID11_SIZE                      equ 0001h
RXB1EIDH_EID11_LENGTH                    equ 0001h
RXB1EIDH_EID11_MASK                      equ 0008h
RXB1EIDH_EID12_POSN                      equ 0004h
RXB1EIDH_EID12_POSITION                  equ 0004h
RXB1EIDH_EID12_SIZE                      equ 0001h
RXB1EIDH_EID12_LENGTH                    equ 0001h
RXB1EIDH_EID12_MASK                      equ 0010h
RXB1EIDH_EID13_POSN                      equ 0005h
RXB1EIDH_EID13_POSITION                  equ 0005h
RXB1EIDH_EID13_SIZE                      equ 0001h
RXB1EIDH_EID13_LENGTH                    equ 0001h
RXB1EIDH_EID13_MASK                      equ 0020h
RXB1EIDH_EID14_POSN                      equ 0006h
RXB1EIDH_EID14_POSITION                  equ 0006h
RXB1EIDH_EID14_SIZE                      equ 0001h
RXB1EIDH_EID14_LENGTH                    equ 0001h
RXB1EIDH_EID14_MASK                      equ 0040h
RXB1EIDH_EID15_POSN                      equ 0007h
RXB1EIDH_EID15_POSITION                  equ 0007h
RXB1EIDH_EID15_SIZE                      equ 0001h
RXB1EIDH_EID15_LENGTH                    equ 0001h
RXB1EIDH_EID15_MASK                      equ 0080h
RXB1EIDH_EID_POSN                        equ 0000h
RXB1EIDH_EID_POSITION                    equ 0000h
RXB1EIDH_EID_SIZE                        equ 0008h
RXB1EIDH_EID_LENGTH                      equ 0008h
RXB1EIDH_EID_MASK                        equ 00FFh

