GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 03984h
// bitfield definitions
IPR4_TMR1IP_POSN                         equ 0000h
IPR4_TMR1IP_POSITION                     equ 0000h
IPR4_TMR1IP_SIZE                         equ 0001h
IPR4_TMR1IP_LENGTH                       equ 0001h
IPR4_TMR1IP_MASK                         equ 0001h
IPR4_TMR1GIP_POSN                        equ 0001h
IPR4_TMR1GIP_POSITION                    equ 0001h
IPR4_TMR1GIP_SIZE                        equ 0001h
IPR4_TMR1GIP_LENGTH                      equ 0001h
IPR4_TMR1GIP_MASK                        equ 0002h
IPR4_TMR2IP_POSN                         equ 0002h
IPR4_TMR2IP_POSITION                     equ 0002h
IPR4_TMR2IP_SIZE                         equ 0001h
IPR4_TMR2IP_LENGTH                       equ 0001h
IPR4_TMR2IP_MASK                         equ 0004h
IPR4_CCP1IP_POSN                         equ 0003h
IPR4_CCP1IP_POSITION                     equ 0003h
IPR4_CCP1IP_SIZE                         equ 0001h
IPR4_CCP1IP_LENGTH                       equ 0001h
IPR4_CCP1IP_MASK                         equ 0008h
IPR4_NCO1IP_POSN                         equ 0004h
IPR4_NCO1IP_POSITION                     equ 0004h
IPR4_NCO1IP_SIZE                         equ 0001h
IPR4_NCO1IP_LENGTH                       equ 0001h
IPR4_NCO1IP_MASK                         equ 0010h
IPR4_CWG1IP_POSN                         equ 0005h
IPR4_CWG1IP_POSITION                     equ 0005h
IPR4_CWG1IP_SIZE                         equ 0001h
IPR4_CWG1IP_LENGTH                       equ 0001h
IPR4_CWG1IP_MASK                         equ 0020h
IPR4_CLC1IP_POSN                         equ 0006h
IPR4_CLC1IP_POSITION                     equ 0006h
IPR4_CLC1IP_SIZE                         equ 0001h
IPR4_CLC1IP_LENGTH                       equ 0001h
IPR4_CLC1IP_MASK                         equ 0040h
IPR4_INT1IP_POSN                         equ 0007h
IPR4_INT1IP_POSITION                     equ 0007h
IPR4_INT1IP_SIZE                         equ 0001h
IPR4_INT1IP_LENGTH                       equ 0001h
IPR4_INT1IP_MASK                         equ 0080h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 03985h
// bitfield definitions
IPR5_RXB0IP_POSN                         equ 0000h
IPR5_RXB0IP_POSITION                     equ 0000h
IPR5_RXB0IP_SIZE                         equ 0001h
IPR5_RXB0IP_LENGTH                       equ 0001h
IPR5_RXB0IP_MASK                         equ 0001h
IPR5_RXB1IP_POSN                         equ 0001h
IPR5_RXB1IP_POSITION                     equ 0001h
IPR5_RXB1IP_SIZE                         equ 0001h
IPR5_RXB1IP_LENGTH                       equ 0001h
IPR5_RXB1IP_MASK                         equ 0002h
IPR5_TXB0IP_POSN                         equ 0002h
IPR5_TXB0IP_POSITION                     equ 0002h
IPR5_TXB0IP_SIZE                         equ 0001h
IPR5_TXB0IP_LENGTH                       equ 0001h
IPR5_TXB0IP_MASK                         equ 0004h
IPR5_TXB1IP_POSN                         equ 0003h
IPR5_TXB1IP_POSITION                     equ 0003h
IPR5_TXB1IP_SIZE                         equ 0001h
IPR5_TXB1IP_LENGTH                       equ 0001h
IPR5_TXB1IP_MASK                         equ 0008h
IPR5_TXB2IP_POSN                         equ 0004h
IPR5_TXB2IP_POSITION                     equ 0004h
IPR5_TXB2IP_SIZE                         equ 0001h
IPR5_TXB2IP_LENGTH                       equ 0001h
IPR5_TXB2IP_MASK                         equ 0010h
IPR5_ERRIP_POSN                          equ 0005h
IPR5_ERRIP_POSITION                      equ 0005h
IPR5_ERRIP_SIZE                          equ 0001h
IPR5_ERRIP_LENGTH                        equ 0001h
IPR5_ERRIP_MASK                          equ 0020h
IPR5_WAKIP_POSN                          equ 0006h
IPR5_WAKIP_POSITION                      equ 0006h
IPR5_WAKIP_SIZE                          equ 0001h
IPR5_WAKIP_LENGTH                        equ 0001h
IPR5_WAKIP_MASK                          equ 0040h
IPR5_IRXIP_POSN                          equ 0007h
IPR5_IRXIP_POSITION                      equ 0007h
IPR5_IRXIP_SIZE                          equ 0001h
IPR5_IRXIP_LENGTH                        equ 0001h
IPR5_IRXIP_MASK                          equ 0080h
IPR5_FIFOFIP_POSN                        equ 0000h
IPR5_FIFOFIP_POSITION                    equ 0000h
IPR5_FIFOFIP_SIZE                        equ 0001h
IPR5_FIFOFIP_LENGTH                      equ 0001h
IPR5_FIFOFIP_MASK                        equ 0001h
IPR5_RXBnIP_POSN                         equ 0001h
IPR5_RXBnIP_POSITION                     equ 0001h
IPR5_RXBnIP_SIZE                         equ 0001h
IPR5_RXBnIP_LENGTH                       equ 0001h
IPR5_RXBnIP_MASK                         equ 0002h
IPR5_TXBnIP_POSN                         equ 0004h
IPR5_TXBnIP_POSITION                     equ 0004h
IPR5_TXBnIP_SIZE                         equ 0001h
IPR5_TXBnIP_LENGTH                       equ 0001h
IPR5_TXBnIP_MASK                         equ 0010h
IPR5_FIFOWMIP_POSN                       equ 0000h
IPR5_FIFOWMIP_POSITION                   equ 0000h
IPR5_FIFOWMIP_SIZE                       equ 0001h
IPR5_FIFOWMIP_LENGTH                     equ 0001h
IPR5_FIFOWMIP_MASK                       equ 0001h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h
IPR5_EVPOL05_POSN                        equ 0003h
IPR5_EVPOL05_POSITION                    equ 0003h
IPR5_EVPOL05_SIZE                        equ 0001h
IPR5_EVPOL05_LENGTH                      equ 0001h
IPR5_EVPOL05_MASK                        equ 0008h
IPR5_EVPOL15_POSN                        equ 0004h
IPR5_EVPOL15_POSITION                    equ 0004h
IPR5_EVPOL15_SIZE                        equ 0001h
IPR5_EVPOL15_LENGTH                      equ 0001h
IPR5_EVPOL15_MASK                        equ 0010h

