GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 03994h
// bitfield definitions
PIE4_TMR1IE_POSN                         equ 0000h
PIE4_TMR1IE_POSITION                     equ 0000h
PIE4_TMR1IE_SIZE                         equ 0001h
PIE4_TMR1IE_LENGTH                       equ 0001h
PIE4_TMR1IE_MASK                         equ 0001h
PIE4_TMR1GIE_POSN                        equ 0001h
PIE4_TMR1GIE_POSITION                    equ 0001h
PIE4_TMR1GIE_SIZE                        equ 0001h
PIE4_TMR1GIE_LENGTH                      equ 0001h
PIE4_TMR1GIE_MASK                        equ 0002h
PIE4_TMR2IE_POSN                         equ 0002h
PIE4_TMR2IE_POSITION                     equ 0002h
PIE4_TMR2IE_SIZE                         equ 0001h
PIE4_TMR2IE_LENGTH                       equ 0001h
PIE4_TMR2IE_MASK                         equ 0004h
PIE4_CCP1IE_POSN                         equ 0003h
PIE4_CCP1IE_POSITION                     equ 0003h
PIE4_CCP1IE_SIZE                         equ 0001h
PIE4_CCP1IE_LENGTH                       equ 0001h
PIE4_CCP1IE_MASK                         equ 0008h
PIE4_NCO1IE_POSN                         equ 0004h
PIE4_NCO1IE_POSITION                     equ 0004h
PIE4_NCO1IE_SIZE                         equ 0001h
PIE4_NCO1IE_LENGTH                       equ 0001h
PIE4_NCO1IE_MASK                         equ 0010h
PIE4_CWG1IE_POSN                         equ 0005h
PIE4_CWG1IE_POSITION                     equ 0005h
PIE4_CWG1IE_SIZE                         equ 0001h
PIE4_CWG1IE_LENGTH                       equ 0001h
PIE4_CWG1IE_MASK                         equ 0020h
PIE4_CLC1IE_POSN                         equ 0006h
PIE4_CLC1IE_POSITION                     equ 0006h
PIE4_CLC1IE_SIZE                         equ 0001h
PIE4_CLC1IE_LENGTH                       equ 0001h
PIE4_CLC1IE_MASK                         equ 0040h
PIE4_INT1IE_POSN                         equ 0007h
PIE4_INT1IE_POSITION                     equ 0007h
PIE4_INT1IE_SIZE                         equ 0001h
PIE4_INT1IE_LENGTH                       equ 0001h
PIE4_INT1IE_MASK                         equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 03995h
// bitfield definitions
PIE5_RXB0IE_POSN                         equ 0000h
PIE5_RXB0IE_POSITION                     equ 0000h
PIE5_RXB0IE_SIZE                         equ 0001h
PIE5_RXB0IE_LENGTH                       equ 0001h
PIE5_RXB0IE_MASK                         equ 0001h
PIE5_RXB1IE_POSN                         equ 0001h
PIE5_RXB1IE_POSITION                     equ 0001h
PIE5_RXB1IE_SIZE                         equ 0001h
PIE5_RXB1IE_LENGTH                       equ 0001h
PIE5_RXB1IE_MASK                         equ 0002h
PIE5_TXB0IE_POSN                         equ 0002h
PIE5_TXB0IE_POSITION                     equ 0002h
PIE5_TXB0IE_SIZE                         equ 0001h
PIE5_TXB0IE_LENGTH                       equ 0001h
PIE5_TXB0IE_MASK                         equ 0004h
PIE5_TXB1IE_POSN                         equ 0003h
PIE5_TXB1IE_POSITION                     equ 0003h
PIE5_TXB1IE_SIZE                         equ 0001h
PIE5_TXB1IE_LENGTH                       equ 0001h
PIE5_TXB1IE_MASK                         equ 0008h
PIE5_TXB2IE_POSN                         equ 0004h
PIE5_TXB2IE_POSITION                     equ 0004h
PIE5_TXB2IE_SIZE                         equ 0001h
PIE5_TXB2IE_LENGTH                       equ 0001h
PIE5_TXB2IE_MASK                         equ 0010h
PIE5_ERRIE_POSN                          equ 0005h
PIE5_ERRIE_POSITION                      equ 0005h
PIE5_ERRIE_SIZE                          equ 0001h
PIE5_ERRIE_LENGTH                        equ 0001h
PIE5_ERRIE_MASK                          equ 0020h
PIE5_WAKIE_POSN                          equ 0006h
PIE5_WAKIE_POSITION                      equ 0006h
PIE5_WAKIE_SIZE                          equ 0001h
PIE5_WAKIE_LENGTH                        equ 0001h
PIE5_WAKIE_MASK                          equ 0040h
PIE5_IRXIE_POSN                          equ 0007h
PIE5_IRXIE_POSITION                      equ 0007h
PIE5_IRXIE_SIZE                          equ 0001h
PIE5_IRXIE_LENGTH                        equ 0001h
PIE5_IRXIE_MASK                          equ 0080h
PIE5_FIFOFIE_POSN                        equ 0000h
PIE5_FIFOFIE_POSITION                    equ 0000h
PIE5_FIFOFIE_SIZE                        equ 0001h
PIE5_FIFOFIE_LENGTH                      equ 0001h
PIE5_FIFOFIE_MASK                        equ 0001h
PIE5_RXBnIE_POSN                         equ 0001h
PIE5_RXBnIE_POSITION                     equ 0001h
PIE5_RXBnIE_SIZE                         equ 0001h
PIE5_RXBnIE_LENGTH                       equ 0001h
PIE5_RXBnIE_MASK                         equ 0002h
PIE5_TXBnIE_POSN                         equ 0004h
PIE5_TXBnIE_POSITION                     equ 0004h
PIE5_TXBnIE_SIZE                         equ 0001h
PIE5_TXBnIE_LENGTH                       equ 0001h
PIE5_TXBnIE_MASK                         equ 0010h
PIE5_FIFOWMIE_POSN                       equ 0000h
PIE5_FIFOWMIE_POSITION                   equ 0000h
PIE5_FIFOWMIE_SIZE                       equ 0001h
PIE5_FIFOWMIE_LENGTH                     equ 0001h
PIE5_FIFOWMIE_MASK                       equ 0001h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 03996h
// bitfield definitions
PIE6_C2IE_POSN                           equ 0000h
PIE6_C2IE_POSITION                       equ 0000h
PIE6_C2IE_SIZE                           equ 0001h
PIE6_C2IE_LENGTH                         equ 0001h
PIE6_C2IE_MASK                           equ 0001h
PIE6_SMT2IE_POSN                         equ 0001h
PIE6_SMT2IE_POSITION                     equ 0001h
PIE6_SMT2IE_SIZE                         equ 0001h
PIE6_SMT2IE_LENGTH                       equ 0001h
PIE6_SMT2IE_MASK                         equ 0002h
PIE6_SMT2PRAIE_POSN                      equ 0002h
PIE6_SMT2PRAIE_POSITION                  equ 0002h
PIE6_SMT2PRAIE_SIZE                      equ 0001h
PIE6_SMT2PRAIE_LENGTH                    equ 0001h
PIE6_SMT2PRAIE_MASK                      equ 0004h
PIE6_SMT2PWAIE_POSN                      equ 0003h
PIE6_SMT2PWAIE_POSITION                  equ 0003h
PIE6_SMT2PWAIE_SIZE                      equ 0001h
PIE6_SMT2PWAIE_LENGTH                    equ 0001h
PIE6_SMT2PWAIE_MASK                      equ 0008h
PIE6_DMA2SCNTIE_POSN                     equ 0004h
PIE6_DMA2SCNTIE_POSITION                 equ 0004h
PIE6_DMA2SCNTIE_SIZE                     equ 0001h
PIE6_DMA2SCNTIE_LENGTH                   equ 0001h
PIE6_DMA2SCNTIE_MASK                     equ 0010h
PIE6_DMA2DCNTIE_POSN                     equ 0005h
PIE6_DMA2DCNTIE_POSITION                 equ 0005h
PIE6_DMA2DCNTIE_SIZE                     equ 0001h
PIE6_DMA2DCNTIE_LENGTH                   equ 0001h
PIE6_DMA2DCNTIE_MASK                     equ 0020h
PIE6_DMA2ORIE_POSN                       equ 0006h
PIE6_DMA2ORIE_POSITION                   equ 0006h
PIE6_DMA2ORIE_SIZE                       equ 0001h
PIE6_DMA2ORIE_LENGTH                     equ 0001h
PIE6_DMA2ORIE_MASK                       equ 0040h
PIE6_DMA2AIE_POSN                        equ 0007h
PIE6_DMA2AIE_POSITION                    equ 0007h
PIE6_DMA2AIE_SIZE                        equ 0001h
PIE6_DMA2AIE_LENGTH                      equ 0001h
PIE6_DMA2AIE_MASK                        equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 03997h
// bitfield definitions
PIE7_I2C2RXIE_POSN                       equ 0000h
PIE7_I2C2RXIE_POSITION                   equ 0000h
PIE7_I2C2RXIE_SIZE                       equ 0001h
PIE7_I2C2RXIE_LENGTH                     equ 0001h
PIE7_I2C2RXIE_MASK                       equ 0001h
PIE7_I2C2TXIE_POSN                       equ 0001h
PIE7_I2C2TXIE_POSITION                   equ 0001h
PIE7_I2C2TXIE_SIZE                       equ 0001h
PIE7_I2C2TXIE_LENGTH                     equ 0001h
PIE7_I2C2TXIE_MASK                       equ 0002h
PIE7_I2C2IE_POSN                         equ 0002h
PIE7_I2C2IE_POSITION                     equ 0002h
PIE7_I2C2IE_SIZE                         equ 0001h
PIE7_I2C2IE_LENGTH                       equ 0001h
PIE7_I2C2IE_MASK                         equ 0004h
PIE7_I2C2EIE_POSN                        equ 0003h
PIE7_I2C2EIE_POSITION                    equ 0003h
PIE7_I2C2EIE_SIZE                        equ 0001h
PIE7_I2C2EIE_LENGTH                      equ 0001h
PIE7_I2C2EIE_MASK                        equ 0008h
PIE7_U2RXIE_POSN                         equ 0004h
PIE7_U2RXIE_POSITION                     equ 0004h
PIE7_U2RXIE_SIZE                         equ 0001h
PIE7_U2RXIE_LENGTH                       equ 0001h
PIE7_U2RXIE_MASK                         equ 0010h
PIE7_U2TXIE_POSN                         equ 0005h
PIE7_U2TXIE_POSITION                     equ 0005h
PIE7_U2TXIE_SIZE                         equ 0001h
PIE7_U2TXIE_LENGTH                       equ 0001h
PIE7_U2TXIE_MASK                         equ 0020h
PIE7_U2EIE_POSN                          equ 0006h
PIE7_U2EIE_POSITION                      equ 0006h
PIE7_U2EIE_SIZE                          equ 0001h
PIE7_U2EIE_LENGTH                        equ 0001h
PIE7_U2EIE_MASK                          equ 0040h
PIE7_U2IE_POSN                           equ 0007h
PIE7_U2IE_POSITION                       equ 0007h
PIE7_U2IE_SIZE                           equ 0001h
PIE7_U2IE_LENGTH                         equ 0001h
PIE7_U2IE_MASK                           equ 0080h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 03998h
// bitfield definitions
PIE8_TMR3IE_POSN                         equ 0000h
PIE8_TMR3IE_POSITION                     equ 0000h
PIE8_TMR3IE_SIZE                         equ 0001h
PIE8_TMR3IE_LENGTH                       equ 0001h
PIE8_TMR3IE_MASK                         equ 0001h
PIE8_TMR3GIE_POSN                        equ 0001h
PIE8_TMR3GIE_POSITION                    equ 0001h
PIE8_TMR3GIE_SIZE                        equ 0001h
PIE8_TMR3GIE_LENGTH                      equ 0001h
PIE8_TMR3GIE_MASK                        equ 0002h
PIE8_TMR4IE_POSN                         equ 0002h
PIE8_TMR4IE_POSITION                     equ 0002h
PIE8_TMR4IE_SIZE                         equ 0001h
PIE8_TMR4IE_LENGTH                       equ 0001h
PIE8_TMR4IE_MASK                         equ 0004h
PIE8_CCP2IE_POSN                         equ 0003h
PIE8_CCP2IE_POSITION                     equ 0003h
PIE8_CCP2IE_SIZE                         equ 0001h
PIE8_CCP2IE_LENGTH                       equ 0001h
PIE8_CCP2IE_MASK                         equ 0008h
PIE8_CWG2IE_POSN                         equ 0004h
PIE8_CWG2IE_POSITION                     equ 0004h
PIE8_CWG2IE_SIZE                         equ 0001h
PIE8_CWG2IE_LENGTH                       equ 0001h
PIE8_CWG2IE_MASK                         equ 0010h
PIE8_CLC2IE_POSN                         equ 0005h
PIE8_CLC2IE_POSITION                     equ 0005h
PIE8_CLC2IE_SIZE                         equ 0001h
PIE8_CLC2IE_LENGTH                       equ 0001h
PIE8_CLC2IE_MASK                         equ 0020h
PIE8_INT2IE_POSN                         equ 0006h
PIE8_INT2IE_POSITION                     equ 0006h
PIE8_INT2IE_SIZE                         equ 0001h
PIE8_INT2IE_LENGTH                       equ 0001h
PIE8_INT2IE_MASK                         equ 0040h
PIE8_TMR5IE_POSN                         equ 0007h
PIE8_TMR5IE_POSITION                     equ 0007h
PIE8_TMR5IE_SIZE                         equ 0001h
PIE8_TMR5IE_LENGTH                       equ 0001h
PIE8_TMR5IE_MASK                         equ 0080h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 03999h
// bitfield definitions
PIE9_TMR5GIE_POSN                        equ 0000h
PIE9_TMR5GIE_POSITION                    equ 0000h
PIE9_TMR5GIE_SIZE                        equ 0001h
PIE9_TMR5GIE_LENGTH                      equ 0001h
PIE9_TMR5GIE_MASK                        equ 0001h
PIE9_TMR6IE_POSN                         equ 0001h
PIE9_TMR6IE_POSITION                     equ 0001h
PIE9_TMR6IE_SIZE                         equ 0001h
PIE9_TMR6IE_LENGTH                       equ 0001h
PIE9_TMR6IE_MASK                         equ 0002h
PIE9_CCP3IE_POSN                         equ 0002h
PIE9_CCP3IE_POSITION                     equ 0002h
PIE9_CCP3IE_SIZE                         equ 0001h
PIE9_CCP3IE_LENGTH                       equ 0001h
PIE9_CCP3IE_MASK                         equ 0004h
PIE9_CWG3IE_POSN                         equ 0003h
PIE9_CWG3IE_POSITION                     equ 0003h
PIE9_CWG3IE_SIZE                         equ 0001h
PIE9_CWG3IE_LENGTH                       equ 0001h
PIE9_CWG3IE_MASK                         equ 0008h
PIE9_CLC3IE_POSN                         equ 0004h
PIE9_CLC3IE_POSITION                     equ 0004h
PIE9_CLC3IE_SIZE                         equ 0001h
PIE9_CLC3IE_LENGTH                       equ 0001h
PIE9_CLC3IE_MASK                         equ 0010h
PIE9_CCP4IE_POSN                         equ 0005h
PIE9_CCP4IE_POSITION                     equ 0005h
PIE9_CCP4IE_SIZE                         equ 0001h
PIE9_CCP4IE_LENGTH                       equ 0001h
PIE9_CCP4IE_MASK                         equ 0020h
PIE9_CLC4IE_POSN                         equ 0006h
PIE9_CLC4IE_POSITION                     equ 0006h
PIE9_CLC4IE_SIZE                         equ 0001h
PIE9_CLC4IE_LENGTH                       equ 0001h
PIE9_CLC4IE_MASK                         equ 0040h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 039A0h
// bitfield definitions
PIR0_SWIF_POSN                           equ 0000h
PIR0_SWIF_POSITION                       equ 0000h
PIR0_SWIF_SIZE                           equ 0001h
PIR0_SWIF_LENGTH                         equ 0001h
PIR0_SWIF_MASK                           equ 0001h
PIR0_HLVDIF_POSN                         equ 0001h
PIR0_HLVDIF_POSITION                     equ 0001h
PIR0_HLVDIF_SIZE                         equ 0001h
PIR0_HLVDIF_LENGTH                       equ 0001h
PIR0_HLVDIF_MASK                         equ 0002h
PIR0_OSFIF_POSN                          equ 0002h
PIR0_OSFIF_POSITION                      equ 0002h
PIR0_OSFIF_SIZE                          equ 0001h
PIR0_OSFIF_LENGTH                        equ 0001h
PIR0_OSFIF_MASK                          equ 0004h
PIR0_CSWIF_POSN                          equ 0003h
PIR0_CSWIF_POSITION                      equ 0003h
PIR0_CSWIF_SIZE                          equ 0001h
PIR0_CSWIF_LENGTH                        equ 0001h
PIR0_CSWIF_MASK                          equ 0008h
PIR0_NVMIF_POSN                          equ 0004h
PIR0_NVMIF_POSITION                      equ 0004h
PIR0_NVMIF_SIZE                          equ 0001h
PIR0_NVMIF_LENGTH                        equ 0001h
PIR0_NVMIF_MASK                          equ 0010h
PIR0_SCANIF_POSN                         equ 0005h
PIR0_SCANIF_POSITION                     equ 0005h
PIR0_SCANIF_SIZE                         equ 0001h
PIR0_SCANIF_LENGTH                       equ 0001h
PIR0_SCANIF_MASK                         equ 0020h
PIR0_CRCIF_POSN                          equ 0006h
PIR0_CRCIF_POSITION                      equ 0006h
PIR0_CRCIF_SIZE                          equ 0001h
PIR0_CRCIF_LENGTH                        equ 0001h
PIR0_CRCIF_MASK                          equ 0040h
PIR0_IOCIF_POSN                          equ 0007h
PIR0_IOCIF_POSITION                      equ 0007h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 039A1h
// bitfield definitions
PIR1_INT0IF_POSN                         equ 0000h
PIR1_INT0IF_POSITION                     equ 0000h
PIR1_INT0IF_SIZE                         equ 0001h
PIR1_INT0IF_LENGTH                       equ 0001h
PIR1_INT0IF_MASK                         equ 0001h
PIR1_ZCDIF_POSN                          equ 0001h
PIR1_ZCDIF_POSITION                      equ 0001h
PIR1_ZCDIF_SIZE                          equ 0001h
PIR1_ZCDIF_LENGTH                        equ 0001h
PIR1_ZCDIF_MASK                          equ 0002h
PIR1_ADIF_POSN                           equ 0002h
PIR1_ADIF_POSITION                       equ 0002h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0004h
PIR1_ADTIF_POSN                          equ 0003h
PIR1_ADTIF_POSITION                      equ 0003h
PIR1_ADTIF_SIZE                          equ 0001h
PIR1_ADTIF_LENGTH                        equ 0001h
PIR1_ADTIF_MASK                          equ 0008h
PIR1_C1IF_POSN                           equ 0004h
PIR1_C1IF_POSITION                       equ 0004h
PIR1_C1IF_SIZE                           equ 0001h
PIR1_C1IF_LENGTH                         equ 0001h
PIR1_C1IF_MASK                           equ 0010h
PIR1_SMT1IF_POSN                         equ 0005h
PIR1_SMT1IF_POSITION                     equ 0005h
PIR1_SMT1IF_SIZE                         equ 0001h
PIR1_SMT1IF_LENGTH                       equ 0001h
PIR1_SMT1IF_MASK                         equ 0020h
PIR1_SMT1PRAIF_POSN                      equ 0006h
PIR1_SMT1PRAIF_POSITION                  equ 0006h
PIR1_SMT1PRAIF_SIZE                      equ 0001h
PIR1_SMT1PRAIF_LENGTH                    equ 0001h
PIR1_SMT1PRAIF_MASK                      equ 0040h
PIR1_SMT1PWAIF_POSN                      equ 0007h
PIR1_SMT1PWAIF_POSITION                  equ 0007h
PIR1_SMT1PWAIF_SIZE                      equ 0001h
PIR1_SMT1PWAIF_LENGTH                    equ 0001h
PIR1_SMT1PWAIF_MASK                      equ 0080h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h
PIR1_PSPIF_POSN                          equ 0007h
PIR1_PSPIF_POSITION                      equ 0007h
PIR1_PSPIF_SIZE                          equ 0001h
PIR1_PSPIF_LENGTH                        equ 0001h
PIR1_PSPIF_MASK                          equ 0080h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 039A2h
// bitfield definitions
PIR2_DMA1SCNTIF_POSN                     equ 0000h
PIR2_DMA1SCNTIF_POSITION                 equ 0000h
PIR2_DMA1SCNTIF_SIZE                     equ 0001h
PIR2_DMA1SCNTIF_LENGTH                   equ 0001h
PIR2_DMA1SCNTIF_MASK                     equ 0001h
PIR2_DMA1DCNTIF_POSN                     equ 0001h
PIR2_DMA1DCNTIF_POSITION                 equ 0001h
PIR2_DMA1DCNTIF_SIZE                     equ 0001h
PIR2_DMA1DCNTIF_LENGTH                   equ 0001h
PIR2_DMA1DCNTIF_MASK                     equ 0002h
PIR2_DMA1ORIF_POSN                       equ 0002h
PIR2_DMA1ORIF_POSITION                   equ 0002h
PIR2_DMA1ORIF_SIZE                       equ 0001h
PIR2_DMA1ORIF_LENGTH                     equ 0001h
PIR2_DMA1ORIF_MASK                       equ 0004h
PIR2_DMA1AIF_POSN                        equ 0003h
PIR2_DMA1AIF_POSITION                    equ 0003h
PIR2_DMA1AIF_SIZE                        equ 0001h
PIR2_DMA1AIF_LENGTH                      equ 0001h
PIR2_DMA1AIF_MASK                        equ 0008h
PIR2_SPI1RXIF_POSN                       equ 0004h
PIR2_SPI1RXIF_POSITION                   equ 0004h
PIR2_SPI1RXIF_SIZE                       equ 0001h
PIR2_SPI1RXIF_LENGTH                     equ 0001h
PIR2_SPI1RXIF_MASK                       equ 0010h
PIR2_SPI1TXIF_POSN                       equ 0005h
PIR2_SPI1TXIF_POSITION                   equ 0005h
PIR2_SPI1TXIF_SIZE                       equ 0001h
PIR2_SPI1TXIF_LENGTH                     equ 0001h
PIR2_SPI1TXIF_MASK                       equ 0020h
PIR2_SPI1IF_POSN                         equ 0006h
PIR2_SPI1IF_POSITION                     equ 0006h
PIR2_SPI1IF_SIZE                         equ 0001h
PIR2_SPI1IF_LENGTH                       equ 0001h
PIR2_SPI1IF_MASK                         equ 0040h
PIR2_I2C1RXIF_POSN                       equ 0007h
PIR2_I2C1RXIF_POSITION                   equ 0007h
PIR2_I2C1RXIF_SIZE                       equ 0001h
PIR2_I2C1RXIF_LENGTH                     equ 0001h
PIR2_I2C1RXIF_MASK                       equ 0080h
PIR2_CMIF_POSN                           equ 0006h
PIR2_CMIF_POSITION                       equ 0006h
PIR2_CMIF_SIZE                           equ 0001h
PIR2_CMIF_LENGTH                         equ 0001h
PIR2_CMIF_MASK                           equ 0040h

