GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 039A3h
// bitfield definitions
PIR3_I2C1TXIF_POSN                       equ 0000h
PIR3_I2C1TXIF_POSITION                   equ 0000h
PIR3_I2C1TXIF_SIZE                       equ 0001h
PIR3_I2C1TXIF_LENGTH                     equ 0001h
PIR3_I2C1TXIF_MASK                       equ 0001h
PIR3_I2C1IF_POSN                         equ 0001h
PIR3_I2C1IF_POSITION                     equ 0001h
PIR3_I2C1IF_SIZE                         equ 0001h
PIR3_I2C1IF_LENGTH                       equ 0001h
PIR3_I2C1IF_MASK                         equ 0002h
PIR3_I2C1EIF_POSN                        equ 0002h
PIR3_I2C1EIF_POSITION                    equ 0002h
PIR3_I2C1EIF_SIZE                        equ 0001h
PIR3_I2C1EIF_LENGTH                      equ 0001h
PIR3_I2C1EIF_MASK                        equ 0004h
PIR3_U1RXIF_POSN                         equ 0003h
PIR3_U1RXIF_POSITION                     equ 0003h
PIR3_U1RXIF_SIZE                         equ 0001h
PIR3_U1RXIF_LENGTH                       equ 0001h
PIR3_U1RXIF_MASK                         equ 0008h
PIR3_U1TXIF_POSN                         equ 0004h
PIR3_U1TXIF_POSITION                     equ 0004h
PIR3_U1TXIF_SIZE                         equ 0001h
PIR3_U1TXIF_LENGTH                       equ 0001h
PIR3_U1TXIF_MASK                         equ 0010h
PIR3_U1EIF_POSN                          equ 0005h
PIR3_U1EIF_POSITION                      equ 0005h
PIR3_U1EIF_SIZE                          equ 0001h
PIR3_U1EIF_LENGTH                        equ 0001h
PIR3_U1EIF_MASK                          equ 0020h
PIR3_U1IF_POSN                           equ 0006h
PIR3_U1IF_POSITION                       equ 0006h
PIR3_U1IF_SIZE                           equ 0001h
PIR3_U1IF_LENGTH                         equ 0001h
PIR3_U1IF_MASK                           equ 0040h
PIR3_TMR0IF_POSN                         equ 0007h
PIR3_TMR0IF_POSITION                     equ 0007h
PIR3_TMR0IF_SIZE                         equ 0001h
PIR3_TMR0IF_LENGTH                       equ 0001h
PIR3_TMR0IF_MASK                         equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 039A4h
// bitfield definitions
PIR4_TMR1IF_POSN                         equ 0000h
PIR4_TMR1IF_POSITION                     equ 0000h
PIR4_TMR1IF_SIZE                         equ 0001h
PIR4_TMR1IF_LENGTH                       equ 0001h
PIR4_TMR1IF_MASK                         equ 0001h
PIR4_TMR1GIF_POSN                        equ 0001h
PIR4_TMR1GIF_POSITION                    equ 0001h
PIR4_TMR1GIF_SIZE                        equ 0001h
PIR4_TMR1GIF_LENGTH                      equ 0001h
PIR4_TMR1GIF_MASK                        equ 0002h
PIR4_TMR2IF_POSN                         equ 0002h
PIR4_TMR2IF_POSITION                     equ 0002h
PIR4_TMR2IF_SIZE                         equ 0001h
PIR4_TMR2IF_LENGTH                       equ 0001h
PIR4_TMR2IF_MASK                         equ 0004h
PIR4_CCP1IF_POSN                         equ 0003h
PIR4_CCP1IF_POSITION                     equ 0003h
PIR4_CCP1IF_SIZE                         equ 0001h
PIR4_CCP1IF_LENGTH                       equ 0001h
PIR4_CCP1IF_MASK                         equ 0008h
PIR4_NCO1IF_POSN                         equ 0004h
PIR4_NCO1IF_POSITION                     equ 0004h
PIR4_NCO1IF_SIZE                         equ 0001h
PIR4_NCO1IF_LENGTH                       equ 0001h
PIR4_NCO1IF_MASK                         equ 0010h
PIR4_CWG1IF_POSN                         equ 0005h
PIR4_CWG1IF_POSITION                     equ 0005h
PIR4_CWG1IF_SIZE                         equ 0001h
PIR4_CWG1IF_LENGTH                       equ 0001h
PIR4_CWG1IF_MASK                         equ 0020h
PIR4_CLC1IF_POSN                         equ 0006h
PIR4_CLC1IF_POSITION                     equ 0006h
PIR4_CLC1IF_SIZE                         equ 0001h
PIR4_CLC1IF_LENGTH                       equ 0001h
PIR4_CLC1IF_MASK                         equ 0040h
PIR4_INT1IF_POSN                         equ 0007h
PIR4_INT1IF_POSITION                     equ 0007h
PIR4_INT1IF_SIZE                         equ 0001h
PIR4_INT1IF_LENGTH                       equ 0001h
PIR4_INT1IF_MASK                         equ 0080h

// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 039A5h
// bitfield definitions
PIR5_RXB0IF_POSN                         equ 0000h
PIR5_RXB0IF_POSITION                     equ 0000h
PIR5_RXB0IF_SIZE                         equ 0001h
PIR5_RXB0IF_LENGTH                       equ 0001h
PIR5_RXB0IF_MASK                         equ 0001h
PIR5_RXB1IF_POSN                         equ 0001h
PIR5_RXB1IF_POSITION                     equ 0001h
PIR5_RXB1IF_SIZE                         equ 0001h
PIR5_RXB1IF_LENGTH                       equ 0001h
PIR5_RXB1IF_MASK                         equ 0002h
PIR5_TXB0IF_POSN                         equ 0002h
PIR5_TXB0IF_POSITION                     equ 0002h
PIR5_TXB0IF_SIZE                         equ 0001h
PIR5_TXB0IF_LENGTH                       equ 0001h
PIR5_TXB0IF_MASK                         equ 0004h
PIR5_TXB1IF_POSN                         equ 0003h
PIR5_TXB1IF_POSITION                     equ 0003h
PIR5_TXB1IF_SIZE                         equ 0001h
PIR5_TXB1IF_LENGTH                       equ 0001h
PIR5_TXB1IF_MASK                         equ 0008h
PIR5_TXB2IF_POSN                         equ 0004h
PIR5_TXB2IF_POSITION                     equ 0004h
PIR5_TXB2IF_SIZE                         equ 0001h
PIR5_TXB2IF_LENGTH                       equ 0001h
PIR5_TXB2IF_MASK                         equ 0010h
PIR5_ERRIF_POSN                          equ 0005h
PIR5_ERRIF_POSITION                      equ 0005h
PIR5_ERRIF_SIZE                          equ 0001h
PIR5_ERRIF_LENGTH                        equ 0001h
PIR5_ERRIF_MASK                          equ 0020h
PIR5_WAKIF_POSN                          equ 0006h
PIR5_WAKIF_POSITION                      equ 0006h
PIR5_WAKIF_SIZE                          equ 0001h
PIR5_WAKIF_LENGTH                        equ 0001h
PIR5_WAKIF_MASK                          equ 0040h
PIR5_IRXIF_POSN                          equ 0007h
PIR5_IRXIF_POSITION                      equ 0007h
PIR5_IRXIF_SIZE                          equ 0001h
PIR5_IRXIF_LENGTH                        equ 0001h
PIR5_IRXIF_MASK                          equ 0080h
PIR5_FIFOFIF_POSN                        equ 0000h
PIR5_FIFOFIF_POSITION                    equ 0000h
PIR5_FIFOFIF_SIZE                        equ 0001h
PIR5_FIFOFIF_LENGTH                      equ 0001h
PIR5_FIFOFIF_MASK                        equ 0001h
PIR5_RXBnIF_POSN                         equ 0001h
PIR5_RXBnIF_POSITION                     equ 0001h
PIR5_RXBnIF_SIZE                         equ 0001h
PIR5_RXBnIF_LENGTH                       equ 0001h
PIR5_RXBnIF_MASK                         equ 0002h
PIR5_TXBnIF_POSN                         equ 0004h
PIR5_TXBnIF_POSITION                     equ 0004h
PIR5_TXBnIF_SIZE                         equ 0001h
PIR5_TXBnIF_LENGTH                       equ 0001h
PIR5_TXBnIF_MASK                         equ 0010h
PIR5_FIFOWMIF_POSN                       equ 0000h
PIR5_FIFOWMIF_POSITION                   equ 0000h
PIR5_FIFOWMIF_SIZE                       equ 0001h
PIR5_FIFOWMIF_LENGTH                     equ 0001h
PIR5_FIFOWMIF_MASK                       equ 0001h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 039A6h
// bitfield definitions
PIR6_C2IF_POSN                           equ 0000h
PIR6_C2IF_POSITION                       equ 0000h
PIR6_C2IF_SIZE                           equ 0001h
PIR6_C2IF_LENGTH                         equ 0001h
PIR6_C2IF_MASK                           equ 0001h
PIR6_SMT2IF_POSN                         equ 0001h
PIR6_SMT2IF_POSITION                     equ 0001h
PIR6_SMT2IF_SIZE                         equ 0001h
PIR6_SMT2IF_LENGTH                       equ 0001h
PIR6_SMT2IF_MASK                         equ 0002h
PIR6_SMT2PRAIF_POSN                      equ 0002h
PIR6_SMT2PRAIF_POSITION                  equ 0002h
PIR6_SMT2PRAIF_SIZE                      equ 0001h
PIR6_SMT2PRAIF_LENGTH                    equ 0001h
PIR6_SMT2PRAIF_MASK                      equ 0004h
PIR6_SMT2PWAIF_POSN                      equ 0003h
PIR6_SMT2PWAIF_POSITION                  equ 0003h
PIR6_SMT2PWAIF_SIZE                      equ 0001h
PIR6_SMT2PWAIF_LENGTH                    equ 0001h
PIR6_SMT2PWAIF_MASK                      equ 0008h
PIR6_DMA2SCNTIF_POSN                     equ 0004h
PIR6_DMA2SCNTIF_POSITION                 equ 0004h
PIR6_DMA2SCNTIF_SIZE                     equ 0001h
PIR6_DMA2SCNTIF_LENGTH                   equ 0001h
PIR6_DMA2SCNTIF_MASK                     equ 0010h
PIR6_DMA2DCNTIF_POSN                     equ 0005h
PIR6_DMA2DCNTIF_POSITION                 equ 0005h
PIR6_DMA2DCNTIF_SIZE                     equ 0001h
PIR6_DMA2DCNTIF_LENGTH                   equ 0001h
PIR6_DMA2DCNTIF_MASK                     equ 0020h
PIR6_DMA2ORIF_POSN                       equ 0006h
PIR6_DMA2ORIF_POSITION                   equ 0006h
PIR6_DMA2ORIF_SIZE                       equ 0001h
PIR6_DMA2ORIF_LENGTH                     equ 0001h
PIR6_DMA2ORIF_MASK                       equ 0040h
PIR6_DMA2AIF_POSN                        equ 0007h
PIR6_DMA2AIF_POSITION                    equ 0007h
PIR6_DMA2AIF_SIZE                        equ 0001h
PIR6_DMA2AIF_LENGTH                      equ 0001h
PIR6_DMA2AIF_MASK                        equ 0080h

