GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 039A7h
// bitfield definitions
PIR7_I2C2RXIF_POSN                       equ 0000h
PIR7_I2C2RXIF_POSITION                   equ 0000h
PIR7_I2C2RXIF_SIZE                       equ 0001h
PIR7_I2C2RXIF_LENGTH                     equ 0001h
PIR7_I2C2RXIF_MASK                       equ 0001h
PIR7_I2C2TXIF_POSN                       equ 0001h
PIR7_I2C2TXIF_POSITION                   equ 0001h
PIR7_I2C2TXIF_SIZE                       equ 0001h
PIR7_I2C2TXIF_LENGTH                     equ 0001h
PIR7_I2C2TXIF_MASK                       equ 0002h
PIR7_I2C2IF_POSN                         equ 0002h
PIR7_I2C2IF_POSITION                     equ 0002h
PIR7_I2C2IF_SIZE                         equ 0001h
PIR7_I2C2IF_LENGTH                       equ 0001h
PIR7_I2C2IF_MASK                         equ 0004h
PIR7_I2C2EIF_POSN                        equ 0003h
PIR7_I2C2EIF_POSITION                    equ 0003h
PIR7_I2C2EIF_SIZE                        equ 0001h
PIR7_I2C2EIF_LENGTH                      equ 0001h
PIR7_I2C2EIF_MASK                        equ 0008h
PIR7_U2RXIF_POSN                         equ 0004h
PIR7_U2RXIF_POSITION                     equ 0004h
PIR7_U2RXIF_SIZE                         equ 0001h
PIR7_U2RXIF_LENGTH                       equ 0001h
PIR7_U2RXIF_MASK                         equ 0010h
PIR7_U2TXIF_POSN                         equ 0005h
PIR7_U2TXIF_POSITION                     equ 0005h
PIR7_U2TXIF_SIZE                         equ 0001h
PIR7_U2TXIF_LENGTH                       equ 0001h
PIR7_U2TXIF_MASK                         equ 0020h
PIR7_U2EIF_POSN                          equ 0006h
PIR7_U2EIF_POSITION                      equ 0006h
PIR7_U2EIF_SIZE                          equ 0001h
PIR7_U2EIF_LENGTH                        equ 0001h
PIR7_U2EIF_MASK                          equ 0040h
PIR7_U2IF_POSN                           equ 0007h
PIR7_U2IF_POSITION                       equ 0007h
PIR7_U2IF_SIZE                           equ 0001h
PIR7_U2IF_LENGTH                         equ 0001h
PIR7_U2IF_MASK                           equ 0080h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 039A8h
// bitfield definitions
PIR8_TMR3IF_POSN                         equ 0000h
PIR8_TMR3IF_POSITION                     equ 0000h
PIR8_TMR3IF_SIZE                         equ 0001h
PIR8_TMR3IF_LENGTH                       equ 0001h
PIR8_TMR3IF_MASK                         equ 0001h
PIR8_TMR3GIF_POSN                        equ 0001h
PIR8_TMR3GIF_POSITION                    equ 0001h
PIR8_TMR3GIF_SIZE                        equ 0001h
PIR8_TMR3GIF_LENGTH                      equ 0001h
PIR8_TMR3GIF_MASK                        equ 0002h
PIR8_TMR4IF_POSN                         equ 0002h
PIR8_TMR4IF_POSITION                     equ 0002h
PIR8_TMR4IF_SIZE                         equ 0001h
PIR8_TMR4IF_LENGTH                       equ 0001h
PIR8_TMR4IF_MASK                         equ 0004h
PIR8_CCP2IF_POSN                         equ 0003h
PIR8_CCP2IF_POSITION                     equ 0003h
PIR8_CCP2IF_SIZE                         equ 0001h
PIR8_CCP2IF_LENGTH                       equ 0001h
PIR8_CCP2IF_MASK                         equ 0008h
PIR8_CWG2IF_POSN                         equ 0004h
PIR8_CWG2IF_POSITION                     equ 0004h
PIR8_CWG2IF_SIZE                         equ 0001h
PIR8_CWG2IF_LENGTH                       equ 0001h
PIR8_CWG2IF_MASK                         equ 0010h
PIR8_CLC2IF_POSN                         equ 0005h
PIR8_CLC2IF_POSITION                     equ 0005h
PIR8_CLC2IF_SIZE                         equ 0001h
PIR8_CLC2IF_LENGTH                       equ 0001h
PIR8_CLC2IF_MASK                         equ 0020h
PIR8_INT2IF_POSN                         equ 0006h
PIR8_INT2IF_POSITION                     equ 0006h
PIR8_INT2IF_SIZE                         equ 0001h
PIR8_INT2IF_LENGTH                       equ 0001h
PIR8_INT2IF_MASK                         equ 0040h
PIR8_TMR5IF_POSN                         equ 0007h
PIR8_TMR5IF_POSITION                     equ 0007h
PIR8_TMR5IF_SIZE                         equ 0001h
PIR8_TMR5IF_LENGTH                       equ 0001h
PIR8_TMR5IF_MASK                         equ 0080h

// Register: PIR9
#define PIR9 PIR9
PIR9                                     equ 039A9h
// bitfield definitions
PIR9_TMR5GIF_POSN                        equ 0000h
PIR9_TMR5GIF_POSITION                    equ 0000h
PIR9_TMR5GIF_SIZE                        equ 0001h
PIR9_TMR5GIF_LENGTH                      equ 0001h
PIR9_TMR5GIF_MASK                        equ 0001h
PIR9_TMR6IF_POSN                         equ 0001h
PIR9_TMR6IF_POSITION                     equ 0001h
PIR9_TMR6IF_SIZE                         equ 0001h
PIR9_TMR6IF_LENGTH                       equ 0001h
PIR9_TMR6IF_MASK                         equ 0002h
PIR9_CCP3IF_POSN                         equ 0002h
PIR9_CCP3IF_POSITION                     equ 0002h
PIR9_CCP3IF_SIZE                         equ 0001h
PIR9_CCP3IF_LENGTH                       equ 0001h
PIR9_CCP3IF_MASK                         equ 0004h
PIR9_CWG3IF_POSN                         equ 0003h
PIR9_CWG3IF_POSITION                     equ 0003h
PIR9_CWG3IF_SIZE                         equ 0001h
PIR9_CWG3IF_LENGTH                       equ 0001h
PIR9_CWG3IF_MASK                         equ 0008h
PIR9_CLC3IF_POSN                         equ 0004h
PIR9_CLC3IF_POSITION                     equ 0004h
PIR9_CLC3IF_SIZE                         equ 0001h
PIR9_CLC3IF_LENGTH                       equ 0001h
PIR9_CLC3IF_MASK                         equ 0010h
PIR9_CCP4IF_POSN                         equ 0005h
PIR9_CCP4IF_POSITION                     equ 0005h
PIR9_CCP4IF_SIZE                         equ 0001h
PIR9_CCP4IF_LENGTH                       equ 0001h
PIR9_CCP4IF_MASK                         equ 0020h
PIR9_CLC4IF_POSN                         equ 0006h
PIR9_CLC4IF_POSITION                     equ 0006h
PIR9_CLC4IF_SIZE                         equ 0001h
PIR9_CLC4IF_LENGTH                       equ 0001h
PIR9_CLC4IF_MASK                         equ 0040h

