GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 039DEh
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h
OSCTUNE_HFTUN_POSN                       equ 0000h
OSCTUNE_HFTUN_POSITION                   equ 0000h
OSCTUNE_HFTUN_SIZE                       equ 0006h
OSCTUNE_HFTUN_LENGTH                     equ 0006h
OSCTUNE_HFTUN_MASK                       equ 003Fh
OSCTUNE_HFTUN0_POSN                      equ 0000h
OSCTUNE_HFTUN0_POSITION                  equ 0000h
OSCTUNE_HFTUN0_SIZE                      equ 0001h
OSCTUNE_HFTUN0_LENGTH                    equ 0001h
OSCTUNE_HFTUN0_MASK                      equ 0001h
OSCTUNE_HFTUN1_POSN                      equ 0001h
OSCTUNE_HFTUN1_POSITION                  equ 0001h
OSCTUNE_HFTUN1_SIZE                      equ 0001h
OSCTUNE_HFTUN1_LENGTH                    equ 0001h
OSCTUNE_HFTUN1_MASK                      equ 0002h
OSCTUNE_HFTUN2_POSN                      equ 0002h
OSCTUNE_HFTUN2_POSITION                  equ 0002h
OSCTUNE_HFTUN2_SIZE                      equ 0001h
OSCTUNE_HFTUN2_LENGTH                    equ 0001h
OSCTUNE_HFTUN2_MASK                      equ 0004h
OSCTUNE_HFTUN3_POSN                      equ 0003h
OSCTUNE_HFTUN3_POSITION                  equ 0003h
OSCTUNE_HFTUN3_SIZE                      equ 0001h
OSCTUNE_HFTUN3_LENGTH                    equ 0001h
OSCTUNE_HFTUN3_MASK                      equ 0008h
OSCTUNE_HFTUN4_POSN                      equ 0004h
OSCTUNE_HFTUN4_POSITION                  equ 0004h
OSCTUNE_HFTUN4_SIZE                      equ 0001h
OSCTUNE_HFTUN4_LENGTH                    equ 0001h
OSCTUNE_HFTUN4_MASK                      equ 0010h
OSCTUNE_HFTUN5_POSN                      equ 0005h
OSCTUNE_HFTUN5_POSITION                  equ 0005h
OSCTUNE_HFTUN5_SIZE                      equ 0001h
OSCTUNE_HFTUN5_LENGTH                    equ 0001h
OSCTUNE_HFTUN5_MASK                      equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 039DFh
// bitfield definitions
OSCFRQ_FRQ_POSN                          equ 0000h
OSCFRQ_FRQ_POSITION                      equ 0000h
OSCFRQ_FRQ_SIZE                          equ 0004h
OSCFRQ_FRQ_LENGTH                        equ 0004h
OSCFRQ_FRQ_MASK                          equ 000Fh
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h
OSCFRQ_FRQ3_POSN                         equ 0003h
OSCFRQ_FRQ3_POSITION                     equ 0003h
OSCFRQ_FRQ3_SIZE                         equ 0001h
OSCFRQ_FRQ3_LENGTH                       equ 0001h
OSCFRQ_FRQ3_MASK                         equ 0008h
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0004h
OSCFRQ_HFFRQ_LENGTH                      equ 0004h
OSCFRQ_HFFRQ_MASK                        equ 000Fh
OSCFRQ_HFFRQ0_POSN                       equ 0000h
OSCFRQ_HFFRQ0_POSITION                   equ 0000h
OSCFRQ_HFFRQ0_SIZE                       equ 0001h
OSCFRQ_HFFRQ0_LENGTH                     equ 0001h
OSCFRQ_HFFRQ0_MASK                       equ 0001h
OSCFRQ_HFFRQ1_POSN                       equ 0001h
OSCFRQ_HFFRQ1_POSITION                   equ 0001h
OSCFRQ_HFFRQ1_SIZE                       equ 0001h
OSCFRQ_HFFRQ1_LENGTH                     equ 0001h
OSCFRQ_HFFRQ1_MASK                       equ 0002h
OSCFRQ_HFFRQ2_POSN                       equ 0002h
OSCFRQ_HFFRQ2_POSITION                   equ 0002h
OSCFRQ_HFFRQ2_SIZE                       equ 0001h
OSCFRQ_HFFRQ2_LENGTH                     equ 0001h
OSCFRQ_HFFRQ2_MASK                       equ 0004h
OSCFRQ_HFFRQ3_POSN                       equ 0003h
OSCFRQ_HFFRQ3_POSITION                   equ 0003h
OSCFRQ_HFFRQ3_SIZE                       equ 0001h
OSCFRQ_HFFRQ3_LENGTH                     equ 0001h
OSCFRQ_HFFRQ3_MASK                       equ 0008h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 039E0h
// bitfield definitions
NVMADRL_ADR_POSN                         equ 0000h
NVMADRL_ADR_POSITION                     equ 0000h
NVMADRL_ADR_SIZE                         equ 0008h
NVMADRL_ADR_LENGTH                       equ 0008h
NVMADRL_ADR_MASK                         equ 00FFh
NVMADRL_ADR0_POSN                        equ 0000h
NVMADRL_ADR0_POSITION                    equ 0000h
NVMADRL_ADR0_SIZE                        equ 0001h
NVMADRL_ADR0_LENGTH                      equ 0001h
NVMADRL_ADR0_MASK                        equ 0001h
NVMADRL_ADR1_POSN                        equ 0001h
NVMADRL_ADR1_POSITION                    equ 0001h
NVMADRL_ADR1_SIZE                        equ 0001h
NVMADRL_ADR1_LENGTH                      equ 0001h
NVMADRL_ADR1_MASK                        equ 0002h
NVMADRL_ADR2_POSN                        equ 0002h
NVMADRL_ADR2_POSITION                    equ 0002h
NVMADRL_ADR2_SIZE                        equ 0001h
NVMADRL_ADR2_LENGTH                      equ 0001h
NVMADRL_ADR2_MASK                        equ 0004h
NVMADRL_ADR3_POSN                        equ 0003h
NVMADRL_ADR3_POSITION                    equ 0003h
NVMADRL_ADR3_SIZE                        equ 0001h
NVMADRL_ADR3_LENGTH                      equ 0001h
NVMADRL_ADR3_MASK                        equ 0008h
NVMADRL_ADR4_POSN                        equ 0004h
NVMADRL_ADR4_POSITION                    equ 0004h
NVMADRL_ADR4_SIZE                        equ 0001h
NVMADRL_ADR4_LENGTH                      equ 0001h
NVMADRL_ADR4_MASK                        equ 0010h
NVMADRL_ADR5_POSN                        equ 0005h
NVMADRL_ADR5_POSITION                    equ 0005h
NVMADRL_ADR5_SIZE                        equ 0001h
NVMADRL_ADR5_LENGTH                      equ 0001h
NVMADRL_ADR5_MASK                        equ 0020h
NVMADRL_ADR6_POSN                        equ 0006h
NVMADRL_ADR6_POSITION                    equ 0006h
NVMADRL_ADR6_SIZE                        equ 0001h
NVMADRL_ADR6_LENGTH                      equ 0001h
NVMADRL_ADR6_MASK                        equ 0040h
NVMADRL_ADR7_POSN                        equ 0007h
NVMADRL_ADR7_POSITION                    equ 0007h
NVMADRL_ADR7_SIZE                        equ 0001h
NVMADRL_ADR7_LENGTH                      equ 0001h
NVMADRL_ADR7_MASK                        equ 0080h
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

