GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 03A87h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 03ABFh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INT0PPS
#define INT0PPS INT0PPS
INT0PPS                                  equ 03AC0h
// bitfield definitions
INT0PPS_INT0PPS_POSN                     equ 0000h
INT0PPS_INT0PPS_POSITION                 equ 0000h
INT0PPS_INT0PPS_SIZE                     equ 0005h
INT0PPS_INT0PPS_LENGTH                   equ 0005h
INT0PPS_INT0PPS_MASK                     equ 001Fh

// Register: INT1PPS
#define INT1PPS INT1PPS
INT1PPS                                  equ 03AC1h
// bitfield definitions
INT1PPS_INT1PPS_POSN                     equ 0000h
INT1PPS_INT1PPS_POSITION                 equ 0000h
INT1PPS_INT1PPS_SIZE                     equ 0005h
INT1PPS_INT1PPS_LENGTH                   equ 0005h
INT1PPS_INT1PPS_MASK                     equ 001Fh

// Register: INT2PPS
#define INT2PPS INT2PPS
INT2PPS                                  equ 03AC2h
// bitfield definitions
INT2PPS_INT2PPS_POSN                     equ 0000h
INT2PPS_INT2PPS_POSITION                 equ 0000h
INT2PPS_INT2PPS_SIZE                     equ 0005h
INT2PPS_INT2PPS_LENGTH                   equ 0005h
INT2PPS_INT2PPS_MASK                     equ 001Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 03AC3h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 03AC4h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 03AC5h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 03AC6h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0005h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0005h
T3CKIPPS_T3CKIPPS_MASK                   equ 001Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 03AC7h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0005h
T3GPPS_T3GPPS_LENGTH                     equ 0005h
T3GPPS_T3GPPS_MASK                       equ 001Fh

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 03AC8h
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0005h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0005h
T5CKIPPS_T5CKIPPS_MASK                   equ 001Fh

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 03AC9h
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0005h
T5GPPS_T5GPPS_LENGTH                     equ 0005h
T5GPPS_T5GPPS_MASK                       equ 001Fh

// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 03ACAh
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 03ACBh
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 03ACCh
// bitfield definitions
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0005h
T6INPPS_T6INPPS_LENGTH                   equ 0005h
T6INPPS_T6INPPS_MASK                     equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 03ACDh
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 03ACEh
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 03ACFh
// bitfield definitions
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0005h
CCP3PPS_CCP3PPS_LENGTH                   equ 0005h
CCP3PPS_CCP3PPS_MASK                     equ 001Fh

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
CCP4PPS                                  equ 03AD0h
// bitfield definitions
CCP4PPS_CCP4PPS_POSN                     equ 0000h
CCP4PPS_CCP4PPS_POSITION                 equ 0000h
CCP4PPS_CCP4PPS_SIZE                     equ 0005h
CCP4PPS_CCP4PPS_LENGTH                   equ 0005h
CCP4PPS_CCP4PPS_MASK                     equ 001Fh

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 03AD1h
// bitfield definitions
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0005h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0005h
SMT1WINPPS_SMT1WINPPS_MASK               equ 001Fh

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 03AD2h
// bitfield definitions
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0005h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0005h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 001Fh

// Register: SMT2WINPPS
#define SMT2WINPPS SMT2WINPPS
SMT2WINPPS                               equ 03AD3h
// bitfield definitions
SMT2WINPPS_SMT2WINPPS_POSN               equ 0000h
SMT2WINPPS_SMT2WINPPS_POSITION           equ 0000h
SMT2WINPPS_SMT2WINPPS_SIZE               equ 0005h
SMT2WINPPS_SMT2WINPPS_LENGTH             equ 0005h
SMT2WINPPS_SMT2WINPPS_MASK               equ 001Fh

// Register: SMT2SIGPPS
#define SMT2SIGPPS SMT2SIGPPS
SMT2SIGPPS                               equ 03AD4h
// bitfield definitions
SMT2SIGPPS_SMT2SIGPPS_POSN               equ 0000h
SMT2SIGPPS_SMT2SIGPPS_POSITION           equ 0000h
SMT2SIGPPS_SMT2SIGPPS_SIZE               equ 0005h
SMT2SIGPPS_SMT2SIGPPS_LENGTH             equ 0005h
SMT2SIGPPS_SMT2SIGPPS_MASK               equ 001Fh

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
CWG1INPPS                                equ 03AD5h
// bitfield definitions
CWG1INPPS_CWG1INPPS_POSN                 equ 0000h
CWG1INPPS_CWG1INPPS_POSITION             equ 0000h
CWG1INPPS_CWG1INPPS_SIZE                 equ 0005h
CWG1INPPS_CWG1INPPS_LENGTH               equ 0005h
CWG1INPPS_CWG1INPPS_MASK                 equ 001Fh

// Register: CWG2INPPS
#define CWG2INPPS CWG2INPPS
CWG2INPPS                                equ 03AD6h
// bitfield definitions
CWG2INPPS_CWG2INPPS_POSN                 equ 0000h
CWG2INPPS_CWG2INPPS_POSITION             equ 0000h
CWG2INPPS_CWG2INPPS_SIZE                 equ 0005h
CWG2INPPS_CWG2INPPS_LENGTH               equ 0005h
CWG2INPPS_CWG2INPPS_MASK                 equ 001Fh

// Register: CWG3INPPS
#define CWG3INPPS CWG3INPPS
CWG3INPPS                                equ 03AD7h
// bitfield definitions
CWG3INPPS_CWG3INPPS_POSN                 equ 0000h
CWG3INPPS_CWG3INPPS_POSITION             equ 0000h
CWG3INPPS_CWG3INPPS_SIZE                 equ 0005h
CWG3INPPS_CWG3INPPS_LENGTH               equ 0005h
CWG3INPPS_CWG3INPPS_MASK                 equ 001Fh

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
MD1CARLPPS                               equ 03AD8h
// bitfield definitions
MD1CARLPPS_MD1CARLPPS_POSN               equ 0000h
MD1CARLPPS_MD1CARLPPS_POSITION           equ 0000h
MD1CARLPPS_MD1CARLPPS_SIZE               equ 0005h
MD1CARLPPS_MD1CARLPPS_LENGTH             equ 0005h
MD1CARLPPS_MD1CARLPPS_MASK               equ 001Fh

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
MD1CARHPPS                               equ 03AD9h
// bitfield definitions
MD1CARHPPS_MD1CARHPPS_POSN               equ 0000h
MD1CARHPPS_MD1CARHPPS_POSITION           equ 0000h
MD1CARHPPS_MD1CARHPPS_SIZE               equ 0005h
MD1CARHPPS_MD1CARHPPS_LENGTH             equ 0005h
MD1CARHPPS_MD1CARHPPS_MASK               equ 001Fh

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
MD1SRCPPS                                equ 03ADAh
// bitfield definitions
MD1SRCPPS_MD1SRCPPS_POSN                 equ 0000h
MD1SRCPPS_MD1SRCPPS_POSITION             equ 0000h
MD1SRCPPS_MD1SRCPPS_SIZE                 equ 0005h
MD1SRCPPS_MD1SRCPPS_LENGTH               equ 0005h
MD1SRCPPS_MD1SRCPPS_MASK                 equ 001Fh

