GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: I2C1BTO
#define I2C1BTO I2C1BTO
I2C1BTO                                  equ 03D7Ch
// bitfield definitions
I2C1BTO_BTO_POSN                         equ 0000h
I2C1BTO_BTO_POSITION                     equ 0000h
I2C1BTO_BTO_SIZE                         equ 0008h
I2C1BTO_BTO_LENGTH                       equ 0008h
I2C1BTO_BTO_MASK                         equ 00FFh
I2C1BTO_I2CBTO_POSN                      equ 0000h
I2C1BTO_I2CBTO_POSITION                  equ 0000h
I2C1BTO_I2CBTO_SIZE                      equ 0008h
I2C1BTO_I2CBTO_LENGTH                    equ 0008h
I2C1BTO_I2CBTO_MASK                      equ 00FFh
I2C1BTO_BTO0_POSN                        equ 0000h
I2C1BTO_BTO0_POSITION                    equ 0000h
I2C1BTO_BTO0_SIZE                        equ 0001h
I2C1BTO_BTO0_LENGTH                      equ 0001h
I2C1BTO_BTO0_MASK                        equ 0001h
I2C1BTO_BTO1_POSN                        equ 0001h
I2C1BTO_BTO1_POSITION                    equ 0001h
I2C1BTO_BTO1_SIZE                        equ 0001h
I2C1BTO_BTO1_LENGTH                      equ 0001h
I2C1BTO_BTO1_MASK                        equ 0002h
I2C1BTO_BTO2_POSN                        equ 0002h
I2C1BTO_BTO2_POSITION                    equ 0002h
I2C1BTO_BTO2_SIZE                        equ 0001h
I2C1BTO_BTO2_LENGTH                      equ 0001h
I2C1BTO_BTO2_MASK                        equ 0004h
I2C1BTO_I2CBTO0_POSN                     equ 0000h
I2C1BTO_I2CBTO0_POSITION                 equ 0000h
I2C1BTO_I2CBTO0_SIZE                     equ 0001h
I2C1BTO_I2CBTO0_LENGTH                   equ 0001h
I2C1BTO_I2CBTO0_MASK                     equ 0001h
I2C1BTO_I2CBTO1_POSN                     equ 0001h
I2C1BTO_I2CBTO1_POSITION                 equ 0001h
I2C1BTO_I2CBTO1_SIZE                     equ 0001h
I2C1BTO_I2CBTO1_LENGTH                   equ 0001h
I2C1BTO_I2CBTO1_MASK                     equ 0002h
I2C1BTO_I2CBTO2_POSN                     equ 0002h
I2C1BTO_I2CBTO2_POSITION                 equ 0002h
I2C1BTO_I2CBTO2_SIZE                     equ 0001h
I2C1BTO_I2CBTO2_LENGTH                   equ 0001h
I2C1BTO_I2CBTO2_MASK                     equ 0004h

// Register: U2RXB
#define U2RXB U2RXB
U2RXB                                    equ 03DD0h
// bitfield definitions
U2RXB_RXB_POSN                           equ 0000h
U2RXB_RXB_POSITION                       equ 0000h
U2RXB_RXB_SIZE                           equ 0008h
U2RXB_RXB_LENGTH                         equ 0008h
U2RXB_RXB_MASK                           equ 00FFh

// Register: U2RXCHK
#define U2RXCHK U2RXCHK
U2RXCHK                                  equ 03DD1h
// bitfield definitions
U2RXCHK_RXCHK_POSN                       equ 0000h
U2RXCHK_RXCHK_POSITION                   equ 0000h
U2RXCHK_RXCHK_SIZE                       equ 0008h
U2RXCHK_RXCHK_LENGTH                     equ 0008h
U2RXCHK_RXCHK_MASK                       equ 00FFh

// Register: U2TXB
#define U2TXB U2TXB
U2TXB                                    equ 03DD2h
// bitfield definitions
U2TXB_TXB_POSN                           equ 0000h
U2TXB_TXB_POSITION                       equ 0000h
U2TXB_TXB_SIZE                           equ 0008h
U2TXB_TXB_LENGTH                         equ 0008h
U2TXB_TXB_MASK                           equ 00FFh

// Register: U2TXCHK
#define U2TXCHK U2TXCHK
U2TXCHK                                  equ 03DD3h
// bitfield definitions
U2TXCHK_TXCHK_POSN                       equ 0000h
U2TXCHK_TXCHK_POSITION                   equ 0000h
U2TXCHK_TXCHK_SIZE                       equ 0008h
U2TXCHK_TXCHK_LENGTH                     equ 0008h
U2TXCHK_TXCHK_MASK                       equ 00FFh

// Register: U2P1
#define U2P1 U2P1
U2P1                                     equ 03DD4h

// Register: U2P1L
#define U2P1L U2P1L
U2P1L                                    equ 03DD4h
// bitfield definitions
U2P1L_P1L_POSN                           equ 0000h
U2P1L_P1L_POSITION                       equ 0000h
U2P1L_P1L_SIZE                           equ 0008h
U2P1L_P1L_LENGTH                         equ 0008h
U2P1L_P1L_MASK                           equ 00FFh

// Register: U2P1H
#define U2P1H U2P1H
U2P1H                                    equ 03DD5h
// bitfield definitions
U2P1H_P1H_POSN                           equ 0000h
U2P1H_P1H_POSITION                       equ 0000h
U2P1H_P1H_SIZE                           equ 0001h
U2P1H_P1H_LENGTH                         equ 0001h
U2P1H_P1H_MASK                           equ 0001h

// Register: U2P2
#define U2P2 U2P2
U2P2                                     equ 03DD6h

// Register: U2P2L
#define U2P2L U2P2L
U2P2L                                    equ 03DD6h
// bitfield definitions
U2P2L_P2L_POSN                           equ 0000h
U2P2L_P2L_POSITION                       equ 0000h
U2P2L_P2L_SIZE                           equ 0008h
U2P2L_P2L_LENGTH                         equ 0008h
U2P2L_P2L_MASK                           equ 00FFh

// Register: U2P2H
#define U2P2H U2P2H
U2P2H                                    equ 03DD7h
// bitfield definitions
U2P2H_P2H_POSN                           equ 0000h
U2P2H_P2H_POSITION                       equ 0000h
U2P2H_P2H_SIZE                           equ 0001h
U2P2H_P2H_LENGTH                         equ 0001h
U2P2H_P2H_MASK                           equ 0001h

// Register: U2P3
#define U2P3 U2P3
U2P3                                     equ 03DD8h

// Register: U2P3L
#define U2P3L U2P3L
U2P3L                                    equ 03DD8h
// bitfield definitions
U2P3L_P3L_POSN                           equ 0000h
U2P3L_P3L_POSITION                       equ 0000h
U2P3L_P3L_SIZE                           equ 0008h
U2P3L_P3L_LENGTH                         equ 0008h
U2P3L_P3L_MASK                           equ 00FFh

// Register: U2P3H
#define U2P3H U2P3H
U2P3H                                    equ 03DD9h
// bitfield definitions
U2P3H_P3H_POSN                           equ 0000h
U2P3H_P3H_POSITION                       equ 0000h
U2P3H_P3H_SIZE                           equ 0001h
U2P3H_P3H_LENGTH                         equ 0001h
U2P3H_P3H_MASK                           equ 0001h

// Register: U2CON0
#define U2CON0 U2CON0
U2CON0                                   equ 03DDAh
// bitfield definitions
U2CON0_MODE0_POSN                        equ 0000h
U2CON0_MODE0_POSITION                    equ 0000h
U2CON0_MODE0_SIZE                        equ 0001h
U2CON0_MODE0_LENGTH                      equ 0001h
U2CON0_MODE0_MASK                        equ 0001h
U2CON0_MODE1_POSN                        equ 0001h
U2CON0_MODE1_POSITION                    equ 0001h
U2CON0_MODE1_SIZE                        equ 0001h
U2CON0_MODE1_LENGTH                      equ 0001h
U2CON0_MODE1_MASK                        equ 0002h
U2CON0_MODE2_POSN                        equ 0002h
U2CON0_MODE2_POSITION                    equ 0002h
U2CON0_MODE2_SIZE                        equ 0001h
U2CON0_MODE2_LENGTH                      equ 0001h
U2CON0_MODE2_MASK                        equ 0004h
U2CON0_MODE3_POSN                        equ 0003h
U2CON0_MODE3_POSITION                    equ 0003h
U2CON0_MODE3_SIZE                        equ 0001h
U2CON0_MODE3_LENGTH                      equ 0001h
U2CON0_MODE3_MASK                        equ 0008h
U2CON0_U2MODE_POSN                       equ 0000h
U2CON0_U2MODE_POSITION                   equ 0000h
U2CON0_U2MODE_SIZE                       equ 0004h
U2CON0_U2MODE_LENGTH                     equ 0004h
U2CON0_U2MODE_MASK                       equ 000Fh
U2CON0_U2RXEN_POSN                       equ 0004h
U2CON0_U2RXEN_POSITION                   equ 0004h
U2CON0_U2RXEN_SIZE                       equ 0001h
U2CON0_U2RXEN_LENGTH                     equ 0001h
U2CON0_U2RXEN_MASK                       equ 0010h
U2CON0_U2TXEN_POSN                       equ 0005h
U2CON0_U2TXEN_POSITION                   equ 0005h
U2CON0_U2TXEN_SIZE                       equ 0001h
U2CON0_U2TXEN_LENGTH                     equ 0001h
U2CON0_U2TXEN_MASK                       equ 0020h
U2CON0_U2ABDEN_POSN                      equ 0006h
U2CON0_U2ABDEN_POSITION                  equ 0006h
U2CON0_U2ABDEN_SIZE                      equ 0001h
U2CON0_U2ABDEN_LENGTH                    equ 0001h
U2CON0_U2ABDEN_MASK                      equ 0040h
U2CON0_U2BRGS_POSN                       equ 0007h
U2CON0_U2BRGS_POSITION                   equ 0007h
U2CON0_U2BRGS_SIZE                       equ 0001h
U2CON0_U2BRGS_LENGTH                     equ 0001h
U2CON0_U2BRGS_MASK                       equ 0080h
U2CON0_U2MODE0_POSN                      equ 0000h
U2CON0_U2MODE0_POSITION                  equ 0000h
U2CON0_U2MODE0_SIZE                      equ 0001h
U2CON0_U2MODE0_LENGTH                    equ 0001h
U2CON0_U2MODE0_MASK                      equ 0001h
U2CON0_U2MODE1_POSN                      equ 0001h
U2CON0_U2MODE1_POSITION                  equ 0001h
U2CON0_U2MODE1_SIZE                      equ 0001h
U2CON0_U2MODE1_LENGTH                    equ 0001h
U2CON0_U2MODE1_MASK                      equ 0002h
U2CON0_U2MODE2_POSN                      equ 0002h
U2CON0_U2MODE2_POSITION                  equ 0002h
U2CON0_U2MODE2_SIZE                      equ 0001h
U2CON0_U2MODE2_LENGTH                    equ 0001h
U2CON0_U2MODE2_MASK                      equ 0004h
U2CON0_U2MODE3_POSN                      equ 0003h
U2CON0_U2MODE3_POSITION                  equ 0003h
U2CON0_U2MODE3_SIZE                      equ 0001h
U2CON0_U2MODE3_LENGTH                    equ 0001h
U2CON0_U2MODE3_MASK                      equ 0008h
U2CON0_MODE_POSN                         equ 0000h
U2CON0_MODE_POSITION                     equ 0000h
U2CON0_MODE_SIZE                         equ 0004h
U2CON0_MODE_LENGTH                       equ 0004h
U2CON0_MODE_MASK                         equ 000Fh
U2CON0_RXEN_POSN                         equ 0004h
U2CON0_RXEN_POSITION                     equ 0004h
U2CON0_RXEN_SIZE                         equ 0001h
U2CON0_RXEN_LENGTH                       equ 0001h
U2CON0_RXEN_MASK                         equ 0010h
U2CON0_TXEN_POSN                         equ 0005h
U2CON0_TXEN_POSITION                     equ 0005h
U2CON0_TXEN_SIZE                         equ 0001h
U2CON0_TXEN_LENGTH                       equ 0001h
U2CON0_TXEN_MASK                         equ 0020h
U2CON0_ABDEN_POSN                        equ 0006h
U2CON0_ABDEN_POSITION                    equ 0006h
U2CON0_ABDEN_SIZE                        equ 0001h
U2CON0_ABDEN_LENGTH                      equ 0001h
U2CON0_ABDEN_MASK                        equ 0040h
U2CON0_BRGS_POSN                         equ 0007h
U2CON0_BRGS_POSITION                     equ 0007h
U2CON0_BRGS_SIZE                         equ 0001h
U2CON0_BRGS_LENGTH                       equ 0001h
U2CON0_BRGS_MASK                         equ 0080h

// Register: U2CON1
#define U2CON1 U2CON1
U2CON1                                   equ 03DDBh
// bitfield definitions
U2CON1_SENDB_POSN                        equ 0000h
U2CON1_SENDB_POSITION                    equ 0000h
U2CON1_SENDB_SIZE                        equ 0001h
U2CON1_SENDB_LENGTH                      equ 0001h
U2CON1_SENDB_MASK                        equ 0001h
U2CON1_BRKOVR_POSN                       equ 0001h
U2CON1_BRKOVR_POSITION                   equ 0001h
U2CON1_BRKOVR_SIZE                       equ 0001h
U2CON1_BRKOVR_LENGTH                     equ 0001h
U2CON1_BRKOVR_MASK                       equ 0002h
U2CON1_RXBIMD_POSN                       equ 0003h
U2CON1_RXBIMD_POSITION                   equ 0003h
U2CON1_RXBIMD_SIZE                       equ 0001h
U2CON1_RXBIMD_LENGTH                     equ 0001h
U2CON1_RXBIMD_MASK                       equ 0008h
U2CON1_WUE_POSN                          equ 0004h
U2CON1_WUE_POSITION                      equ 0004h
U2CON1_WUE_SIZE                          equ 0001h
U2CON1_WUE_LENGTH                        equ 0001h
U2CON1_WUE_MASK                          equ 0010h
U2CON1_ON_POSN                           equ 0007h
U2CON1_ON_POSITION                       equ 0007h
U2CON1_ON_SIZE                           equ 0001h
U2CON1_ON_LENGTH                         equ 0001h
U2CON1_ON_MASK                           equ 0080h
U2CON1_U2SENDB_POSN                      equ 0000h
U2CON1_U2SENDB_POSITION                  equ 0000h
U2CON1_U2SENDB_SIZE                      equ 0001h
U2CON1_U2SENDB_LENGTH                    equ 0001h
U2CON1_U2SENDB_MASK                      equ 0001h
U2CON1_U2BRKOVR_POSN                     equ 0001h
U2CON1_U2BRKOVR_POSITION                 equ 0001h
U2CON1_U2BRKOVR_SIZE                     equ 0001h
U2CON1_U2BRKOVR_LENGTH                   equ 0001h
U2CON1_U2BRKOVR_MASK                     equ 0002h
U2CON1_U2RXBIMD_POSN                     equ 0003h
U2CON1_U2RXBIMD_POSITION                 equ 0003h
U2CON1_U2RXBIMD_SIZE                     equ 0001h
U2CON1_U2RXBIMD_LENGTH                   equ 0001h
U2CON1_U2RXBIMD_MASK                     equ 0008h
U2CON1_U2WUE_POSN                        equ 0004h
U2CON1_U2WUE_POSITION                    equ 0004h
U2CON1_U2WUE_SIZE                        equ 0001h
U2CON1_U2WUE_LENGTH                      equ 0001h
U2CON1_U2WUE_MASK                        equ 0010h
U2CON1_U2ON_POSN                         equ 0007h
U2CON1_U2ON_POSITION                     equ 0007h
U2CON1_U2ON_SIZE                         equ 0001h
U2CON1_U2ON_LENGTH                       equ 0001h
U2CON1_U2ON_MASK                         equ 0080h

// Register: U2CON2
#define U2CON2 U2CON2
U2CON2                                   equ 03DDCh
// bitfield definitions
U2CON2_FLO_POSN                          equ 0000h
U2CON2_FLO_POSITION                      equ 0000h
U2CON2_FLO_SIZE                          equ 0002h
U2CON2_FLO_LENGTH                        equ 0002h
U2CON2_FLO_MASK                          equ 0003h
U2CON2_TXPOL_POSN                        equ 0002h
U2CON2_TXPOL_POSITION                    equ 0002h
U2CON2_TXPOL_SIZE                        equ 0001h
U2CON2_TXPOL_LENGTH                      equ 0001h
U2CON2_TXPOL_MASK                        equ 0004h
U2CON2_C0EN_POSN                         equ 0003h
U2CON2_C0EN_POSITION                     equ 0003h
U2CON2_C0EN_SIZE                         equ 0001h
U2CON2_C0EN_LENGTH                       equ 0001h
U2CON2_C0EN_MASK                         equ 0008h
U2CON2_STP_POSN                          equ 0004h
U2CON2_STP_POSITION                      equ 0004h
U2CON2_STP_SIZE                          equ 0002h
U2CON2_STP_LENGTH                        equ 0002h
U2CON2_STP_MASK                          equ 0030h
U2CON2_RXPOL_POSN                        equ 0006h
U2CON2_RXPOL_POSITION                    equ 0006h
U2CON2_RXPOL_SIZE                        equ 0001h
U2CON2_RXPOL_LENGTH                      equ 0001h
U2CON2_RXPOL_MASK                        equ 0040h
U2CON2_RUNOVF_POSN                       equ 0007h
U2CON2_RUNOVF_POSITION                   equ 0007h
U2CON2_RUNOVF_SIZE                       equ 0001h
U2CON2_RUNOVF_LENGTH                     equ 0001h
U2CON2_RUNOVF_MASK                       equ 0080h
U2CON2_FLO0_POSN                         equ 0000h
U2CON2_FLO0_POSITION                     equ 0000h
U2CON2_FLO0_SIZE                         equ 0001h
U2CON2_FLO0_LENGTH                       equ 0001h
U2CON2_FLO0_MASK                         equ 0001h
U2CON2_FLO1_POSN                         equ 0001h
U2CON2_FLO1_POSITION                     equ 0001h
U2CON2_FLO1_SIZE                         equ 0001h
U2CON2_FLO1_LENGTH                       equ 0001h
U2CON2_FLO1_MASK                         equ 0002h
U2CON2_STP0_POSN                         equ 0004h
U2CON2_STP0_POSITION                     equ 0004h
U2CON2_STP0_SIZE                         equ 0001h
U2CON2_STP0_LENGTH                       equ 0001h
U2CON2_STP0_MASK                         equ 0010h
U2CON2_STP1_POSN                         equ 0005h
U2CON2_STP1_POSITION                     equ 0005h
U2CON2_STP1_SIZE                         equ 0001h
U2CON2_STP1_LENGTH                       equ 0001h
U2CON2_STP1_MASK                         equ 0020h
U2CON2_U2FLO_POSN                        equ 0000h
U2CON2_U2FLO_POSITION                    equ 0000h
U2CON2_U2FLO_SIZE                        equ 0002h
U2CON2_U2FLO_LENGTH                      equ 0002h
U2CON2_U2FLO_MASK                        equ 0003h
U2CON2_U2TXPOL_POSN                      equ 0002h
U2CON2_U2TXPOL_POSITION                  equ 0002h
U2CON2_U2TXPOL_SIZE                      equ 0001h
U2CON2_U2TXPOL_LENGTH                    equ 0001h
U2CON2_U2TXPOL_MASK                      equ 0004h
U2CON2_U2C0EN_POSN                       equ 0003h
U2CON2_U2C0EN_POSITION                   equ 0003h
U2CON2_U2C0EN_SIZE                       equ 0001h
U2CON2_U2C0EN_LENGTH                     equ 0001h
U2CON2_U2C0EN_MASK                       equ 0008h
U2CON2_U2STP_POSN                        equ 0004h
U2CON2_U2STP_POSITION                    equ 0004h
U2CON2_U2STP_SIZE                        equ 0002h
U2CON2_U2STP_LENGTH                      equ 0002h
U2CON2_U2STP_MASK                        equ 0030h
U2CON2_U2RXPOL_POSN                      equ 0006h
U2CON2_U2RXPOL_POSITION                  equ 0006h
U2CON2_U2RXPOL_SIZE                      equ 0001h
U2CON2_U2RXPOL_LENGTH                    equ 0001h
U2CON2_U2RXPOL_MASK                      equ 0040h
U2CON2_U2RUNOVF_POSN                     equ 0007h
U2CON2_U2RUNOVF_POSITION                 equ 0007h
U2CON2_U2RUNOVF_SIZE                     equ 0001h
U2CON2_U2RUNOVF_LENGTH                   equ 0001h
U2CON2_U2RUNOVF_MASK                     equ 0080h
U2CON2_U2FLO0_POSN                       equ 0000h
U2CON2_U2FLO0_POSITION                   equ 0000h
U2CON2_U2FLO0_SIZE                       equ 0001h
U2CON2_U2FLO0_LENGTH                     equ 0001h
U2CON2_U2FLO0_MASK                       equ 0001h
U2CON2_U2FLO1_POSN                       equ 0001h
U2CON2_U2FLO1_POSITION                   equ 0001h
U2CON2_U2FLO1_SIZE                       equ 0001h
U2CON2_U2FLO1_LENGTH                     equ 0001h
U2CON2_U2FLO1_MASK                       equ 0002h
U2CON2_U2STP0_POSN                       equ 0004h
U2CON2_U2STP0_POSITION                   equ 0004h
U2CON2_U2STP0_SIZE                       equ 0001h
U2CON2_U2STP0_LENGTH                     equ 0001h
U2CON2_U2STP0_MASK                       equ 0010h
U2CON2_U2STP1_POSN                       equ 0005h
U2CON2_U2STP1_POSITION                   equ 0005h
U2CON2_U2STP1_SIZE                       equ 0001h
U2CON2_U2STP1_LENGTH                     equ 0001h
U2CON2_U2STP1_MASK                       equ 0020h

// Register: U2BRG
#define U2BRG U2BRG
U2BRG                                    equ 03DDDh

// Register: U2BRGL
#define U2BRGL U2BRGL
U2BRGL                                   equ 03DDDh
// bitfield definitions
U2BRGL_BRGL_POSN                         equ 0000h
U2BRGL_BRGL_POSITION                     equ 0000h
U2BRGL_BRGL_SIZE                         equ 0008h
U2BRGL_BRGL_LENGTH                       equ 0008h
U2BRGL_BRGL_MASK                         equ 00FFh

// Register: U2BRGH
#define U2BRGH U2BRGH
U2BRGH                                   equ 03DDEh
// bitfield definitions
U2BRGH_BRGH_POSN                         equ 0000h
U2BRGH_BRGH_POSITION                     equ 0000h
U2BRGH_BRGH_SIZE                         equ 0008h
U2BRGH_BRGH_LENGTH                       equ 0008h
U2BRGH_BRGH_MASK                         equ 00FFh

