GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 03F79h
// bitfield definitions
CCPR2H_RH_POSN                           equ 0000h
CCPR2H_RH_POSITION                       equ 0000h
CCPR2H_RH_SIZE                           equ 0008h
CCPR2H_RH_LENGTH                         equ 0008h
CCPR2H_RH_MASK                           equ 00FFh

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 03F7Ah
// bitfield definitions
CCP2CON_MODE_POSN                        equ 0000h
CCP2CON_MODE_POSITION                    equ 0000h
CCP2CON_MODE_SIZE                        equ 0004h
CCP2CON_MODE_LENGTH                      equ 0004h
CCP2CON_MODE_MASK                        equ 000Fh
CCP2CON_FMT_POSN                         equ 0004h
CCP2CON_FMT_POSITION                     equ 0004h
CCP2CON_FMT_SIZE                         equ 0001h
CCP2CON_FMT_LENGTH                       equ 0001h
CCP2CON_FMT_MASK                         equ 0010h
CCP2CON_OUT_POSN                         equ 0005h
CCP2CON_OUT_POSITION                     equ 0005h
CCP2CON_OUT_SIZE                         equ 0001h
CCP2CON_OUT_LENGTH                       equ 0001h
CCP2CON_OUT_MASK                         equ 0020h
CCP2CON_EN_POSN                          equ 0007h
CCP2CON_EN_POSITION                      equ 0007h
CCP2CON_EN_SIZE                          equ 0001h
CCP2CON_EN_LENGTH                        equ 0001h
CCP2CON_EN_MASK                          equ 0080h
CCP2CON_MODE0_POSN                       equ 0000h
CCP2CON_MODE0_POSITION                   equ 0000h
CCP2CON_MODE0_SIZE                       equ 0001h
CCP2CON_MODE0_LENGTH                     equ 0001h
CCP2CON_MODE0_MASK                       equ 0001h
CCP2CON_MODE1_POSN                       equ 0001h
CCP2CON_MODE1_POSITION                   equ 0001h
CCP2CON_MODE1_SIZE                       equ 0001h
CCP2CON_MODE1_LENGTH                     equ 0001h
CCP2CON_MODE1_MASK                       equ 0002h
CCP2CON_MODE2_POSN                       equ 0002h
CCP2CON_MODE2_POSITION                   equ 0002h
CCP2CON_MODE2_SIZE                       equ 0001h
CCP2CON_MODE2_LENGTH                     equ 0001h
CCP2CON_MODE2_MASK                       equ 0004h
CCP2CON_MODE3_POSN                       equ 0003h
CCP2CON_MODE3_POSITION                   equ 0003h
CCP2CON_MODE3_SIZE                       equ 0001h
CCP2CON_MODE3_LENGTH                     equ 0001h
CCP2CON_MODE3_MASK                       equ 0008h
CCP2CON_CCP2MODE_POSN                    equ 0000h
CCP2CON_CCP2MODE_POSITION                equ 0000h
CCP2CON_CCP2MODE_SIZE                    equ 0004h
CCP2CON_CCP2MODE_LENGTH                  equ 0004h
CCP2CON_CCP2MODE_MASK                    equ 000Fh
CCP2CON_CCP2FMT_POSN                     equ 0004h
CCP2CON_CCP2FMT_POSITION                 equ 0004h
CCP2CON_CCP2FMT_SIZE                     equ 0001h
CCP2CON_CCP2FMT_LENGTH                   equ 0001h
CCP2CON_CCP2FMT_MASK                     equ 0010h
CCP2CON_CCP2OUT_POSN                     equ 0005h
CCP2CON_CCP2OUT_POSITION                 equ 0005h
CCP2CON_CCP2OUT_SIZE                     equ 0001h
CCP2CON_CCP2OUT_LENGTH                   equ 0001h
CCP2CON_CCP2OUT_MASK                     equ 0020h
CCP2CON_CCP2EN_POSN                      equ 0007h
CCP2CON_CCP2EN_POSITION                  equ 0007h
CCP2CON_CCP2EN_SIZE                      equ 0001h
CCP2CON_CCP2EN_LENGTH                    equ 0001h
CCP2CON_CCP2EN_MASK                      equ 0080h
CCP2CON_CCP2MODE0_POSN                   equ 0000h
CCP2CON_CCP2MODE0_POSITION               equ 0000h
CCP2CON_CCP2MODE0_SIZE                   equ 0001h
CCP2CON_CCP2MODE0_LENGTH                 equ 0001h
CCP2CON_CCP2MODE0_MASK                   equ 0001h
CCP2CON_CCP2MODE1_POSN                   equ 0001h
CCP2CON_CCP2MODE1_POSITION               equ 0001h
CCP2CON_CCP2MODE1_SIZE                   equ 0001h
CCP2CON_CCP2MODE1_LENGTH                 equ 0001h
CCP2CON_CCP2MODE1_MASK                   equ 0002h
CCP2CON_CCP2MODE2_POSN                   equ 0002h
CCP2CON_CCP2MODE2_POSITION               equ 0002h
CCP2CON_CCP2MODE2_SIZE                   equ 0001h
CCP2CON_CCP2MODE2_LENGTH                 equ 0001h
CCP2CON_CCP2MODE2_MASK                   equ 0004h
CCP2CON_CCP2MODE3_POSN                   equ 0003h
CCP2CON_CCP2MODE3_POSITION               equ 0003h
CCP2CON_CCP2MODE3_SIZE                   equ 0001h
CCP2CON_CCP2MODE3_LENGTH                 equ 0001h
CCP2CON_CCP2MODE3_MASK                   equ 0008h

// Register: CCP2CAP
#define CCP2CAP CCP2CAP
CCP2CAP                                  equ 03F7Bh
// bitfield definitions
CCP2CAP_CTS_POSN                         equ 0000h
CCP2CAP_CTS_POSITION                     equ 0000h
CCP2CAP_CTS_SIZE                         equ 0008h
CCP2CAP_CTS_LENGTH                       equ 0008h
CCP2CAP_CTS_MASK                         equ 00FFh
CCP2CAP_CTS0_POSN                        equ 0000h
CCP2CAP_CTS0_POSITION                    equ 0000h
CCP2CAP_CTS0_SIZE                        equ 0001h
CCP2CAP_CTS0_LENGTH                      equ 0001h
CCP2CAP_CTS0_MASK                        equ 0001h
CCP2CAP_CTS1_POSN                        equ 0001h
CCP2CAP_CTS1_POSITION                    equ 0001h
CCP2CAP_CTS1_SIZE                        equ 0001h
CCP2CAP_CTS1_LENGTH                      equ 0001h
CCP2CAP_CTS1_MASK                        equ 0002h
CCP2CAP_CTS2_POSN                        equ 0002h
CCP2CAP_CTS2_POSITION                    equ 0002h
CCP2CAP_CTS2_SIZE                        equ 0001h
CCP2CAP_CTS2_LENGTH                      equ 0001h
CCP2CAP_CTS2_MASK                        equ 0004h
CCP2CAP_CCP2CTS_POSN                     equ 0000h
CCP2CAP_CCP2CTS_POSITION                 equ 0000h
CCP2CAP_CCP2CTS_SIZE                     equ 0008h
CCP2CAP_CCP2CTS_LENGTH                   equ 0008h
CCP2CAP_CCP2CTS_MASK                     equ 00FFh
CCP2CAP_CCP2CTS0_POSN                    equ 0000h
CCP2CAP_CCP2CTS0_POSITION                equ 0000h
CCP2CAP_CCP2CTS0_SIZE                    equ 0001h
CCP2CAP_CCP2CTS0_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS0_MASK                    equ 0001h
CCP2CAP_CCP2CTS1_POSN                    equ 0001h
CCP2CAP_CCP2CTS1_POSITION                equ 0001h
CCP2CAP_CCP2CTS1_SIZE                    equ 0001h
CCP2CAP_CCP2CTS1_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS1_MASK                    equ 0002h
CCP2CAP_CCP2CTS2_POSN                    equ 0002h
CCP2CAP_CCP2CTS2_POSITION                equ 0002h
CCP2CAP_CCP2CTS2_SIZE                    equ 0001h
CCP2CAP_CCP2CTS2_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS2_MASK                    equ 0004h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 03F7Ch

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 03F7Ch
// bitfield definitions
CCPR1L_RL_POSN                           equ 0000h
CCPR1L_RL_POSITION                       equ 0000h
CCPR1L_RL_SIZE                           equ 0008h
CCPR1L_RL_LENGTH                         equ 0008h
CCPR1L_RL_MASK                           equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 03F7Dh
// bitfield definitions
CCPR1H_RH_POSN                           equ 0000h
CCPR1H_RH_POSITION                       equ 0000h
CCPR1H_RH_SIZE                           equ 0008h
CCPR1H_RH_LENGTH                         equ 0008h
CCPR1H_RH_MASK                           equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 03F7Eh
// bitfield definitions
CCP1CON_MODE_POSN                        equ 0000h
CCP1CON_MODE_POSITION                    equ 0000h
CCP1CON_MODE_SIZE                        equ 0004h
CCP1CON_MODE_LENGTH                      equ 0004h
CCP1CON_MODE_MASK                        equ 000Fh
CCP1CON_FMT_POSN                         equ 0004h
CCP1CON_FMT_POSITION                     equ 0004h
CCP1CON_FMT_SIZE                         equ 0001h
CCP1CON_FMT_LENGTH                       equ 0001h
CCP1CON_FMT_MASK                         equ 0010h
CCP1CON_OUT_POSN                         equ 0005h
CCP1CON_OUT_POSITION                     equ 0005h
CCP1CON_OUT_SIZE                         equ 0001h
CCP1CON_OUT_LENGTH                       equ 0001h
CCP1CON_OUT_MASK                         equ 0020h
CCP1CON_EN_POSN                          equ 0007h
CCP1CON_EN_POSITION                      equ 0007h
CCP1CON_EN_SIZE                          equ 0001h
CCP1CON_EN_LENGTH                        equ 0001h
CCP1CON_EN_MASK                          equ 0080h
CCP1CON_MODE0_POSN                       equ 0000h
CCP1CON_MODE0_POSITION                   equ 0000h
CCP1CON_MODE0_SIZE                       equ 0001h
CCP1CON_MODE0_LENGTH                     equ 0001h
CCP1CON_MODE0_MASK                       equ 0001h
CCP1CON_MODE1_POSN                       equ 0001h
CCP1CON_MODE1_POSITION                   equ 0001h
CCP1CON_MODE1_SIZE                       equ 0001h
CCP1CON_MODE1_LENGTH                     equ 0001h
CCP1CON_MODE1_MASK                       equ 0002h
CCP1CON_MODE2_POSN                       equ 0002h
CCP1CON_MODE2_POSITION                   equ 0002h
CCP1CON_MODE2_SIZE                       equ 0001h
CCP1CON_MODE2_LENGTH                     equ 0001h
CCP1CON_MODE2_MASK                       equ 0004h
CCP1CON_MODE3_POSN                       equ 0003h
CCP1CON_MODE3_POSITION                   equ 0003h
CCP1CON_MODE3_SIZE                       equ 0001h
CCP1CON_MODE3_LENGTH                     equ 0001h
CCP1CON_MODE3_MASK                       equ 0008h
CCP1CON_CCP1MODE_POSN                    equ 0000h
CCP1CON_CCP1MODE_POSITION                equ 0000h
CCP1CON_CCP1MODE_SIZE                    equ 0004h
CCP1CON_CCP1MODE_LENGTH                  equ 0004h
CCP1CON_CCP1MODE_MASK                    equ 000Fh
CCP1CON_CCP1FMT_POSN                     equ 0004h
CCP1CON_CCP1FMT_POSITION                 equ 0004h
CCP1CON_CCP1FMT_SIZE                     equ 0001h
CCP1CON_CCP1FMT_LENGTH                   equ 0001h
CCP1CON_CCP1FMT_MASK                     equ 0010h
CCP1CON_CCP1OUT_POSN                     equ 0005h
CCP1CON_CCP1OUT_POSITION                 equ 0005h
CCP1CON_CCP1OUT_SIZE                     equ 0001h
CCP1CON_CCP1OUT_LENGTH                   equ 0001h
CCP1CON_CCP1OUT_MASK                     equ 0020h
CCP1CON_CCP1EN_POSN                      equ 0007h
CCP1CON_CCP1EN_POSITION                  equ 0007h
CCP1CON_CCP1EN_SIZE                      equ 0001h
CCP1CON_CCP1EN_LENGTH                    equ 0001h
CCP1CON_CCP1EN_MASK                      equ 0080h
CCP1CON_CCP1MODE0_POSN                   equ 0000h
CCP1CON_CCP1MODE0_POSITION               equ 0000h
CCP1CON_CCP1MODE0_SIZE                   equ 0001h
CCP1CON_CCP1MODE0_LENGTH                 equ 0001h
CCP1CON_CCP1MODE0_MASK                   equ 0001h
CCP1CON_CCP1MODE1_POSN                   equ 0001h
CCP1CON_CCP1MODE1_POSITION               equ 0001h
CCP1CON_CCP1MODE1_SIZE                   equ 0001h
CCP1CON_CCP1MODE1_LENGTH                 equ 0001h
CCP1CON_CCP1MODE1_MASK                   equ 0002h
CCP1CON_CCP1MODE2_POSN                   equ 0002h
CCP1CON_CCP1MODE2_POSITION               equ 0002h
CCP1CON_CCP1MODE2_SIZE                   equ 0001h
CCP1CON_CCP1MODE2_LENGTH                 equ 0001h
CCP1CON_CCP1MODE2_MASK                   equ 0004h
CCP1CON_CCP1MODE3_POSN                   equ 0003h
CCP1CON_CCP1MODE3_POSITION               equ 0003h
CCP1CON_CCP1MODE3_SIZE                   equ 0001h
CCP1CON_CCP1MODE3_LENGTH                 equ 0001h
CCP1CON_CCP1MODE3_MASK                   equ 0008h

// Register: CCP1CAP
#define CCP1CAP CCP1CAP
CCP1CAP                                  equ 03F7Fh
// bitfield definitions
CCP1CAP_CTS_POSN                         equ 0000h
CCP1CAP_CTS_POSITION                     equ 0000h
CCP1CAP_CTS_SIZE                         equ 0008h
CCP1CAP_CTS_LENGTH                       equ 0008h
CCP1CAP_CTS_MASK                         equ 00FFh
CCP1CAP_CTS0_POSN                        equ 0000h
CCP1CAP_CTS0_POSITION                    equ 0000h
CCP1CAP_CTS0_SIZE                        equ 0001h
CCP1CAP_CTS0_LENGTH                      equ 0001h
CCP1CAP_CTS0_MASK                        equ 0001h
CCP1CAP_CTS1_POSN                        equ 0001h
CCP1CAP_CTS1_POSITION                    equ 0001h
CCP1CAP_CTS1_SIZE                        equ 0001h
CCP1CAP_CTS1_LENGTH                      equ 0001h
CCP1CAP_CTS1_MASK                        equ 0002h
CCP1CAP_CTS2_POSN                        equ 0002h
CCP1CAP_CTS2_POSITION                    equ 0002h
CCP1CAP_CTS2_SIZE                        equ 0001h
CCP1CAP_CTS2_LENGTH                      equ 0001h
CCP1CAP_CTS2_MASK                        equ 0004h
CCP1CAP_CCP1CTS_POSN                     equ 0000h
CCP1CAP_CCP1CTS_POSITION                 equ 0000h
CCP1CAP_CCP1CTS_SIZE                     equ 0008h
CCP1CAP_CCP1CTS_LENGTH                   equ 0008h
CCP1CAP_CCP1CTS_MASK                     equ 00FFh
CCP1CAP_CCP1CTS0_POSN                    equ 0000h
CCP1CAP_CCP1CTS0_POSITION                equ 0000h
CCP1CAP_CCP1CTS0_SIZE                    equ 0001h
CCP1CAP_CCP1CTS0_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS0_MASK                    equ 0001h
CCP1CAP_CCP1CTS1_POSN                    equ 0001h
CCP1CAP_CCP1CTS1_POSITION                equ 0001h
CCP1CAP_CCP1CTS1_SIZE                    equ 0001h
CCP1CAP_CCP1CTS1_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS1_MASK                    equ 0002h
CCP1CAP_CCP1CTS2_POSN                    equ 0002h
CCP1CAP_CCP1CTS2_POSITION                equ 0002h
CCP1CAP_CCP1CTS2_SIZE                    equ 0001h
CCP1CAP_CCP1CTS2_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS2_MASK                    equ 0004h

// Register: RXB0CON
#define RXB0CON RXB0CON
RXB0CON                                  equ 03F80h
// bitfield definitions
RXB0CON_FILHIT0_POSN                     equ 0000h
RXB0CON_FILHIT0_POSITION                 equ 0000h
RXB0CON_FILHIT0_SIZE                     equ 0001h
RXB0CON_FILHIT0_LENGTH                   equ 0001h
RXB0CON_FILHIT0_MASK                     equ 0001h
RXB0CON_JTOFF_FILHIT1_POSN               equ 0001h
RXB0CON_JTOFF_FILHIT1_POSITION           equ 0001h
RXB0CON_JTOFF_FILHIT1_SIZE               equ 0001h
RXB0CON_JTOFF_FILHIT1_LENGTH             equ 0001h
RXB0CON_JTOFF_FILHIT1_MASK               equ 0002h
RXB0CON_RB0DBEN_FILHIT2_POSN             equ 0002h
RXB0CON_RB0DBEN_FILHIT2_POSITION         equ 0002h
RXB0CON_RB0DBEN_FILHIT2_SIZE             equ 0001h
RXB0CON_RB0DBEN_FILHIT2_LENGTH           equ 0001h
RXB0CON_RB0DBEN_FILHIT2_MASK             equ 0004h
RXB0CON_RXRTRRO_FILHIT3_POSN             equ 0003h
RXB0CON_RXRTRRO_FILHIT3_POSITION         equ 0003h
RXB0CON_RXRTRRO_FILHIT3_SIZE             equ 0001h
RXB0CON_RXRTRRO_FILHIT3_LENGTH           equ 0001h
RXB0CON_RXRTRRO_FILHIT3_MASK             equ 0008h
RXB0CON_FILHIT4_POSN                     equ 0004h
RXB0CON_FILHIT4_POSITION                 equ 0004h
RXB0CON_FILHIT4_SIZE                     equ 0001h
RXB0CON_FILHIT4_LENGTH                   equ 0001h
RXB0CON_FILHIT4_MASK                     equ 0010h
RXB0CON_RXM0_RTRRO_POSN                  equ 0005h
RXB0CON_RXM0_RTRRO_POSITION              equ 0005h
RXB0CON_RXM0_RTRRO_SIZE                  equ 0001h
RXB0CON_RXM0_RTRRO_LENGTH                equ 0001h
RXB0CON_RXM0_RTRRO_MASK                  equ 0020h
RXB0CON_RXM1_POSN                        equ 0006h
RXB0CON_RXM1_POSITION                    equ 0006h
RXB0CON_RXM1_SIZE                        equ 0001h
RXB0CON_RXM1_LENGTH                      equ 0001h
RXB0CON_RXM1_MASK                        equ 0040h
RXB0CON_RXFUL_POSN                       equ 0007h
RXB0CON_RXFUL_POSITION                   equ 0007h
RXB0CON_RXFUL_SIZE                       equ 0001h
RXB0CON_RXFUL_LENGTH                     equ 0001h
RXB0CON_RXFUL_MASK                       equ 0080h
RXB0CON_FILHIT_POSN                      equ 0000h
RXB0CON_FILHIT_POSITION                  equ 0000h
RXB0CON_FILHIT_SIZE                      equ 0005h
RXB0CON_FILHIT_LENGTH                    equ 0005h
RXB0CON_FILHIT_MASK                      equ 001Fh
RXB0CON_RTRRO_POSN                       equ 0005h
RXB0CON_RTRRO_POSITION                   equ 0005h
RXB0CON_RTRRO_SIZE                       equ 0001h
RXB0CON_RTRRO_LENGTH                     equ 0001h
RXB0CON_RTRRO_MASK                       equ 0020h
RXB0CON_FILHIT1_POSN                     equ 0001h
RXB0CON_FILHIT1_POSITION                 equ 0001h
RXB0CON_FILHIT1_SIZE                     equ 0001h
RXB0CON_FILHIT1_LENGTH                   equ 0001h
RXB0CON_FILHIT1_MASK                     equ 0002h
RXB0CON_FILHIT2_POSN                     equ 0002h
RXB0CON_FILHIT2_POSITION                 equ 0002h
RXB0CON_FILHIT2_SIZE                     equ 0001h
RXB0CON_FILHIT2_LENGTH                   equ 0001h
RXB0CON_FILHIT2_MASK                     equ 0004h
RXB0CON_FILHIT3_POSN                     equ 0003h
RXB0CON_FILHIT3_POSITION                 equ 0003h
RXB0CON_FILHIT3_SIZE                     equ 0001h
RXB0CON_FILHIT3_LENGTH                   equ 0001h
RXB0CON_FILHIT3_MASK                     equ 0008h
RXB0CON_RXM0_POSN                        equ 0005h
RXB0CON_RXM0_POSITION                    equ 0005h
RXB0CON_RXM0_SIZE                        equ 0001h
RXB0CON_RXM0_LENGTH                      equ 0001h
RXB0CON_RXM0_MASK                        equ 0020h
RXB0CON_JTOFF_POSN                       equ 0001h
RXB0CON_JTOFF_POSITION                   equ 0001h
RXB0CON_JTOFF_SIZE                       equ 0001h
RXB0CON_JTOFF_LENGTH                     equ 0001h
RXB0CON_JTOFF_MASK                       equ 0002h
RXB0CON_RB0DBEN_POSN                     equ 0002h
RXB0CON_RB0DBEN_POSITION                 equ 0002h
RXB0CON_RB0DBEN_SIZE                     equ 0001h
RXB0CON_RB0DBEN_LENGTH                   equ 0001h
RXB0CON_RB0DBEN_MASK                     equ 0004h
RXB0CON_RXRTRRO_POSN                     equ 0003h
RXB0CON_RXRTRRO_POSITION                 equ 0003h
RXB0CON_RXRTRRO_SIZE                     equ 0001h
RXB0CON_RXRTRRO_LENGTH                   equ 0001h
RXB0CON_RXRTRRO_MASK                     equ 0008h

// Register: RXB0SIDH
#define RXB0SIDH RXB0SIDH
RXB0SIDH                                 equ 03F81h
// bitfield definitions
RXB0SIDH_SID3_POSN                       equ 0000h
RXB0SIDH_SID3_POSITION                   equ 0000h
RXB0SIDH_SID3_SIZE                       equ 0001h
RXB0SIDH_SID3_LENGTH                     equ 0001h
RXB0SIDH_SID3_MASK                       equ 0001h
RXB0SIDH_SID4_POSN                       equ 0001h
RXB0SIDH_SID4_POSITION                   equ 0001h
RXB0SIDH_SID4_SIZE                       equ 0001h
RXB0SIDH_SID4_LENGTH                     equ 0001h
RXB0SIDH_SID4_MASK                       equ 0002h
RXB0SIDH_SID5_POSN                       equ 0002h
RXB0SIDH_SID5_POSITION                   equ 0002h
RXB0SIDH_SID5_SIZE                       equ 0001h
RXB0SIDH_SID5_LENGTH                     equ 0001h
RXB0SIDH_SID5_MASK                       equ 0004h
RXB0SIDH_SID6_POSN                       equ 0003h
RXB0SIDH_SID6_POSITION                   equ 0003h
RXB0SIDH_SID6_SIZE                       equ 0001h
RXB0SIDH_SID6_LENGTH                     equ 0001h
RXB0SIDH_SID6_MASK                       equ 0008h
RXB0SIDH_SID7_POSN                       equ 0004h
RXB0SIDH_SID7_POSITION                   equ 0004h
RXB0SIDH_SID7_SIZE                       equ 0001h
RXB0SIDH_SID7_LENGTH                     equ 0001h
RXB0SIDH_SID7_MASK                       equ 0010h
RXB0SIDH_SID8_POSN                       equ 0005h
RXB0SIDH_SID8_POSITION                   equ 0005h
RXB0SIDH_SID8_SIZE                       equ 0001h
RXB0SIDH_SID8_LENGTH                     equ 0001h
RXB0SIDH_SID8_MASK                       equ 0020h
RXB0SIDH_SID9_POSN                       equ 0006h
RXB0SIDH_SID9_POSITION                   equ 0006h
RXB0SIDH_SID9_SIZE                       equ 0001h
RXB0SIDH_SID9_LENGTH                     equ 0001h
RXB0SIDH_SID9_MASK                       equ 0040h
RXB0SIDH_SID10_POSN                      equ 0007h
RXB0SIDH_SID10_POSITION                  equ 0007h
RXB0SIDH_SID10_SIZE                      equ 0001h
RXB0SIDH_SID10_LENGTH                    equ 0001h
RXB0SIDH_SID10_MASK                      equ 0080h
RXB0SIDH_EID21_POSN                      equ 0000h
RXB0SIDH_EID21_POSITION                  equ 0000h
RXB0SIDH_EID21_SIZE                      equ 0001h
RXB0SIDH_EID21_LENGTH                    equ 0001h
RXB0SIDH_EID21_MASK                      equ 0001h
RXB0SIDH_EID22_POSN                      equ 0001h
RXB0SIDH_EID22_POSITION                  equ 0001h
RXB0SIDH_EID22_SIZE                      equ 0001h
RXB0SIDH_EID22_LENGTH                    equ 0001h
RXB0SIDH_EID22_MASK                      equ 0002h
RXB0SIDH_EID23_POSN                      equ 0002h
RXB0SIDH_EID23_POSITION                  equ 0002h
RXB0SIDH_EID23_SIZE                      equ 0001h
RXB0SIDH_EID23_LENGTH                    equ 0001h
RXB0SIDH_EID23_MASK                      equ 0004h
RXB0SIDH_EID24_POSN                      equ 0003h
RXB0SIDH_EID24_POSITION                  equ 0003h
RXB0SIDH_EID24_SIZE                      equ 0001h
RXB0SIDH_EID24_LENGTH                    equ 0001h
RXB0SIDH_EID24_MASK                      equ 0008h
RXB0SIDH_EID25_POSN                      equ 0004h
RXB0SIDH_EID25_POSITION                  equ 0004h
RXB0SIDH_EID25_SIZE                      equ 0001h
RXB0SIDH_EID25_LENGTH                    equ 0001h
RXB0SIDH_EID25_MASK                      equ 0010h
RXB0SIDH_EID26_POSN                      equ 0005h
RXB0SIDH_EID26_POSITION                  equ 0005h
RXB0SIDH_EID26_SIZE                      equ 0001h
RXB0SIDH_EID26_LENGTH                    equ 0001h
RXB0SIDH_EID26_MASK                      equ 0020h
RXB0SIDH_EID27_POSN                      equ 0006h
RXB0SIDH_EID27_POSITION                  equ 0006h
RXB0SIDH_EID27_SIZE                      equ 0001h
RXB0SIDH_EID27_LENGTH                    equ 0001h
RXB0SIDH_EID27_MASK                      equ 0040h
RXB0SIDH_EID28_POSN                      equ 0007h
RXB0SIDH_EID28_POSITION                  equ 0007h
RXB0SIDH_EID28_SIZE                      equ 0001h
RXB0SIDH_EID28_LENGTH                    equ 0001h
RXB0SIDH_EID28_MASK                      equ 0080h
RXB0SIDH_SID_POSN                        equ 0000h
RXB0SIDH_SID_POSITION                    equ 0000h
RXB0SIDH_SID_SIZE                        equ 0008h
RXB0SIDH_SID_LENGTH                      equ 0008h
RXB0SIDH_SID_MASK                        equ 00FFh

