GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
// Register: TMR5H
#define TMR5H TMR5H
TMR5H                                    equ 03F99h
// bitfield definitions
TMR5H_TMR5H_POSN                         equ 0000h
TMR5H_TMR5H_POSITION                     equ 0000h
TMR5H_TMR5H_SIZE                         equ 0008h
TMR5H_TMR5H_LENGTH                       equ 0008h
TMR5H_TMR5H_MASK                         equ 00FFh
TMR5H_TMR5H0_POSN                        equ 0000h
TMR5H_TMR5H0_POSITION                    equ 0000h
TMR5H_TMR5H0_SIZE                        equ 0001h
TMR5H_TMR5H0_LENGTH                      equ 0001h
TMR5H_TMR5H0_MASK                        equ 0001h
TMR5H_TMR5H1_POSN                        equ 0001h
TMR5H_TMR5H1_POSITION                    equ 0001h
TMR5H_TMR5H1_SIZE                        equ 0001h
TMR5H_TMR5H1_LENGTH                      equ 0001h
TMR5H_TMR5H1_MASK                        equ 0002h
TMR5H_TMR5H2_POSN                        equ 0002h
TMR5H_TMR5H2_POSITION                    equ 0002h
TMR5H_TMR5H2_SIZE                        equ 0001h
TMR5H_TMR5H2_LENGTH                      equ 0001h
TMR5H_TMR5H2_MASK                        equ 0004h
TMR5H_TMR5H3_POSN                        equ 0003h
TMR5H_TMR5H3_POSITION                    equ 0003h
TMR5H_TMR5H3_SIZE                        equ 0001h
TMR5H_TMR5H3_LENGTH                      equ 0001h
TMR5H_TMR5H3_MASK                        equ 0008h
TMR5H_TMR5H4_POSN                        equ 0004h
TMR5H_TMR5H4_POSITION                    equ 0004h
TMR5H_TMR5H4_SIZE                        equ 0001h
TMR5H_TMR5H4_LENGTH                      equ 0001h
TMR5H_TMR5H4_MASK                        equ 0010h
TMR5H_TMR5H5_POSN                        equ 0005h
TMR5H_TMR5H5_POSITION                    equ 0005h
TMR5H_TMR5H5_SIZE                        equ 0001h
TMR5H_TMR5H5_LENGTH                      equ 0001h
TMR5H_TMR5H5_MASK                        equ 0020h
TMR5H_TMR5H6_POSN                        equ 0006h
TMR5H_TMR5H6_POSITION                    equ 0006h
TMR5H_TMR5H6_SIZE                        equ 0001h
TMR5H_TMR5H6_LENGTH                      equ 0001h
TMR5H_TMR5H6_MASK                        equ 0040h
TMR5H_TMR5H7_POSN                        equ 0007h
TMR5H_TMR5H7_POSITION                    equ 0007h
TMR5H_TMR5H7_SIZE                        equ 0001h
TMR5H_TMR5H7_LENGTH                      equ 0001h
TMR5H_TMR5H7_MASK                        equ 0080h

// Register: T5CON
#define T5CON T5CON
T5CON                                    equ 03F9Ah
// bitfield definitions
T5CON_ON_POSN                            equ 0000h
T5CON_ON_POSITION                        equ 0000h
T5CON_ON_SIZE                            equ 0001h
T5CON_ON_LENGTH                          equ 0001h
T5CON_ON_MASK                            equ 0001h
T5CON_RD16_POSN                          equ 0001h
T5CON_RD16_POSITION                      equ 0001h
T5CON_RD16_SIZE                          equ 0001h
T5CON_RD16_LENGTH                        equ 0001h
T5CON_RD16_MASK                          equ 0002h
T5CON_NOT_SYNC_POSN                      equ 0002h
T5CON_NOT_SYNC_POSITION                  equ 0002h
T5CON_NOT_SYNC_SIZE                      equ 0001h
T5CON_NOT_SYNC_LENGTH                    equ 0001h
T5CON_NOT_SYNC_MASK                      equ 0004h
T5CON_CKPS_POSN                          equ 0004h
T5CON_CKPS_POSITION                      equ 0004h
T5CON_CKPS_SIZE                          equ 0002h
T5CON_CKPS_LENGTH                        equ 0002h
T5CON_CKPS_MASK                          equ 0030h
T5CON_TMR5ON_POSN                        equ 0000h
T5CON_TMR5ON_POSITION                    equ 0000h
T5CON_TMR5ON_SIZE                        equ 0001h
T5CON_TMR5ON_LENGTH                      equ 0001h
T5CON_TMR5ON_MASK                        equ 0001h
T5CON_T5RD16_POSN                        equ 0001h
T5CON_T5RD16_POSITION                    equ 0001h
T5CON_T5RD16_SIZE                        equ 0001h
T5CON_T5RD16_LENGTH                      equ 0001h
T5CON_T5RD16_MASK                        equ 0002h
T5CON_NOT_T5SYNC_POSN                    equ 0002h
T5CON_NOT_T5SYNC_POSITION                equ 0002h
T5CON_NOT_T5SYNC_SIZE                    equ 0001h
T5CON_NOT_T5SYNC_LENGTH                  equ 0001h
T5CON_NOT_T5SYNC_MASK                    equ 0004h
T5CON_T5CKPS0_POSN                       equ 0004h
T5CON_T5CKPS0_POSITION                   equ 0004h
T5CON_T5CKPS0_SIZE                       equ 0001h
T5CON_T5CKPS0_LENGTH                     equ 0001h
T5CON_T5CKPS0_MASK                       equ 0010h
T5CON_T5CKPS1_POSN                       equ 0005h
T5CON_T5CKPS1_POSITION                   equ 0005h
T5CON_T5CKPS1_SIZE                       equ 0001h
T5CON_T5CKPS1_LENGTH                     equ 0001h
T5CON_T5CKPS1_MASK                       equ 0020h
T5CON_CKPS0_POSN                         equ 0004h
T5CON_CKPS0_POSITION                     equ 0004h
T5CON_CKPS0_SIZE                         equ 0001h
T5CON_CKPS0_LENGTH                       equ 0001h
T5CON_CKPS0_MASK                         equ 0010h
T5CON_CKPS1_POSN                         equ 0005h
T5CON_CKPS1_POSITION                     equ 0005h
T5CON_CKPS1_SIZE                         equ 0001h
T5CON_CKPS1_LENGTH                       equ 0001h
T5CON_CKPS1_MASK                         equ 0020h
T5CON_RD165_POSN                         equ 0001h
T5CON_RD165_POSITION                     equ 0001h
T5CON_RD165_SIZE                         equ 0001h
T5CON_RD165_LENGTH                       equ 0001h
T5CON_RD165_MASK                         equ 0002h

// Register: T5GCON
#define T5GCON T5GCON
T5GCON                                   equ 03F9Bh
// bitfield definitions
T5GCON_GVAL_POSN                         equ 0002h
T5GCON_GVAL_POSITION                     equ 0002h
T5GCON_GVAL_SIZE                         equ 0001h
T5GCON_GVAL_LENGTH                       equ 0001h
T5GCON_GVAL_MASK                         equ 0004h
T5GCON_GGO_POSN                          equ 0003h
T5GCON_GGO_POSITION                      equ 0003h
T5GCON_GGO_SIZE                          equ 0001h
T5GCON_GGO_LENGTH                        equ 0001h
T5GCON_GGO_MASK                          equ 0008h
T5GCON_GSPM_POSN                         equ 0004h
T5GCON_GSPM_POSITION                     equ 0004h
T5GCON_GSPM_SIZE                         equ 0001h
T5GCON_GSPM_LENGTH                       equ 0001h
T5GCON_GSPM_MASK                         equ 0010h
T5GCON_GTM_POSN                          equ 0005h
T5GCON_GTM_POSITION                      equ 0005h
T5GCON_GTM_SIZE                          equ 0001h
T5GCON_GTM_LENGTH                        equ 0001h
T5GCON_GTM_MASK                          equ 0020h
T5GCON_GPOL_POSN                         equ 0006h
T5GCON_GPOL_POSITION                     equ 0006h
T5GCON_GPOL_SIZE                         equ 0001h
T5GCON_GPOL_LENGTH                       equ 0001h
T5GCON_GPOL_MASK                         equ 0040h
T5GCON_GE_POSN                           equ 0007h
T5GCON_GE_POSITION                       equ 0007h
T5GCON_GE_SIZE                           equ 0001h
T5GCON_GE_LENGTH                         equ 0001h
T5GCON_GE_MASK                           equ 0080h
T5GCON_T5GVAL_POSN                       equ 0002h
T5GCON_T5GVAL_POSITION                   equ 0002h
T5GCON_T5GVAL_SIZE                       equ 0001h
T5GCON_T5GVAL_LENGTH                     equ 0001h
T5GCON_T5GVAL_MASK                       equ 0004h
T5GCON_T5GGO_POSN                        equ 0003h
T5GCON_T5GGO_POSITION                    equ 0003h
T5GCON_T5GGO_SIZE                        equ 0001h
T5GCON_T5GGO_LENGTH                      equ 0001h
T5GCON_T5GGO_MASK                        equ 0008h
T5GCON_T5GSPM_POSN                       equ 0004h
T5GCON_T5GSPM_POSITION                   equ 0004h
T5GCON_T5GSPM_SIZE                       equ 0001h
T5GCON_T5GSPM_LENGTH                     equ 0001h
T5GCON_T5GSPM_MASK                       equ 0010h
T5GCON_T5GTM_POSN                        equ 0005h
T5GCON_T5GTM_POSITION                    equ 0005h
T5GCON_T5GTM_SIZE                        equ 0001h
T5GCON_T5GTM_LENGTH                      equ 0001h
T5GCON_T5GTM_MASK                        equ 0020h
T5GCON_T5GPOL_POSN                       equ 0006h
T5GCON_T5GPOL_POSITION                   equ 0006h
T5GCON_T5GPOL_SIZE                       equ 0001h
T5GCON_T5GPOL_LENGTH                     equ 0001h
T5GCON_T5GPOL_MASK                       equ 0040h
T5GCON_T5GE_POSN                         equ 0007h
T5GCON_T5GE_POSITION                     equ 0007h
T5GCON_T5GE_SIZE                         equ 0001h
T5GCON_T5GE_LENGTH                       equ 0001h
T5GCON_T5GE_MASK                         equ 0080h
T5GCON_NOT_DONE_POSN                     equ 0003h
T5GCON_NOT_DONE_POSITION                 equ 0003h
T5GCON_NOT_DONE_SIZE                     equ 0001h
T5GCON_NOT_DONE_LENGTH                   equ 0001h
T5GCON_NOT_DONE_MASK                     equ 0008h
T5GCON_NOT_T5DONE_POSN                   equ 0003h
T5GCON_NOT_T5DONE_POSITION               equ 0003h
T5GCON_NOT_T5DONE_SIZE                   equ 0001h
T5GCON_NOT_T5DONE_LENGTH                 equ 0001h
T5GCON_NOT_T5DONE_MASK                   equ 0008h

// Register: T5GATE
#define T5GATE T5GATE
T5GATE                                   equ 03F9Ch
// bitfield definitions
T5GATE_GSS_POSN                          equ 0000h
T5GATE_GSS_POSITION                      equ 0000h
T5GATE_GSS_SIZE                          equ 0008h
T5GATE_GSS_LENGTH                        equ 0008h
T5GATE_GSS_MASK                          equ 00FFh
T5GATE_GSS0_POSN                         equ 0000h
T5GATE_GSS0_POSITION                     equ 0000h
T5GATE_GSS0_SIZE                         equ 0001h
T5GATE_GSS0_LENGTH                       equ 0001h
T5GATE_GSS0_MASK                         equ 0001h
T5GATE_GSS1_POSN                         equ 0001h
T5GATE_GSS1_POSITION                     equ 0001h
T5GATE_GSS1_SIZE                         equ 0001h
T5GATE_GSS1_LENGTH                       equ 0001h
T5GATE_GSS1_MASK                         equ 0002h
T5GATE_GSS2_POSN                         equ 0002h
T5GATE_GSS2_POSITION                     equ 0002h
T5GATE_GSS2_SIZE                         equ 0001h
T5GATE_GSS2_LENGTH                       equ 0001h
T5GATE_GSS2_MASK                         equ 0004h
T5GATE_GSS3_POSN                         equ 0003h
T5GATE_GSS3_POSITION                     equ 0003h
T5GATE_GSS3_SIZE                         equ 0001h
T5GATE_GSS3_LENGTH                       equ 0001h
T5GATE_GSS3_MASK                         equ 0008h
T5GATE_GSS4_POSN                         equ 0004h
T5GATE_GSS4_POSITION                     equ 0004h
T5GATE_GSS4_SIZE                         equ 0001h
T5GATE_GSS4_LENGTH                       equ 0001h
T5GATE_GSS4_MASK                         equ 0010h
T5GATE_T5GSS0_POSN                       equ 0000h
T5GATE_T5GSS0_POSITION                   equ 0000h
T5GATE_T5GSS0_SIZE                       equ 0001h
T5GATE_T5GSS0_LENGTH                     equ 0001h
T5GATE_T5GSS0_MASK                       equ 0001h
T5GATE_T5GSS1_POSN                       equ 0001h
T5GATE_T5GSS1_POSITION                   equ 0001h
T5GATE_T5GSS1_SIZE                       equ 0001h
T5GATE_T5GSS1_LENGTH                     equ 0001h
T5GATE_T5GSS1_MASK                       equ 0002h
T5GATE_T5GSS2_POSN                       equ 0002h
T5GATE_T5GSS2_POSITION                   equ 0002h
T5GATE_T5GSS2_SIZE                       equ 0001h
T5GATE_T5GSS2_LENGTH                     equ 0001h
T5GATE_T5GSS2_MASK                       equ 0004h
T5GATE_T5GSS3_POSN                       equ 0003h
T5GATE_T5GSS3_POSITION                   equ 0003h
T5GATE_T5GSS3_SIZE                       equ 0001h
T5GATE_T5GSS3_LENGTH                     equ 0001h
T5GATE_T5GSS3_MASK                       equ 0008h
T5GATE_T5GSS4_POSN                       equ 0004h
T5GATE_T5GSS4_POSITION                   equ 0004h
T5GATE_T5GSS4_SIZE                       equ 0001h
T5GATE_T5GSS4_LENGTH                     equ 0001h
T5GATE_T5GSS4_MASK                       equ 0010h

// Register: T5CLK
#define T5CLK T5CLK
T5CLK                                    equ 03F9Dh
// bitfield definitions
T5CLK_CS_POSN                            equ 0000h
T5CLK_CS_POSITION                        equ 0000h
T5CLK_CS_SIZE                            equ 0008h
T5CLK_CS_LENGTH                          equ 0008h
T5CLK_CS_MASK                            equ 00FFh
T5CLK_T5CS0_POSN                         equ 0000h
T5CLK_T5CS0_POSITION                     equ 0000h
T5CLK_T5CS0_SIZE                         equ 0001h
T5CLK_T5CS0_LENGTH                       equ 0001h
T5CLK_T5CS0_MASK                         equ 0001h
T5CLK_T5CS1_POSN                         equ 0001h
T5CLK_T5CS1_POSITION                     equ 0001h
T5CLK_T5CS1_SIZE                         equ 0001h
T5CLK_T5CS1_LENGTH                       equ 0001h
T5CLK_T5CS1_MASK                         equ 0002h
T5CLK_T5CS2_POSN                         equ 0002h
T5CLK_T5CS2_POSITION                     equ 0002h
T5CLK_T5CS2_SIZE                         equ 0001h
T5CLK_T5CS2_LENGTH                       equ 0001h
T5CLK_T5CS2_MASK                         equ 0004h
T5CLK_T5CS3_POSN                         equ 0003h
T5CLK_T5CS3_POSITION                     equ 0003h
T5CLK_T5CS3_SIZE                         equ 0001h
T5CLK_T5CS3_LENGTH                       equ 0001h
T5CLK_T5CS3_MASK                         equ 0008h
T5CLK_T5CS4_POSN                         equ 0004h
T5CLK_T5CS4_POSITION                     equ 0004h
T5CLK_T5CS4_SIZE                         equ 0001h
T5CLK_T5CS4_LENGTH                       equ 0001h
T5CLK_T5CS4_MASK                         equ 0010h
T5CLK_CS0_POSN                           equ 0000h
T5CLK_CS0_POSITION                       equ 0000h
T5CLK_CS0_SIZE                           equ 0001h
T5CLK_CS0_LENGTH                         equ 0001h
T5CLK_CS0_MASK                           equ 0001h
T5CLK_CS1_POSN                           equ 0001h
T5CLK_CS1_POSITION                       equ 0001h
T5CLK_CS1_SIZE                           equ 0001h
T5CLK_CS1_LENGTH                         equ 0001h
T5CLK_CS1_MASK                           equ 0002h
T5CLK_CS2_POSN                           equ 0002h
T5CLK_CS2_POSITION                       equ 0002h
T5CLK_CS2_SIZE                           equ 0001h
T5CLK_CS2_LENGTH                         equ 0001h
T5CLK_CS2_MASK                           equ 0004h
T5CLK_CS3_POSN                           equ 0003h
T5CLK_CS3_POSITION                       equ 0003h
T5CLK_CS3_SIZE                           equ 0001h
T5CLK_CS3_LENGTH                         equ 0001h
T5CLK_CS3_MASK                           equ 0008h
T5CLK_CS4_POSN                           equ 0004h
T5CLK_CS4_POSITION                       equ 0004h
T5CLK_CS4_SIZE                           equ 0001h
T5CLK_CS4_LENGTH                         equ 0001h
T5CLK_CS4_MASK                           equ 0010h

// Register: T4TMR
#define T4TMR T4TMR
T4TMR                                    equ 03F9Eh
// bitfield definitions
T4TMR_TMR4_POSN                          equ 0000h
T4TMR_TMR4_POSITION                      equ 0000h
T4TMR_TMR4_SIZE                          equ 0008h
T4TMR_TMR4_LENGTH                        equ 0008h
T4TMR_TMR4_MASK                          equ 00FFh

// Register: T4PR
#define T4PR T4PR
T4PR                                     equ 03F9Fh
// bitfield definitions
T4PR_PR4_POSN                            equ 0000h
T4PR_PR4_POSITION                        equ 0000h
T4PR_PR4_SIZE                            equ 0008h
T4PR_PR4_LENGTH                          equ 0008h
T4PR_PR4_MASK                            equ 00FFh

// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 03FA0h
// bitfield definitions
T4CON_OUTPS_POSN                         equ 0000h
T4CON_OUTPS_POSITION                     equ 0000h
T4CON_OUTPS_SIZE                         equ 0004h
T4CON_OUTPS_LENGTH                       equ 0004h
T4CON_OUTPS_MASK                         equ 000Fh
T4CON_CKPS_POSN                          equ 0004h
T4CON_CKPS_POSITION                      equ 0004h
T4CON_CKPS_SIZE                          equ 0003h
T4CON_CKPS_LENGTH                        equ 0003h
T4CON_CKPS_MASK                          equ 0070h
T4CON_ON_POSN                            equ 0007h
T4CON_ON_POSITION                        equ 0007h
T4CON_ON_SIZE                            equ 0001h
T4CON_ON_LENGTH                          equ 0001h
T4CON_ON_MASK                            equ 0080h
T4CON_T4OUTPS_POSN                       equ 0000h
T4CON_T4OUTPS_POSITION                   equ 0000h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 000Fh
T4CON_T4CKPS_POSN                        equ 0004h
T4CON_T4CKPS_POSITION                    equ 0004h
T4CON_T4CKPS_SIZE                        equ 0003h
T4CON_T4CKPS_LENGTH                      equ 0003h
T4CON_T4CKPS_MASK                        equ 0070h
T4CON_T4ON_POSN                          equ 0007h
T4CON_T4ON_POSITION                      equ 0007h
T4CON_T4ON_SIZE                          equ 0001h
T4CON_T4ON_LENGTH                        equ 0001h
T4CON_T4ON_MASK                          equ 0080h
T4CON_T4OUTPS0_POSN                      equ 0000h
T4CON_T4OUTPS0_POSITION                  equ 0000h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0001h
T4CON_T4OUTPS1_POSN                      equ 0001h
T4CON_T4OUTPS1_POSITION                  equ 0001h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0002h
T4CON_T4OUTPS2_POSN                      equ 0002h
T4CON_T4OUTPS2_POSITION                  equ 0002h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0004h
T4CON_T4OUTPS3_POSN                      equ 0003h
T4CON_T4OUTPS3_POSITION                  equ 0003h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0008h
T4CON_T4CKPS0_POSN                       equ 0004h
T4CON_T4CKPS0_POSITION                   equ 0004h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0010h
T4CON_T4CKPS1_POSN                       equ 0005h
T4CON_T4CKPS1_POSITION                   equ 0005h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0020h
T4CON_T4CKPS2_POSN                       equ 0006h
T4CON_T4CKPS2_POSITION                   equ 0006h
T4CON_T4CKPS2_SIZE                       equ 0001h
T4CON_T4CKPS2_LENGTH                     equ 0001h
T4CON_T4CKPS2_MASK                       equ 0040h
T4CON_OUTPS0_POSN                        equ 0000h
T4CON_OUTPS0_POSITION                    equ 0000h
T4CON_OUTPS0_SIZE                        equ 0001h
T4CON_OUTPS0_LENGTH                      equ 0001h
T4CON_OUTPS0_MASK                        equ 0001h
T4CON_OUTPS1_POSN                        equ 0001h
T4CON_OUTPS1_POSITION                    equ 0001h
T4CON_OUTPS1_SIZE                        equ 0001h
T4CON_OUTPS1_LENGTH                      equ 0001h
T4CON_OUTPS1_MASK                        equ 0002h
T4CON_OUTPS2_POSN                        equ 0002h
T4CON_OUTPS2_POSITION                    equ 0002h
T4CON_OUTPS2_SIZE                        equ 0001h
T4CON_OUTPS2_LENGTH                      equ 0001h
T4CON_OUTPS2_MASK                        equ 0004h
T4CON_OUTPS3_POSN                        equ 0003h
T4CON_OUTPS3_POSITION                    equ 0003h
T4CON_OUTPS3_SIZE                        equ 0001h
T4CON_OUTPS3_LENGTH                      equ 0001h
T4CON_OUTPS3_MASK                        equ 0008h
T4CON_CKPS0_POSN                         equ 0004h
T4CON_CKPS0_POSITION                     equ 0004h
T4CON_CKPS0_SIZE                         equ 0001h
T4CON_CKPS0_LENGTH                       equ 0001h
T4CON_CKPS0_MASK                         equ 0010h
T4CON_CKPS1_POSN                         equ 0005h
T4CON_CKPS1_POSITION                     equ 0005h
T4CON_CKPS1_SIZE                         equ 0001h
T4CON_CKPS1_LENGTH                       equ 0001h
T4CON_CKPS1_MASK                         equ 0020h
T4CON_CKPS2_POSN                         equ 0006h
T4CON_CKPS2_POSITION                     equ 0006h
T4CON_CKPS2_SIZE                         equ 0001h
T4CON_CKPS2_LENGTH                       equ 0001h
T4CON_CKPS2_MASK                         equ 0040h
T4CON_TMR4ON_POSN                        equ 0007h
T4CON_TMR4ON_POSITION                    equ 0007h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0080h

