GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k83.inc
#define SMT2CPR14                        BANKMASK(SMT2CPRH), 6, b
#define SMT2CPR15                        BANKMASK(SMT2CPRH), 7, b
#define SMT2CPR16                        BANKMASK(SMT2CPRU), 0, b
#define SMT2CPR17                        BANKMASK(SMT2CPRU), 1, b
#define SMT2CPR18                        BANKMASK(SMT2CPRU), 2, b
#define SMT2CPR19                        BANKMASK(SMT2CPRU), 3, b
#define SMT2CPR2                         BANKMASK(SMT2CPRL), 2, b
#define SMT2CPR20                        BANKMASK(SMT2CPRU), 4, b
#define SMT2CPR21                        BANKMASK(SMT2CPRU), 5, b
#define SMT2CPR22                        BANKMASK(SMT2CPRU), 6, b
#define SMT2CPR23                        BANKMASK(SMT2CPRU), 7, b
#define SMT2CPR3                         BANKMASK(SMT2CPRL), 3, b
#define SMT2CPR4                         BANKMASK(SMT2CPRL), 4, b
#define SMT2CPR5                         BANKMASK(SMT2CPRL), 5, b
#define SMT2CPR6                         BANKMASK(SMT2CPRL), 6, b
#define SMT2CPR7                         BANKMASK(SMT2CPRL), 7, b
#define SMT2CPR8                         BANKMASK(SMT2CPRH), 0, b
#define SMT2CPR9                         BANKMASK(SMT2CPRH), 1, b
#define SMT2CPRUP                        BANKMASK(SMT2STAT), 7, b
#define SMT2CPW0                         BANKMASK(SMT2CPWL), 0, b
#define SMT2CPW1                         BANKMASK(SMT2CPWL), 1, b
#define SMT2CPW10                        BANKMASK(SMT2CPWH), 2, b
#define SMT2CPW11                        BANKMASK(SMT2CPWH), 3, b
#define SMT2CPW12                        BANKMASK(SMT2CPWH), 4, b
#define SMT2CPW13                        BANKMASK(SMT2CPWH), 5, b
#define SMT2CPW14                        BANKMASK(SMT2CPWH), 6, b
#define SMT2CPW15                        BANKMASK(SMT2CPWH), 7, b
#define SMT2CPW16                        BANKMASK(SMT2CPWU), 0, b
#define SMT2CPW17                        BANKMASK(SMT2CPWU), 1, b
#define SMT2CPW18                        BANKMASK(SMT2CPWU), 2, b
#define SMT2CPW19                        BANKMASK(SMT2CPWU), 3, b
#define SMT2CPW2                         BANKMASK(SMT2CPWL), 2, b
#define SMT2CPW20                        BANKMASK(SMT2CPWU), 4, b
#define SMT2CPW21                        BANKMASK(SMT2CPWU), 5, b
#define SMT2CPW22                        BANKMASK(SMT2CPWU), 6, b
#define SMT2CPW23                        BANKMASK(SMT2CPWU), 7, b
#define SMT2CPW3                         BANKMASK(SMT2CPWL), 3, b
#define SMT2CPW4                         BANKMASK(SMT2CPWL), 4, b
#define SMT2CPW5                         BANKMASK(SMT2CPWL), 5, b
#define SMT2CPW6                         BANKMASK(SMT2CPWL), 6, b
#define SMT2CPW7                         BANKMASK(SMT2CPWL), 7, b
#define SMT2CPW8                         BANKMASK(SMT2CPWH), 0, b
#define SMT2CPW9                         BANKMASK(SMT2CPWH), 1, b
#define SMT2CPWUP                        BANKMASK(SMT2STAT), 6, b
#define SMT2CSEL0                        BANKMASK(SMT2CLK), 0, b
#define SMT2CSEL1                        BANKMASK(SMT2CLK), 1, b
#define SMT2CSEL2                        BANKMASK(SMT2CLK), 2, b
#define SMT2EN                           BANKMASK(SMT2CON0), 7, b
#define SMT2GO                           BANKMASK(SMT2CON1), 7, b
#define SMT2IE                           BANKMASK(PIE6), 1, b
#define SMT2IF                           BANKMASK(PIR6), 1, b
#define SMT2IP                           BANKMASK(IPR6), 1, b
#define SMT2MD                           BANKMASK(PMD6), 6, b
#define SMT2PR0                          BANKMASK(SMT2PRL), 0, b
#define SMT2PR1                          BANKMASK(SMT2PRL), 1, b
#define SMT2PR10                         BANKMASK(SMT2PRH), 2, b
#define SMT2PR11                         BANKMASK(SMT2PRH), 3, b
#define SMT2PR12                         BANKMASK(SMT2PRH), 4, b
#define SMT2PR13                         BANKMASK(SMT2PRH), 5, b
#define SMT2PR14                         BANKMASK(SMT2PRH), 6, b
#define SMT2PR15                         BANKMASK(SMT2PRH), 7, b
#define SMT2PR16                         BANKMASK(SMT2PRU), 0, b
#define SMT2PR17                         BANKMASK(SMT2PRU), 1, b
#define SMT2PR18                         BANKMASK(SMT2PRU), 2, b
#define SMT2PR19                         BANKMASK(SMT2PRU), 3, b
#define SMT2PR2                          BANKMASK(SMT2PRL), 2, b
#define SMT2PR20                         BANKMASK(SMT2PRU), 4, b
#define SMT2PR21                         BANKMASK(SMT2PRU), 5, b
#define SMT2PR22                         BANKMASK(SMT2PRU), 6, b
#define SMT2PR23                         BANKMASK(SMT2PRU), 7, b
#define SMT2PR3                          BANKMASK(SMT2PRL), 3, b
#define SMT2PR4                          BANKMASK(SMT2PRL), 4, b
#define SMT2PR5                          BANKMASK(SMT2PRL), 5, b
#define SMT2PR6                          BANKMASK(SMT2PRL), 6, b
#define SMT2PR7                          BANKMASK(SMT2PRL), 7, b
#define SMT2PR8                          BANKMASK(SMT2PRH), 0, b
#define SMT2PR9                          BANKMASK(SMT2PRH), 1, b
#define SMT2PRAIE                        BANKMASK(PIE6), 2, b
#define SMT2PRAIF                        BANKMASK(PIR6), 2, b
#define SMT2PRAIP                        BANKMASK(IPR6), 2, b
#define SMT2PS0                          BANKMASK(SMT2CON0), 0, b
#define SMT2PS1                          BANKMASK(SMT2CON0), 1, b
#define SMT2PWAIE                        BANKMASK(PIE6), 3, b
#define SMT2PWAIF                        BANKMASK(PIR6), 3, b
#define SMT2PWAIP                        BANKMASK(IPR6), 3, b
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6, b
#define SMT2RESET                        BANKMASK(SMT2STAT), 5, b
#define SMT2RST                          BANKMASK(SMT2STAT), 5, b
#define SMT2SPOL                         BANKMASK(SMT2CON0), 3, b
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0, b
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1, b
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2, b
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3, b
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4, b
#define SMT2STP                          BANKMASK(SMT2CON0), 5, b
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0, b
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1, b
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2, b
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3, b
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4, b
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5, b
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6, b
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7, b
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0, b
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1, b
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2, b
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3, b
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2, b
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4, b
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5, b
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6, b
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7, b
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3, b
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4, b
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5, b
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6, b
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7, b
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0, b
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1, b
#define SMT2TS                           BANKMASK(SMT2STAT), 2, b
#define SMT2WOL                          BANKMASK(SMT2CON0), 4, b
#define SMT2WS                           BANKMASK(SMT2STAT), 1, b
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0, b
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1, b
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2, b
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3, b
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SOSIE                            BANKMASK(SPI1INTE), 5, b
#define SOSIF                            BANKMASK(SPI1INTF), 5, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE2), 6, b
#define SPI1IF                           BANKMASK(PIR2), 6, b
#define SPI1IP                           BANKMASK(IPR2), 6, b
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE2), 4, b
#define SPI1RXIF                         BANKMASK(PIR2), 4, b
#define SPI1RXIP                         BANKMASK(IPR2), 4, b
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE2), 5, b
#define SPI1TXIF                         BANKMASK(PIR2), 5, b
#define SPI1TXIP                         BANKMASK(IPR2), 5, b
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SRMTIE                           BANKMASK(SPI1INTE), 7, b
#define SRMTIF                           BANKMASK(SPI1INTF), 7, b
#define SSET                             BANKMASK(SPI1CON2), 2, b
#define SSFLT                            BANKMASK(SPI1CON2), 6, b
#define SSP                              BANKMASK(SPI1CON1), 2, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, b
#define SWIF                             BANKMASK(PIR0), 0, b
#define SWIP                             BANKMASK(IPR0), 0, b
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, a
#define T0ASYNC                          BANKMASK(T0CON1), 4, a
#define T0CKPS0                          BANKMASK(T0CON1), 0, a
#define T0CKPS1                          BANKMASK(T0CON1), 1, a
#define T0CKPS2                          BANKMASK(T0CON1), 2, a
#define T0CKPS3                          BANKMASK(T0CON1), 3, a
#define T0CS0                            BANKMASK(T0CON1), 5, a
#define T0CS1                            BANKMASK(T0CON1), 6, a
#define T0CS2                            BANKMASK(T0CON1), 7, a
#define T0EN                             BANKMASK(T0CON0), 7, a
#define T0MD16                           BANKMASK(T0CON0), 4, a
#define T0OUT                            BANKMASK(T0CON0), 5, a
#define T0PR0                            BANKMASK(TMR0H), 0, a
#define T0PR1                            BANKMASK(TMR0H), 1, a
#define T0PR2                            BANKMASK(TMR0H), 2, a
#define T0PR3                            BANKMASK(TMR0H), 3, a
#define T0PR4                            BANKMASK(TMR0H), 4, a
#define T0PR5                            BANKMASK(TMR0H), 5, a
#define T0PR6                            BANKMASK(TMR0H), 6, a
#define T0PR7                            BANKMASK(TMR0H), 7, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1CS0                            BANKMASK(T1CLK), 0, a
#define T1CS1                            BANKMASK(T1CLK), 1, a
#define T1CS2                            BANKMASK(T1CLK), 2, a
#define T1CS3                            BANKMASK(T1CLK), 3, a
#define T1CS4                            BANKMASK(T1CLK), 4, a
#define T1GE                             BANKMASK(T1GCON), 7, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GATE), 0, a
#define T1GSS1                           BANKMASK(T1GATE), 1, a
#define T1GSS2                           BANKMASK(T1GATE), 2, a
#define T1GSS3                           BANKMASK(T1GATE), 3, a
#define T1GSS4                           BANKMASK(T1GATE), 4, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1RD16                           BANKMASK(T1CON), 1, a
#define T2CKPOL                          BANKMASK(T2HLT), 6, a
#define T2CKPS0                          BANKMASK(T2CON), 4, a
#define T2CKPS1                          BANKMASK(T2CON), 5, a
#define T2CKPS2                          BANKMASK(T2CON), 6, a
#define T2CKSYNC                         BANKMASK(T2HLT), 5, a
#define T2CS0                            BANKMASK(T2CLKCON), 0, a
#define T2CS1                            BANKMASK(T2CLKCON), 1, a
#define T2CS2                            BANKMASK(T2CLKCON), 2, a
#define T2CS3                            BANKMASK(T2CLKCON), 3, a
#define T2MODE0                          BANKMASK(T2HLT), 0, a
#define T2MODE1                          BANKMASK(T2HLT), 1, a
#define T2MODE2                          BANKMASK(T2HLT), 2, a
#define T2MODE3                          BANKMASK(T2HLT), 3, a
#define T2MODE4                          BANKMASK(T2HLT), 4, a
#define T2ON                             BANKMASK(T2CON), 7, a
#define T2OUTPS0                         BANKMASK(T2CON), 0, a
#define T2OUTPS1                         BANKMASK(T2CON), 1, a
#define T2OUTPS2                         BANKMASK(T2CON), 2, a
#define T2OUTPS3                         BANKMASK(T2CON), 3, a
#define T2PSYNC                          BANKMASK(T2HLT), 7, a
#define T2RSEL0                          BANKMASK(T2RST), 0, a
#define T2RSEL1                          BANKMASK(T2RST), 1, a
#define T2RSEL2                          BANKMASK(T2RST), 2, a
#define T2RSEL3                          BANKMASK(T2RST), 3, a
#define T2RSEL4                          BANKMASK(T2RST), 4, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CS0                            BANKMASK(T3CLK), 0, a
#define T3CS1                            BANKMASK(T3CLK), 1, a
#define T3CS2                            BANKMASK(T3CLK), 2, a
#define T3CS3                            BANKMASK(T3CLK), 3, a
#define T3CS4                            BANKMASK(T3CLK), 4, a
#define T3GE                             BANKMASK(T3GCON), 7, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GATE), 0, a
#define T3GSS1                           BANKMASK(T3GATE), 1, a
#define T3GSS2                           BANKMASK(T3GATE), 2, a
#define T3GSS3                           BANKMASK(T3GATE), 3, a
#define T3GSS4                           BANKMASK(T3GATE), 4, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 1, a
#define T4CKPOL                          BANKMASK(T4HLT), 6, a
#define T4CKPS0                          BANKMASK(T4CON), 4, a
#define T4CKPS1                          BANKMASK(T4CON), 5, a
#define T4CKPS2                          BANKMASK(T4CON), 6, a
#define T4CKSYNC                         BANKMASK(T4HLT), 5, a
#define T4CS0                            BANKMASK(T4CLKCON), 0, a
#define T4CS1                            BANKMASK(T4CLKCON), 1, a
#define T4CS2                            BANKMASK(T4CLKCON), 2, a
#define T4CS3                            BANKMASK(T4CLKCON), 3, a
#define T4MODE0                          BANKMASK(T4HLT), 0, a
#define T4MODE1                          BANKMASK(T4HLT), 1, a
#define T4MODE2                          BANKMASK(T4HLT), 2, a
#define T4MODE3                          BANKMASK(T4HLT), 3, a
#define T4MODE4                          BANKMASK(T4HLT), 4, a
#define T4ON                             BANKMASK(T4CON), 7, a
#define T4OUTPS0                         BANKMASK(T4CON), 0, a
#define T4OUTPS1                         BANKMASK(T4CON), 1, a
#define T4OUTPS2                         BANKMASK(T4CON), 2, a
#define T4OUTPS3                         BANKMASK(T4CON), 3, a
#define T4PSYNC                          BANKMASK(T4HLT), 7, a
#define T4RSEL0                          BANKMASK(T4RST), 0, a
#define T4RSEL1                          BANKMASK(T4RST), 1, a
#define T4RSEL2                          BANKMASK(T4RST), 2, a
#define T4RSEL3                          BANKMASK(T4RST), 3, a
#define T4RSEL4                          BANKMASK(T4RST), 4, a
#define T5CKPS0                          BANKMASK(T5CON), 4, a
#define T5CKPS1                          BANKMASK(T5CON), 5, a
#define T5CS0                            BANKMASK(T5CLK), 0, a
#define T5CS1                            BANKMASK(T5CLK), 1, a
#define T5CS2                            BANKMASK(T5CLK), 2, a
#define T5CS3                            BANKMASK(T5CLK), 3, a
#define T5CS4                            BANKMASK(T5CLK), 4, a
#define T5GE                             BANKMASK(T5GCON), 7, a
#define T5GGO                            BANKMASK(T5GCON), 3, a
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GATE), 0, a
#define T5GSS1                           BANKMASK(T5GATE), 1, a
#define T5GSS2                           BANKMASK(T5GATE), 2, a
#define T5GSS3                           BANKMASK(T5GATE), 3, a
#define T5GSS4                           BANKMASK(T5GATE), 4, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T5RD16                           BANKMASK(T5CON), 1, a
#define T6CKPOL                          BANKMASK(T6HLT), 6, a
#define T6CKPS0                          BANKMASK(T6CON), 4, a
#define T6CKPS1                          BANKMASK(T6CON), 5, a
#define T6CKPS2                          BANKMASK(T6CON), 6, a
#define T6CKSYNC                         BANKMASK(T6HLT), 5, a
#define T6CS0                            BANKMASK(T6CLKCON), 0, a
#define T6CS1                            BANKMASK(T6CLKCON), 1, a
#define T6CS2                            BANKMASK(T6CLKCON), 2, a
#define T6CS3                            BANKMASK(T6CLKCON), 3, a
#define T6MODE0                          BANKMASK(T6HLT), 0, a
#define T6MODE1                          BANKMASK(T6HLT), 1, a
#define T6MODE2                          BANKMASK(T6HLT), 2, a
#define T6MODE3                          BANKMASK(T6HLT), 3, a
#define T6MODE4                          BANKMASK(T6HLT), 4, a
#define T6ON                             BANKMASK(T6CON), 7, a
#define T6OUTPS0                         BANKMASK(T6CON), 0, a
#define T6OUTPS1                         BANKMASK(T6CON), 1, a
#define T6OUTPS2                         BANKMASK(T6CON), 2, a
#define T6OUTPS3                         BANKMASK(T6CON), 3, a
#define T6PSYNC                          BANKMASK(T6HLT), 7, a
#define T6RSEL0                          BANKMASK(T6RST), 0, a
#define T6RSEL1                          BANKMASK(T6RST), 1, a
#define T6RSEL2                          BANKMASK(T6RST), 2, a
#define T6RSEL3                          BANKMASK(T6RST), 3, a
#define T6RSEL4                          BANKMASK(T6RST), 4, a
#define TCZIE                            BANKMASK(SPI1INTE), 6, b
